[
    {
        "meme": "哇袄",
        "example_sentence": "哇袄 哇袄哇袄哇袄 哇袄哇袄 哇袄哇袄哇袄",
        "meaning": "An expression of excitement or amazement, often used to emphasize a reaction.",
        "source": "Commonly used in Chinese online communities, often associated with exaggerated excitement."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽要么日本人脑洞这么大，这都是生活现实啊，艺术源于生活高于生活",
        "meaning": "A slang expression used to convey surprise or shock, similar to 'OMG' or 'WTF'.",
        "source": "Widely used in Chinese internet slang."
    },
    {
        "meme": "我靠",
        "example_sentence": "我靠，梦幻联动",
        "meaning": "An exclamation expressing surprise or disbelief, similar to 'no way' or 'are you serious?'.",
        "source": "Common in Chinese online interactions."
    },
    {
        "meme": "这是牛逼的",
        "example_sentence": "太牛逼了，镜头里面的人和镜头外的人",
        "meaning": "Used to express admiration or amazement at something impressive.",
        "source": "Commonly found in various online discussions and comments."
    },
    {
        "meme": "100个百万",
        "example_sentence": "100个百万，字幕来纠错啊",
        "meaning": "Used to exaggerate a large number or emphasize the need for correction.",
        "source": "A humorous way of expressing confusion or disbelief."
    },
    {
        "meme": "一生悬命",
        "example_sentence": "一生悬命",
        "meaning": "Means to put one's life on the line for something, often used in a dramatic context.",
        "source": "Commonly used in dramatic or intense situations."
    },
    {
        "meme": "双击屏幕",
        "example_sentence": "双击屏幕即可使用「the world」保护你",
        "meaning": "Refers to a common action in apps and games, often used humorously.",
        "source": "Originates from gaming culture."
    },
    {
        "meme": "开大！",
        "example_sentence": "开大！开大！开大！",
        "meaning": "A call to use a powerful ability or action, often repeated for emphasis.",
        "source": "Common in gaming contexts, especially in multiplayer games."
    },
    {
        "meme": "你指尖跃动的电光，是我此生不变的信仰",
        "example_sentence": "你指尖跃动的电光，是我此生不变的信仰，唯我超电磁炮永世长存！",
        "meaning": "A poetic expression of unwavering belief or passion, often used in fandom contexts.",
        "source": "Derived from anime culture, particularly from 'Toaru Majutsu no Index'."
    },
    {
        "meme": "哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈哈哈哈哈哈哈",
        "meaning": "A common expression of laughter, used to convey amusement.",
        "source": "Universal across many cultures, often used in online chats."
    },
    {
        "meme": "干得漂亮",
        "example_sentence": "干得漂亮，真艺术哇",
        "meaning": "Used to commend someone for a job well done, often with a sense of admiration.",
        "source": "Commonly used in various online discussions."
    },
    {
        "meme": "牛逼牛逼牛逼",
        "example_sentence": "牛逼牛逼牛逼，真是佩服",
        "meaning": "An expression of admiration or respect, often repeated for emphasis.",
        "source": "Common in youth slang and internet culture."
    }
]