[
    {
        "meme": "飞飞飞飞飞",
        "example_sentence": "一看到这个消息，我的心情就飞飞飞飞飞！",
        "meaning": "Expresses extreme excitement or enthusiasm, often used in a playful or exaggerated manner.",
        "source": "Common usage in online communities, particularly among younger audiences."
    },
    {
        "meme": "666666666666666666",
        "example_sentence": "这个视频太好笑了，666666666666666666！",
        "meaning": "Indicates admiration or approval, often used to praise something impressive or entertaining.",
        "source": "Widespread use in Chinese online platforms, especially in gaming and streaming contexts."
    },
    {
        "meme": "你指尖跃动的电光",
        "example_sentence": "你指尖跃动的电光，是我永生不变的信仰，唯我超电磁炮永世长存。",
        "meaning": "A poetic expression often used to convey deep admiration or emotional connection, referencing a beloved character or concept.",
        "source": "Lyrics from the anime series 'A Certain Scientific Railgun'."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，这个剧情真是太震撼了！",
        "meaning": "An exclamation of surprise or shock, often used in a humorous context.",
        "source": "Commonly used slang in Chinese internet culture."
    },
    {
        "meme": "no comment",
        "example_sentence": "看到这段视频，我只能说：no comment。",
        "meaning": "Used to express that something is so ridiculous or absurd that it doesn't warrant a response.",
        "source": "Adopted from English internet slang, widely used in various contexts."
    },
    {
        "meme": "太牛了",
        "example_sentence": "你竟然能做到这一点，太牛了！",
        "meaning": "Used to express admiration for someone's skills or achievements.",
        "source": "Popular phrase in Chinese culture, often used in informal conversations."
    },
    {
        "meme": "救命，我都能想象这一套这么全的漫画会出现在货架上",
        "example_sentence": "看到这个设定，救命，我都能想象这一套这么全的漫画会出现在货架上。",
        "meaning": "Expresses a humorous disbelief or exaggeration about an idea or concept.",
        "source": "Common expression in discussions about anime or manga."
    },
    {
        "meme": "再来n遍",
        "example_sentence": "这首歌我听了再来n遍！",
        "meaning": "Indicates a desire to experience something repeatedly, often used for songs or videos.",
        "source": "Common phrase in online streaming culture."
    },
    {
        "meme": "咳咳",
        "example_sentence": "咳咳，大家注意一下，这里有个重要的消息。",
        "meaning": "Used to draw attention, often implying that something important or awkward is about to be said.",
        "source": "Commonly used in both online and offline conversations."
    },
    {
        "meme": "这不一样吗？",
        "example_sentence": "这不一样吗？你说的和我看到的完全不同。",
        "meaning": "Used to express confusion or disagreement about a statement or situation.",
        "source": "Common phrase in discussions, often used humorously."
    },
    {
        "meme": "哈哈哈，救命啊！",
        "example_sentence": "看到这个视频，我忍不住哈哈哈，救命啊！",
        "meaning": "Expresses laughter in response to something funny or absurd.",
        "source": "Common expression in online chats and comments."
    },
    {
        "meme": "光 头 头 套",
        "example_sentence": "这个设计真是光 头 头 套，太有创意了！",
        "meaning": "Used to describe something that is overly simplistic or lacking depth, often in a humorous context.",
        "source": "Internet slang that plays with the structure of phrases."
    },
    {
        "meme": "这段伏笔太牛逼了",
        "example_sentence": "这段伏笔太牛逼了，让我想起了以前的经典。",
        "meaning": "Expresses admiration for a clever plot twist or foreshadowing in storytelling.",
        "source": "Common in discussions about movies, shows, or books."
    }
]