[
    {
        "meme": "前方高能！！！！！！",
        "example_sentence": "前方高能！！！！！！这段视频真的太精彩了！",
        "meaning": "Used to alert viewers that something exciting or shocking is about to happen.",
        "source": "Commonly used in online streaming platforms to hype up content."
    },
    {
        "meme": "哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩",
        "example_sentence": "我在看这个视频时，弹幕上全是：哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩！",
        "meaning": "Used to emphasize excitement or enthusiasm for Bilibili, often in a humorous or exaggerated manner.",
        "source": "Derived from the platform's name and used as a playful chant."
    },
    {
        "meme": "恋爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱",
        "example_sentence": "看到这对情侣，我只想说：恋爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱！",
        "meaning": "Expresses an overwhelming feeling of love or affection, often in a humorous or exaggerated manner.",
        "source": "Popularized through social media and romantic content."
    },
    {
        "meme": "牛吧牛啊",
        "example_sentence": "这位选手的表现真是牛吧牛啊！",
        "meaning": "A playful way to express admiration or approval, often in a light-hearted context.",
        "source": "Commonly used in online gaming and competitive environments."
    },
    {
        "meme": "我不知道，我没见过",
        "example_sentence": "当被问到某个热门话题时，我只能回答：我不知道，我没见过。",
        "meaning": "Used humorously to express ignorance or confusion about a topic.",
        "source": "A common phrase in meme culture highlighting a lack of knowledge."
    },
    {
        "meme": "深思熟虑一个月以后，做了一个违背祖宗的决定",
        "example_sentence": "经过深思熟虑一个月以后，我还是决定买这个游戏，真是违背祖宗的决定。",
        "meaning": "Used sarcastically to describe a decision that seems foolish or regrettable.",
        "source": "Reflects a humorous take on decision-making in gaming or consumer culture."
    },
    {
        "meme": "哈哈哈哈哈哈哈哈",
        "example_sentence": "这个视频太搞笑了，哈哈哈哈哈哈哈哈！",
        "meaning": "Expresses uncontrollable laughter, often used to react to something funny.",
        "source": "A universal expression of laughter in online communication."
    },
    {
        "meme": "我家是福建这边的渔民",
        "example_sentence": "我家是福建这边的渔民，真是太有文化了。",
        "meaning": "A humorous way to highlight a cultural or regional identity.",
        "source": "Often used in discussions about local culture and identity."
    },
    {
        "meme": "OMG！好绝望啊",
        "example_sentence": "看到这个新闻，我只能说：OMG！好绝望啊！",
        "meaning": "Expresses a feeling of despair or shock, often in response to bad news.",
        "source": "Common in online reactions to negative events."
    },
    {
        "meme": "好可爱哈哈哈哈哈哈哈哈",
        "example_sentence": "这只小狗真是好可爱哈哈哈哈哈哈哈哈！",
        "meaning": "Used to express affection and amusement towards something cute.",
        "source": "A common expression on social media when reacting to adorable content."
    },
    {
        "meme": "可售可租！！！厉害了",
        "example_sentence": "这个新游戏居然可售可租！！！厉害了！",
        "meaning": "Indicates surprise or admiration for a new feature or offering.",
        "source": "Reflects excitement in gaming or product releases."
    }
]