[
    {
        "meme": "我的天",
        "example_sentence": "我的天，我赌的257！！！！！！！！！！！",
        "meaning": "An expression of shock or disbelief, often used humorously in exaggerated situations.",
        "source": "Commonly used in various online contexts, especially in reaction to surprising events."
    },
    {
        "meme": "咕咕咕",
        "example_sentence": "咕咕咕",
        "meaning": "A sound often used to indicate confusion or to express a sense of being overwhelmed.",
        "source": "Originates from the sound of a chicken, used in a playful or humorous context."
    },
    {
        "meme": "哈哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈哈哈哈哈我的天",
        "meaning": "An expression of laughter, often used to convey amusement or joy.",
        "source": "Common in internet culture as a way to express laughter in text form."
    },
    {
        "meme": "一键三连",
        "example_sentence": "我突然知道这视频为什么要付费了，一键三连！",
        "meaning": "A call to action for viewers to like, comment, and subscribe, often used in content creation contexts.",
        "source": "Popularized by content creators on platforms like Bilibili and YouTube."
    },
    {
        "meme": "666",
        "example_sentence": "太厉害了！666",
        "meaning": "A way to express admiration or approval, akin to saying 'awesome' or 'cool.'",
        "source": "Originates from gaming culture, used to praise impressive feats."
    },
    {
        "meme": "我操了",
        "example_sentence": "我操了，吓我一跳，我以为说摄像师了",
        "meaning": "An expression of surprise or shock, often used when something unexpected happens.",
        "source": "Common in informal speech and online discussions."
    },
    {
        "meme": "飞",
        "example_sentence": "我要起飞啦！",
        "meaning": "Used to indicate excitement or eagerness to leave or start something new.",
        "source": "Often used in a humorous context to express enthusiasm."
    },
    {
        "meme": "太传奇了",
        "example_sentence": "太传奇了！",
        "meaning": "An expression of awe or admiration for something remarkable or impressive.",
        "source": "Commonly used in discussions about extraordinary events or achievements."
    },
    {
        "meme": "我去-_-||",
        "example_sentence": "我去-_-||，这真是太搞笑了。",
        "meaning": "An expression of disbelief or exasperation, often used in response to something absurd.",
        "source": "Common in online forums and social media."
    },
    {
        "meme": "为了死去的妹妹们！",
        "example_sentence": "为了死去的妹妹们！为了死去的妹妹们！",
        "meaning": "A dramatic or humorous call to action, often used in a mocking or exaggerated tone.",
        "source": "Derived from emotional or dramatic contexts, often parodied in memes."
    },
    {
        "meme": "干嘛笑啊",
        "example_sentence": "干嘛笑啊，事情很严重！",
        "meaning": "A rhetorical question used to highlight the seriousness of a situation, often humorously.",
        "source": "Common in humorous exchanges where the gravity of a situation is contrasted with laughter."
    },
    {
        "meme": "我就是五年后的2024",
        "example_sentence": "我就是五年后的2024。",
        "meaning": "A playful assertion of being ahead of time or having foresight.",
        "source": "Used humorously to comment on future predictions or events."
    },
    {
        "meme": "你指尖跃动的电光",
        "example_sentence": "你指尖跃动的电光，是我此生不变的信仰。",
        "meaning": "A poetic expression often used to convey deep admiration or passion.",
        "source": "Originates from anime culture, specifically referencing strong emotional connections."
    },
    {
        "meme": "前方高能预警",
        "example_sentence": "前方高能预警，非战斗人员请撤离！",
        "meaning": "A humorous alert indicating that something exciting or shocking is about to happen.",
        "source": "Common in online communities to prepare viewers for intense moments."
    }
]