[
    {
        "meme": "嘤嘤嘤",
        "example_sentence": "然后表白三月月嘤嘤嘤",
        "meaning": "Expresses a sense of cuteness or a playful, childlike demeanor, often used in a teasing or affectionate context.",
        "source": "Commonly used in online communities to convey a cute or whiny tone."
    },
    {
        "meme": "无语了",
        "example_sentence": "老铁们，无语了啊，看到这真的无语了",
        "meaning": "Used to express frustration or disbelief at a situation, often implying that words cannot adequately convey the speaker's feelings.",
        "source": "Common phrase in Chinese internet slang."
    },
    {
        "meme": "爆杀",
        "example_sentence": "好爆杀的填词",
        "meaning": "Used to describe something that is extremely impressive or overwhelming, often in a humorous context.",
        "source": "Derived from gaming or anime culture."
    },
    {
        "meme": "压力好大啊",
        "example_sentence": "压力好大啊",
        "meaning": "A common expression of feeling overwhelmed or stressed, often used humorously to exaggerate minor inconveniences.",
        "source": "Common phrase in everyday conversation."
    },
    {
        "meme": "这真的是付费了才能看的节目",
        "example_sentence": "这真的是付费了才能看的节目",
        "meaning": "Used to imply that something is of high quality or value, often sarcastically suggesting that it should be free.",
        "source": "Commentary on subscription-based content platforms."
    },
    {
        "meme": "你指尖跃动的电光",
        "example_sentence": "你指尖跃动的电光，是我此生不变的信仰",
        "meaning": "A poetic expression used to convey deep admiration or devotion, often associated with fandom culture.",
        "source": "References to anime or gaming fandoms."
    },
    {
        "meme": "太牛了吧",
        "example_sentence": "太牛了吧！！！！！",
        "meaning": "Used to express amazement or admiration, often with an exaggerated tone.",
        "source": "Commonly used in various online discussions."
    },
    {
        "meme": "爱爱爱爱爱",
        "example_sentence": "爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱",
        "meaning": "Repetition of 'love' to emphasize affection or excitement, often used humorously.",
        "source": "A playful way to express overwhelming feelings."
    },
    {
        "meme": "666",
        "example_sentence": "666，14个双下巴",
        "meaning": "A slang term used to express admiration or approval, similar to 'awesome' or 'cool'.",
        "source": "Originates from gaming culture."
    },
    {
        "meme": "小傲想睡觉",
        "example_sentence": "他俩赌小潮和小萌谁赢（bushi）",
        "meaning": "Used humorously to refer to someone being overly dramatic or lazy, often in a teasing manner.",
        "source": "Derived from playful banter in online communities."
    },
    {
        "meme": "用头撞桌子",
        "example_sentence": "用头撞桌子*7",
        "meaning": "An exaggerated expression of frustration or disbelief, often humorously indicating a desire to react dramatically.",
        "source": "Commonly used in meme culture."
    },
    {
        "meme": "前方高能预警",
        "example_sentence": "前方高能预警",
        "meaning": "A warning that something exciting or shocking is about to happen, often used before a dramatic reveal.",
        "source": "Common in video content and online discussions."
    },
    {
        "meme": "我好像不是来看视频的，是来看弹幕的",
        "example_sentence": "我好像不是来看视频的，是来看弹幕的",
        "meaning": "A humorous acknowledgment that the comments (danmaku) are often more entertaining than the actual content.",
        "source": "Reflects the culture of interactive viewing on platforms like Bilibili."
    },
    {
        "meme": "救命鸡皮疙瘩起来了",
        "example_sentence": "太牛了吧！！！！！救命鸡皮疙瘩起来了",
        "meaning": "Used to express intense excitement or thrill, often when something impressive is witnessed.",
        "source": "Commonly used in reaction to shocking or impressive content."
    }
]