[
    {
        "meme": "你指尖跃动的电光，是我此生不变的信仰，唯我超电磁炮永世长存",
        "example_sentence": "你指尖跃动的电光，是我此生不变的信仰，唯我超电磁炮永世长存。",
        "meaning": "A declaration of unwavering belief or loyalty, often associated with fandom culture.",
        "source": "Phrase from the anime 'A Certain Scientific Railgun' (Toaru Kagaku no Railgun)"
    },
    {
        "meme": "666",
        "example_sentence": "666这是个桂",
        "meaning": "A way to express approval or admiration, often used to indicate something is impressive or cool.",
        "source": "Online gaming slang, particularly in Chinese internet culture."
    },
    {
        "meme": "一针见血",
        "example_sentence": "一针见血",
        "meaning": "Used to describe a statement that is direct and to the point, often highlighting a truth.",
        "source": "Chinese idiom meaning to hit the nail on the head."
    },
    {
        "meme": "再溜最后一遍！",
        "example_sentence": "再溜最后一遍！",
        "meaning": "A phrase indicating a final review or attempt, often used humorously.",
        "source": "Commonly used in online gaming or streaming contexts."
    },
    {
        "meme": "前方高能！！",
        "example_sentence": "前方高能！！！！",
        "meaning": "A warning that something exciting or intense is about to happen.",
        "source": "Commonly used in online videos or streams to hype up upcoming content."
    },
    {
        "meme": "啊对对对 说什么我都开摆",
        "example_sentence": "啊对对对 说什么我都开摆",
        "meaning": "An expression of agreement or affirmation, often used in a light-hearted context.",
        "source": "Internet slang reflecting a casual attitude."
    },
    {
        "meme": "助攻一下",
        "example_sentence": "助攻一下",
        "meaning": "To assist someone in achieving something, often used in gaming or collaborative contexts.",
        "source": "Derived from sports terminology, commonly used in online gaming."
    },
    {
        "meme": "X_X",
        "example_sentence": "X_X",
        "meaning": "An emoticon expressing extreme disappointment or frustration.",
        "source": "Common emoticon usage in online chats."
    },
    {
        "meme": "……害",
        "example_sentence": "……害",
        "meaning": "A trailing off that implies resignation or defeat, often used humorously.",
        "source": "Online conversational style reflecting emotional exhaustion."
    },
    {
        "meme": "好！太好！太好！",
        "example_sentence": "好！太好！太好！",
        "meaning": "An emphatic expression of excitement or approval.",
        "source": "Commonly used in enthusiastic responses."
    },
    {
        "meme": "我和番茄同一天生日诶",
        "example_sentence": "我和番茄同一天生日诶",
        "meaning": "A playful way to connect with others over shared experiences or interests.",
        "source": "Common in fandoms where fans relate personal details to their favorite characters."
    },
    {
        "meme": "这剧情我看过！",
        "example_sentence": "这剧情我看过！",
        "meaning": "A humorous way to indicate familiarity with a storyline, often used in discussions about media.",
        "source": "Commonly used in commentary on movies, shows, or games."
    },
    {
        "meme": "我差点信了，直到我看见了胜利队哈哈哈",
        "example_sentence": "我差点信了，直到我看见了胜利队哈哈哈",
        "meaning": "Expressing skepticism or disbelief, often humorously.",
        "source": "Common in discussions where people express doubt about a situation."
    },
    {
        "meme": "哇哦！五星级小潮",
        "example_sentence": "哇哦！五星级小潮",
        "meaning": "An expression of surprise or admiration, often used in a playful context.",
        "source": "Commonly used in reviews or comments about quality."
    },
    {
        "meme": "不应该是自由吗？",
        "example_sentence": "不应该是自由吗？",
        "meaning": "A rhetorical question implying a critique of restrictions or norms.",
        "source": "Commonly used in discussions about freedom or choice."
    },
    {
        "meme": "这声nononono果然是美国荒诞的写照",
        "example_sentence": "这声nononono果然是美国荒诞的写照",
        "meaning": "Used to sarcastically comment on absurd situations, particularly in a political context.",
        "source": "Derived from humorous commentary on current events."
    },
    {
        "meme": "我怀孕了，怎么办啊",
        "example_sentence": "我怀孕了，怎么办啊",
        "meaning": "Used humorously to express being overwhelmed or in a difficult situation.",
        "source": "Commonly used in memes and online discussions."
    },
    {
        "meme": "我靠虚实结合",
        "example_sentence": "我靠虚实结合",
        "meaning": "An expression of surprise or admiration for something that blends reality and fantasy well.",
        "source": "Commonly used in discussions about media or technology."
    }
]