[
    {
        "meme": "666",
        "example_sentence": "这真是太好看了，666666666666666！",
        "meaning": "An expression of excitement or approval, often used to indicate something impressive or cool.",
        "source": "Chinese internet slang, often used in live streaming and gaming contexts."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，这音色调的神了！",
        "meaning": "An exclamation of surprise or shock, similar to 'OMG' or 'Wow'.",
        "source": "Commonly used in Chinese online communities for expressing strong emotions."
    },
    {
        "meme": "爱爱爱",
        "example_sentence": "爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱！",
        "meaning": "A playful or exaggerated expression of love or affection, often used humorously.",
        "source": "Common in Chinese social media, often used to mock or emphasize affection."
    },
    {
        "meme": "po;ilu,/",
        "example_sentence": "\"po;ilu,/\" 这是什么鬼？",
        "meaning": "A nonsensical string often used to imitate typing errors or to express confusion.",
        "source": "Commonly seen in online comments to convey a sense of absurdity."
    },
    {
        "meme": "心中尺，道德尺，法律尺并不一定相同",
        "example_sentence": "心中尺，道德尺，法律尺并不一定相同，这句话说得好。",
        "meaning": "A reflection on the subjective nature of morality and legality, suggesting that personal beliefs can differ from societal norms.",
        "source": "A philosophical meme often discussed in online debates."
    },
    {
        "meme": "太熟悉了这面",
        "example_sentence": "太熟悉了这面，我每次都能认出来！",
        "meaning": "Used to express recognition or familiarity, often in a humorous or sarcastic context.",
        "source": "Commonly used in reaction to repetitive or expected content."
    },
    {
        "meme": "一汤一饭的恩惠",
        "example_sentence": "别去啊！“一汤一饭的恩惠”不能乱吃的啊。",
        "meaning": "A phrase emphasizing the importance of valuing simple kindness or hospitality.",
        "source": "A cultural reference that highlights traditional values."
    },
    {
        "meme": "hhhhh",
        "example_sentence": "哈哈哈哈哈hhhhh，真是太搞笑了！",
        "meaning": "An expression of laughter or amusement, similar to 'LOL'.",
        "source": "Commonly used in online chats and comments to convey laughter."
    },
    {
        "meme": "一人正在观看）看来诸位已破阵",
        "example_sentence": "一人正在观看）看来诸位已破阵，真是有趣。",
        "meaning": "A playful way to indicate that someone is watching or has figured something out.",
        "source": "Often used in gaming or streaming contexts to create a sense of community."
    },
    {
        "meme": "这就是钢铁侠本人吧？",
        "example_sentence": "看到这个角色，我想说：这就是钢铁侠本人吧？",
        "meaning": "Used to humorously compare someone or something to an iconic character, in this case, Iron Man.",
        "source": "Pop culture references commonly used in discussions about movies or characters."
    },
    {
        "meme": "我靠",
        "example_sentence": "我靠，这个剧情太震撼了！",
        "meaning": "An expression of surprise or shock, similar to 'no way' or 'are you serious?'.",
        "source": "Widely used in Chinese internet slang for expressing disbelief."
    },
    {
        "meme": "抽抽抽",
        "example_sentence": "抽抽抽抽抽抽抽抽抽抽抽抽抽抽抽！",
        "meaning": "A repetitive expression indicating excitement or anticipation, often used humorously.",
        "source": "Common in gaming and online communities to build hype."
    },
    {
        "meme": "心中有数",
        "example_sentence": "我心中有数，知道该怎么做。",
        "meaning": "To indicate having a clear understanding or plan, often used to express confidence.",
        "source": "Commonly used in discussions where someone feels prepared or knowledgeable."
    },
    {
        "meme": "这玩意去哪都是少数啊",
        "example_sentence": "这玩意去哪都是少数啊，真是稀奇。",
        "meaning": "Used to express that something is rare or unusual, often in a humorous context.",
        "source": "Commonly used to comment on unique experiences or items."
    },
    {
        "meme": "我去！！！",
        "example_sentence": "我去！！！这也太好笑了吧！",
        "meaning": "An exclamation used to express surprise or disbelief, similar to 'I can't believe it!'.",
        "source": "Common in online comments to convey strong reactions."
    }
]