[
    {
        "meme": "买买买",
        "example_sentence": "木屋买买买～～～",
        "meaning": "An enthusiastic expression indicating a desire to buy things, often used humorously to exaggerate consumer behavior.",
        "source": "Commonly used in Chinese social media to express excitement about shopping."
    },
    {
        "meme": "心凌爱你",
        "example_sentence": "心凌爱你心凌爱你心凌爱你心凌爱你心凌爱你心凌爱你心凌爱你心凌爱你心凌爱你心凌爱你心凌爱你",
        "meaning": "A repetitive phrase expressing deep affection, often used in a playful or obsessive manner.",
        "source": "Popularized by fans of certain idols or characters in Chinese pop culture."
    },
    {
        "meme": "三连",
        "example_sentence": "三连、三连，记得三连！！！",
        "meaning": "Refers to the action of liking, subscribing, and sharing a video or post, often urged in a humorous or exaggerated tone.",
        "source": "Common in content creation communities, especially on platforms like Bilibili."
    },
    {
        "meme": "哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈",
        "meaning": "An exaggerated form of laughter used to convey amusement, often to an absurd degree.",
        "source": "Commonly used in online chats and comments to express laughter."
    },
    {
        "meme": "这嘴巴子！性感喏～",
        "example_sentence": "这嘴巴子！性感喏～",
        "meaning": "A playful or humorous way to compliment someone’s appearance, often used in a flirty context.",
        "source": "Common in online interactions where playful banter is prevalent."
    },
    {
        "meme": "我去！",
        "example_sentence": "我去！",
        "meaning": "An expression of surprise or shock, often used when something unexpected happens.",
        "source": "A common expression in Chinese internet slang."
    },
    {
        "meme": "666",
        "example_sentence": "套路太深了。6666666",
        "meaning": "A term used to express admiration or approval, similar to saying 'awesome' or 'cool'.",
        "source": "Originates from gaming culture, where '666' is used to praise skillful play."
    },
    {
        "meme": "考古",
        "example_sentence": "考古考古！",
        "meaning": "Refers to the act of digging through old content or comments, often used humorously to indicate nostalgia or discovery.",
        "source": "Common in online communities when revisiting older posts or videos."
    },
    {
        "meme": "飞飞飞",
        "example_sentence": "飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞",
        "meaning": "An expression of excitement or enthusiasm, often used in a playful or exaggerated manner.",
        "source": "Commonly used in playful contexts on social media."
    },
    {
        "meme": "老哥",
        "example_sentence": "哈哈哈，老哥太搞笑了",
        "meaning": "A friendly term used to refer to a male friend or acquaintance, often used in a humorous or light-hearted context.",
        "source": "Common in Chinese online communities."
    },
    {
        "meme": "时间消暂停",
        "example_sentence": "时间消暂停yyds",
        "meaning": "A playful expression implying that time has stopped, often used to emphasize a moment of enjoyment.",
        "source": "Popularized in meme culture, especially in humorous contexts."
    },
    {
        "meme": "真到2024了",
        "example_sentence": "真到2024了",
        "meaning": "A statement expressing disbelief or surprise at the passage of time, often used humorously.",
        "source": "Common in discussions reflecting on time and changes in the current year."
    }
]