[
    {
        "meme": "6666666666666666",
        "example_sentence": "这段视频太好笑了，6666666666666666！",
        "meaning": "A way to express excitement or admiration, often used in response to something impressive or funny.",
        "source": "Commonly used on Chinese social media platforms like Bilibili."
    },
    {
        "meme": "草",
        "example_sentence": "这件事情真是草，我都不知道该怎么反应了。",
        "meaning": "Used to express disbelief or humor, similar to 'LOL' in English.",
        "source": "Originates from online gaming and social media slang in China."
    },
    {
        "meme": "我靠",
        "example_sentence": "我靠，这个剧情反转也太厉害了！",
        "meaning": "An exclamation of surprise or shock, similar to 'Wow' or 'Oh my god'.",
        "source": "Commonly used in everyday conversation and online comments."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，这个特效做得太棒了！",
        "meaning": "An expression of astonishment, often used when something unexpected happens.",
        "source": "Widespread in Chinese internet slang."
    },
    {
        "meme": "不就是",
        "example_sentence": "不就是一场比赛吗，至于这么激动吗？",
        "meaning": "Used to downplay a situation or reaction, suggesting that it is not as significant as others make it out to be.",
        "source": "Commonly used in casual conversations."
    },
    {
        "meme": "这谁看了不懵逼啊",
        "example_sentence": "这部电影的结局太复杂，真是这谁看了不懵逼啊。",
        "meaning": "Used to express confusion or bewilderment about something that is hard to understand.",
        "source": "A phrase popularized in various online discussions."
    },
    {
        "meme": "你说的像牛爷爷啊",
        "example_sentence": "他刚才的发言，你说的像牛爷爷啊，根本不靠谱。",
        "meaning": "Used to mock someone for making an absurd or nonsensical statement.",
        "source": "Originates from humorous online memes."
    },
    {
        "meme": "咕咕咕",
        "example_sentence": "又要加班了，咕咕咕。",
        "meaning": "Used to express resignation or acceptance of an unpleasant situation, often humorously.",
        "source": "Commonly used among young people in online chats."
    },
    {
        "meme": "我也是",
        "example_sentence": "看到这个我也想哭，真是感同身受，我也是。",
        "meaning": "Used to express empathy or shared feelings with someone else's experience.",
        "source": "Frequently used in social media comments."
    },
    {
        "meme": "飞飞飞飞飞飞飞",
        "example_sentence": "这场比赛真精彩，飞飞飞飞飞飞飞！",
        "meaning": "An exaggerated way to express excitement or enthusiasm, often used in a playful manner.",
        "source": "Common in online gaming and streaming culture."
    },
    {
        "meme": "好好好好好好",
        "example_sentence": "这次活动真不错，大家都好好好好好好！",
        "meaning": "Repetition used to emphasize agreement or excitement, similar to 'yes, yes, yes'.",
        "source": "A stylistic choice often seen in comments to convey enthusiasm."
    }
]