[
    {
        "meme": "真的完了啊",
        "example_sentence": "看到这个视频，我只能说：'真的完了啊！'",
        "meaning": "Used to express a feeling of finality or despair, often in a humorous context.",
        "source": "Common phrase used in various online discussions to convey disbelief or resignation."
    },
    {
        "meme": "哈哈哈哈哈哈哈哈哈哈",
        "example_sentence": "这段真的太搞笑了，'哈哈哈哈哈哈哈哈哈哈'。",
        "meaning": "An exaggerated expression of laughter, often used to convey extreme amusement.",
        "source": "Commonly used in online chats and comments to emphasize humor."
    },
    {
        "meme": "小潮我是做生意的，但我就赚一点点一点点一点点",
        "example_sentence": "小潮说：'我就赚一点点一点点一点点'，让人哭笑不得。",
        "meaning": "A humorous way of downplaying one's earnings or gains, often implying that they are much more substantial.",
        "source": "Derived from a popular meme format on social media."
    },
    {
        "meme": "我勒个NCPD执法啊",
        "example_sentence": "看到这个情况，我心里想：'我勒个NCPD执法啊'。",
        "meaning": "An expression of shock or disbelief, often used when something unexpected happens.",
        "source": "References to law enforcement or authority figures in a humorous context."
    },
    {
        "meme": "给食贫道充电",
        "example_sentence": "这次活动真不错，'给食贫道充电'，大家都很开心。",
        "meaning": "A playful way of saying to support or help someone, often used in a humorous context.",
        "source": "A phrase that has gained traction in online communities."
    },
    {
        "meme": "这集我好像看过（doge",
        "example_sentence": "这集我好像看过（doge），真是经典。",
        "meaning": "Used to express a sense of familiarity or recognition, often with a hint of irony.",
        "source": "The 'doge' meme, representing a Shiba Inu, is widely used in online culture."
    },
    {
        "meme": "你指尖跃动的电光，是我此生不灭的信仰",
        "example_sentence": "这句歌词真是太感人了：'你指尖跃动的电光，是我此生不灭的信仰'。",
        "meaning": "A poetic expression of deep admiration or devotion, often used in fan communities.",
        "source": "From a popular anime or song, often quoted by fans."
    },
    {
        "meme": "我不进去，别往前走了",
        "example_sentence": "当我看到那条黑暗的小巷时，我心里想：'我不进去，别往前走了'。",
        "meaning": "A humorous way to express caution or reluctance in a risky situation.",
        "source": "Commonly used in online discussions, often in a joking manner."
    },
    {
        "meme": "23333",
        "example_sentence": "这个笑话真好笑，'23333'。",
        "meaning": "An expression of laughter or amusement, often used to indicate that something is very funny.",
        "source": "Originates from online chat culture, specifically from the Chinese internet."
    },
    {
        "meme": "这句话我怎么感觉这么熟悉",
        "example_sentence": "听到这句话，我不禁想：'这句话我怎么感觉这么熟悉'。",
        "meaning": "Used to express a sense of déjà vu or recognition, often in a humorous context.",
        "source": "Commonly used in memes and online discussions."
    },
    {
        "meme": "我勒个雷呀",
        "example_sentence": "看到这个消息，我真是'我勒个雷呀'。",
        "meaning": "An expression of surprise or shock, often used in a light-hearted manner.",
        "source": "A colloquial phrase used in various online contexts."
    }
]