[
    {
        "meme": "哈哈哈哈哈哈哈哈哈哈",
        "example_sentence": "看到这个视频我忍不住笑了，哈哈哈哈哈哈哈哈哈哈。",
        "meaning": "An exaggerated expression of laughter, often used to indicate something is very funny.",
        "source": "Common online expression in Chinese social media."
    },
    {
        "meme": "这就是不正常的啊",
        "example_sentence": "他居然这样做，真的是不正常的啊。",
        "meaning": "Used to highlight a behavior or situation that deviates from the norm, often with a tone of disbelief.",
        "source": "Common phrase used in various contexts on social media."
    },
    {
        "meme": "我也来试试",
        "example_sentence": "看到大家都在做这个挑战，我也来试试。",
        "meaning": "A phrase indicating someone wants to join in on a trend or challenge.",
        "source": "Popularized through various online challenges."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，这个剧情太反转了！",
        "meaning": "An expression of surprise or shock, often used in a humorous or exaggerated context.",
        "source": "A common slang term in Chinese online communities."
    },
    {
        "meme": "给饼叔充电喽！",
        "example_sentence": "看完这个视频，我感觉我又能给饼叔充电喽！",
        "meaning": "Used to express support or encouragement for someone, often in a humorous way.",
        "source": "Refers to a popular character or person known as 饼叔 (Bing Shu)."
    },
    {
        "meme": "这段封神",
        "example_sentence": "这段音乐真的是封神了，太好听了！",
        "meaning": "Used to describe something that is exceptionally good or iconic.",
        "source": "Commonly used in the context of music or performances."
    },
    {
        "meme": "哈哈黑道老龄化",
        "example_sentence": "现在的黑道都老龄化了，哈哈黑道老龄化。",
        "meaning": "A humorous observation about the aging of a certain group, implying a shift in culture or demographics.",
        "source": "A humorous commentary on societal changes."
    },
    {
        "meme": "努力活着",
        "example_sentence": "生活不易，但我们还是要努力活着。",
        "meaning": "A motivational phrase indicating resilience in the face of adversity.",
        "source": "Commonly used in various motivational contexts."
    },
    {
        "meme": "一地的零食哈哈哈",
        "example_sentence": "看完这个视频，感觉自己吃了一地的零食哈哈哈。",
        "meaning": "Used to describe a situation where someone is overwhelmed, often humorously, by snacks or food.",
        "source": "A humorous expression often used during food-related discussions."
    },
    {
        "meme": "我靠",
        "example_sentence": "我靠，这个真是太神奇了！",
        "meaning": "An expression of surprise or disbelief, similar to 'wow' or 'no way'.",
        "source": "Common slang used in Chinese online conversations."
    },
    {
        "meme": "撩头发*2",
        "example_sentence": "她在镜头前撩头发*2，真是太可爱了。",
        "meaning": "A playful expression indicating someone is being flirty or cute, often used in a light-hearted context.",
        "source": "Commonly used in discussions about attractive behavior."
    },
    {
        "meme": "这也能连接上",
        "example_sentence": "我没想到这个设备居然能连接上，真是太神奇了。",
        "meaning": "Used to express surprise at unexpected connections or compatibility.",
        "source": "Commonly used in tech discussions."
    },
    {
        "meme": "这不抽象吧",
        "example_sentence": "这个艺术作品真的是，这不抽象吧？",
        "meaning": "Used to question the clarity or comprehensibility of something that seems overly abstract.",
        "source": "Commonly used in discussions about art and interpretation."
    },
    {
        "meme": "这段原声唢呐封神！",
        "example_sentence": "听到这段原声唢呐，我觉得封神了！",
        "meaning": "Used to describe a piece of music or sound that is considered iconic or exceptional.",
        "source": "Often used in the context of traditional music or performances."
    },
    {
        "meme": "我会永远守护着你！",
        "example_sentence": "在我心中，你会永远守护着我！",
        "meaning": "A phrase expressing loyalty and protection, often used in affectionate contexts.",
        "source": "Commonly used in romantic or caring exchanges."
    }
]