[
    {
        "meme": "PDD老师保佑我",
        "example_sentence": "PDD老师保佑我期末考试翻盘！成败在此一举！",
        "meaning": "A humorous expression of hope for good luck or a favorable outcome, often referencing the popular streamer PDD.",
        "source": "PDD (Penguin D) is a well-known Chinese streamer and gamer."
    },
    {
        "meme": "一寸山河一寸血",
        "example_sentence": "因为中国的领土一寸也不能丢！一寸山河一寸血。",
        "meaning": "A phrase emphasizing the importance of territorial integrity and the sacrifices made for it.",
        "source": "This phrase is a historical reference to the sacrifices made for the country."
    },
    {
        "meme": "反转了",
        "example_sentence": "反转了，真的很感动，为他们致敬。",
        "meaning": "Used to indicate a surprising or unexpected twist in a story or situation.",
        "source": "Commonly used in storytelling and media critique."
    },
    {
        "meme": "顶针",
        "example_sentence": "顶针，这哥哥烟儿真频啊~",
        "meaning": "Refers to a situation where someone is being overly repetitive or is just echoing what others say.",
        "source": "A term used in online discussions to describe echoing behavior."
    },
    {
        "meme": "爽！！！！！！！！",
        "example_sentence": "爽！！！！！！！！",
        "meaning": "An exaggerated expression of excitement or satisfaction.",
        "source": "Commonly used in various online contexts to express extreme pleasure."
    },
    {
        "meme": "哈哈哈",
        "example_sentence": "哈哈哈，成都这边情趣酒店也有教室的嘛",
        "meaning": "A common laughter expression used to convey amusement.",
        "source": "Widely used in online chats and social media."
    },
    {
        "meme": "这不会是黑豹党的后裔吧",
        "example_sentence": "这不会是黑豹党的后裔吧。",
        "meaning": "A sarcastic remark questioning someone's lineage or background in a humorous way.",
        "source": "Refers to the Black Panther Party, often used in a humorous or ironic context."
    },
    {
        "meme": "我想找个女朋友",
        "example_sentence": "我想找个女朋友。",
        "meaning": "A straightforward expression of desire for a romantic partner, often used humorously.",
        "source": "Commonly expressed in memes about dating and relationships."
    },
    {
        "meme": "好人啊",
        "example_sentence": "好人啊，看到那下降率太高拉。",
        "meaning": "Used sarcastically to refer to someone who is perceived as overly naive or foolish.",
        "source": "Commonly used in online discussions to mock someone's naivety."
    },
    {
        "meme": "不容易啊",
        "example_sentence": "不容易啊，2023年4月，没有视频，看来泛哥哥的巨人之力不太好用啊。",
        "meaning": "Expresses a sense of empathy or understanding towards someone's struggles.",
        "source": "Often used to acknowledge the challenges faced by others."
    },
    {
        "meme": "这可比切尔诺贝利离谱多了",
        "example_sentence": "这可比切尔诺贝利离谱多了。",
        "meaning": "A hyperbolic expression used to describe a situation as being absurd or outrageous.",
        "source": "References to the Chernobyl disaster to emphasize extreme situations."
    },
    {
        "meme": "我TM直接裂开",
        "example_sentence": "我TM直接裂开，看到那下降率太高拉。",
        "meaning": "A dramatic expression of shock or disbelief.",
        "source": "Commonly used in online gaming and discussions to express extreme reactions."
    },
    {
        "meme": "这就是赌博吧",
        "example_sentence": "这就是赌博吧，真的是升华了。",
        "meaning": "Used to describe a risky situation or decision-making process, often in a humorous context.",
        "source": "Commonly used in discussions about gambling or high-stakes decisions."
    },
    {
        "meme": "我错了，我不该在吃饭的时候看",
        "example_sentence": "我错了，我不该在吃饭的时候看这个视频。",
        "meaning": "A humorous admission of regret for watching something inappropriate while eating.",
        "source": "A common sentiment shared in funny video reactions."
    },
    {
        "meme": "体验卡快用光了",
        "example_sentence": "体验卡快用光了，然后把体验卡给别人。",
        "meaning": "Refers to a sense of urgency or pressure to use something before it expires.",
        "source": "Commonly used in discussions about limited-time offers or experiences."
    },
    {
        "meme": "这要是被端了直接收获大把人头",
        "example_sentence": "这要是被端了直接收获大把人头。",
        "meaning": "A hyperbolic expression indicating that a significant consequence will follow an action.",
        "source": "Often used in gaming or competitive contexts."
    },
    {
        "meme": "我脸红了",
        "example_sentence": "妈呀，我脸红了。",
        "meaning": "Used to express embarrassment or shyness, often in a humorous way.",
        "source": "Commonly used in social interactions and online chats."
    },
    {
        "meme": "我家猫爱吃面条",
        "example_sentence": "我家猫爱吃面条。",
        "meaning": "A light-hearted comment about a pet's quirky behavior.",
        "source": "Commonly shared in pet-related memes."
    },
    {
        "meme": "老哥这话有水平",
        "example_sentence": "老哥这话有水平，本身走黑命贵。",
        "meaning": "A phrase used to compliment someone for their insightful or intelligent comment.",
        "source": "Commonly used in discussions to acknowledge good points."
    },
    {
        "meme": "你指尖跃动的电光",
        "example_sentence": "你指尖跃动的电光，是我此生不变的信仰！",
        "meaning": "A poetic expression often used in fandoms to convey deep admiration.",
        "source": "References to anime culture and fandom expressions."
    },
    {
        "meme": "我想找个女朋友",
        "example_sentence": "我想找个女朋友，求推荐。",
        "meaning": "A straightforward expression of desire for a romantic partner, often used humorously.",
        "source": "Commonly expressed in memes about dating and relationships."
    },
    {
        "meme": "五年后回来的",
        "example_sentence": "五年后回来的：压根没买5G手机。",
        "meaning": "Used to humorously indicate a reflection on past decisions or missed opportunities.",
        "source": "Commonly used in time-travel or retrospective memes."
    }
]