[
    {
        "meme": "哈哈哈哈",
        "example_sentence": "这么多人！？哈哈哈哈",
        "meaning": "An expression of laughter, often used to convey amusement or disbelief.",
        "source": "Commonly used in Chinese internet culture, similar to 'LOL' in English."
    },
    {
        "meme": "doge",
        "example_sentence": "女儿到叛逆期了（doge）",
        "meaning": "Used to denote a humorous or sarcastic tone, often associated with the Shiba Inu meme.",
        "source": "Originates from the 'Doge' meme featuring a Shiba Inu dog."
    },
    {
        "meme": "非战斗人员请迅速撤离",
        "example_sentence": "侦测到核能打击，非战斗人员请迅速撤离。",
        "meaning": "A serious phrase used humorously to exaggerate the urgency of a situation.",
        "source": "Parody of military or emergency communication."
    },
    {
        "meme": "我艹你的哥们儿",
        "example_sentence": "我艹你的哥们儿这话给我逗笑逗晕了。",
        "meaning": "A colloquial expression of surprise or amusement, often used in a humorous context.",
        "source": "Common slang in Chinese internet culture."
    },
    {
        "meme": "666",
        "example_sentence": "太牛逼，666。",
        "meaning": "Used to express approval or admiration, similar to 'awesome' or 'cool'.",
        "source": "Commonly used in Chinese online gaming and streaming communities."
    },
    {
        "meme": "我去，这都能赖上，啥脏水都往上泼",
        "example_sentence": "我去，这都能赖上，啥脏水都往上泼。",
        "meaning": "Used to express disbelief at someone being blamed for something unreasonable.",
        "source": "A common phrase in online discussions when criticizing unreasonable accusations."
    },
    {
        "meme": "我从一开始就觉得是这样，不能接受也接受",
        "example_sentence": "我从一开始就觉得是这样，不能接受也接受。",
        "meaning": "A phrase that captures the feeling of resignation to an unacceptable situation.",
        "source": "Common expression reflecting a sense of acceptance in disappointment."
    },
    {
        "meme": "我就是为了这个片段充电的",
        "example_sentence": "我就是为了这个片段充电的。",
        "meaning": "Indicates that someone is excited or motivated by a specific part of a show or video.",
        "source": "Commonly used in fan discussions about favorite moments in media."
    },
    {
        "meme": "这不得看十几本意林才能补回来",
        "example_sentence": "这不得看十几本意林才能补回来。",
        "meaning": "Implying that a lot of knowledge or background is needed to understand a topic.",
        "source": "Reference to the difficulty of understanding complex themes without extensive reading."
    },
    {
        "meme": "高龄化，高龄化，高龄化",
        "example_sentence": "高龄化，高龄化，高龄化。",
        "meaning": "Repetition used for emphasis, often to highlight a pressing social issue.",
        "source": "Common rhetorical device in discussions about demographic changes."
    },
    {
        "meme": "我飞起来了我",
        "example_sentence": "我飞起来了我。",
        "meaning": "An exaggerated expression of excitement or surprise.",
        "source": "Used in various contexts to humorously convey a feeling of elation."
    },
    {
        "meme": "这播放量是全站第一吗？",
        "example_sentence": "这播放量是全站第一吗？",
        "meaning": "Used to express disbelief or surprise at a video's popularity.",
        "source": "Common in reactions to viral content."
    },
    {
        "meme": "一口气看到这里 感谢饼叔团队",
        "example_sentence": "一口气看到这里 感谢饼叔团队。",
        "meaning": "Expressing gratitude towards content creators for engaging material.",
        "source": "Common in fan comments on platforms like Bilibili."
    },
    {
        "meme": "我才发现叔的衣服",
        "example_sentence": "我才发现叔的衣服。",
        "meaning": "Used to express a sudden realization or recognition of something.",
        "source": "Often used in humorous contexts when noticing details."
    },
    {
        "meme": "这是能说的吗？？",
        "example_sentence": "这是能说的吗？？",
        "meaning": "Used to question the appropriateness of a statement or action.",
        "source": "Common rhetorical question in discussions about sensitive topics."
    },
    {
        "meme": "这可真是太棒了！",
        "example_sentence": "这可真是太棒了！",
        "meaning": "A phrase expressing strong enthusiasm or approval.",
        "source": "Commonly used in positive reactions to content."
    },
    {
        "meme": "这不得看十几本意林才能补回来",
        "example_sentence": "这不得看十几本意林才能补回来。",
        "meaning": "Indicates the need for extensive knowledge to understand a topic.",
        "source": "Common humorous expression in discussions about complex subjects."
    },
    {
        "meme": "笑面虎",
        "example_sentence": "他看起来很友好，但其实是个笑面虎。",
        "meaning": "Refers to someone who appears friendly but is actually deceitful.",
        "source": "A common idiom in Chinese culture."
    }
]