[
    {
        "meme": "FBI还是CIA哦",
        "example_sentence": "FBI还是CIA哦，谁能告诉我这是什么情况？",
        "meaning": "Used humorously to express confusion or curiosity about a situation, often implying that it feels secretive or suspicious.",
        "source": "Common internet slang, possibly derived from memes involving secret agencies."
    },
    {
        "meme": "奥利奥利安！！！！！！！！！！！！！！！！！！！！！！！",
        "example_sentence": "看到这个视频我只想说，奥利奥利安！！！！！！！！！！！！！！！！！！！！！！！",
        "meaning": "An exaggerated expression of excitement or enthusiasm, often used to emphasize a strong reaction.",
        "source": "Popularized through social media and streaming platforms."
    },
    {
        "meme": "无懈可击",
        "example_sentence": "他的表演真是无懈可击，完美！",
        "meaning": "Used to describe something that is flawless or impeccable.",
        "source": "Traditional Chinese phrase, frequently used in modern contexts."
    },
    {
        "meme": "你指尖跃动的闪光，是我此生不变的信仰",
        "example_sentence": "她的舞蹈真美，‘你指尖跃动的闪光，是我此生不变的信仰’。",
        "meaning": "A poetic expression used to convey deep admiration or love for someone's talent or beauty.",
        "source": "Derived from lyrical content in songs or poetry."
    },
    {
        "meme": "二倍笑死我了",
        "example_sentence": "这个梗太好笑了，二倍笑死我了！",
        "meaning": "Used to express that something is extremely funny, often to the point of being overwhelming.",
        "source": "Commonly used in online comment sections and memes."
    },
    {
        "meme": "哈哈哈哈哈哈哈哈哈",
        "example_sentence": "看完这个视频我忍不住发了十个哈哈哈哈哈哈哈哈哈。",
        "meaning": "An exaggerated way to express laughter, indicating something is very funny.",
        "source": "Widespread use in online chats and comment sections."
    },
    {
        "meme": "这叫浅？这叫晃？",
        "example_sentence": "这个问题的答案居然这么简单，‘这叫浅？这叫晃？’",
        "meaning": "Used to express disbelief or mockery regarding the simplicity of something that is expected to be complex.",
        "source": "Common in humorous contexts online."
    },
    {
        "meme": "注意看 高子正在偷偷摸摸拿走马哥的零食（Doge）",
        "example_sentence": "注意看，高子正在偷偷摸摸拿走马哥的零食（Doge），真是搞笑。",
        "meaning": "A humorous way to point out sneaky or mischievous behavior, often used with a sense of irony.",
        "source": "Doge meme format, popular on social media."
    },
    {
        "meme": "我来了。。",
        "example_sentence": "听说有新剧，我来了。。",
        "meaning": "A way to announce one's presence or eagerness to engage with something new.",
        "source": "Commonly used in online discussions to express enthusiasm."
    },
    {
        "meme": "666掺冰了",
        "example_sentence": "这个表演真不错，666掺冰了！",
        "meaning": "Used to express admiration or approval, often in a playful manner.",
        "source": "Internet slang that has evolved from gaming and streaming communities."
    },
    {
        "meme": "给我的感觉就是虽然热闹，但也就这么几个人，完全谈不上什么氛围",
        "example_sentence": "这个聚会给我的感觉就是虽然热闹，但也就这么几个人，完全谈不上什么氛围。",
        "meaning": "A sarcastic comment on a situation that appears lively but feels shallow or lacking substance.",
        "source": "Commonly used in social commentary."
    }
]