[
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，这么多钱",
        "meaning": "An expression of surprise or shock, often used in a humorous context.",
        "source": "Commonly used in online conversations in China."
    },
    {
        "meme": "666",
        "example_sentence": "666666666666666666666",
        "meaning": "A way to express admiration or approval, similar to saying 'awesome' or 'cool'.",
        "source": "Originated from gaming communities, often used in live streams."
    },
    {
        "meme": "飞飞飞",
        "example_sentence": "飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞",
        "meaning": "Used to express excitement or a sense of urgency, often in a playful manner.",
        "source": "Commonly seen in danmaku comments during exciting moments in streams."
    },
    {
        "meme": "爱爱爱",
        "example_sentence": "爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱",
        "meaning": "An expression of love or affection, often exaggerated for comedic effect.",
        "source": "Popular in fandom communities and among younger audiences."
    },
    {
        "meme": "好可爱",
        "example_sentence": "好可爱真的",
        "meaning": "A phrase expressing admiration for cuteness, often used in response to adorable content.",
        "source": "Commonly used in comments for cute videos or images."
    },
    {
        "meme": "这才是最后的武士",
        "example_sentence": "这才是最后的武士",
        "meaning": "Refers to someone who embodies the spirit of a true warrior or hero, often used sarcastically.",
        "source": "Derived from popular media references."
    },
    {
        "meme": "牛逼",
        "example_sentence": "牛逼啊 兄弟",
        "meaning": "A term used to express admiration or to compliment someone, similar to 'awesome' or 'impressive'.",
        "source": "Widespread in Chinese internet slang."
    },
    {
        "meme": "空耳",
        "example_sentence": "因为空耳像莉格露",
        "meaning": "Refers to mishearing lyrics or phrases in a humorous way.",
        "source": "Originates from internet culture where fans joke about misheard lyrics."
    },
    {
        "meme": "老哥",
        "example_sentence": "老哥直言不讳难绷",
        "meaning": "A casual term for 'bro' or 'dude', often used to address someone informally.",
        "source": "Common slang in online communities."
    },
    {
        "meme": "真是瞎搞",
        "example_sentence": "真是瞎搞",
        "meaning": "Used to express disbelief or frustration at something that seems ridiculous or nonsensical.",
        "source": "Commonly used in reactions to absurd situations."
    },
    {
        "meme": "这集不是坦克300",
        "example_sentence": "这集不是坦克300",
        "meaning": "A humorous way to point out that something is not what it seems or is being misrepresented.",
        "source": "A reference to popular culture or specific media."
    }
]