[
    {
        "meme": "草啊！",
        "example_sentence": "草啊！所以没有任何人给艾伦灌输仇恨洗脑，那艾伦这没有理智的沙碧仇恨哪来的啊草！",
        "meaning": "An expression of surprise or disbelief, often used to emphasize frustration or absurdity.",
        "source": "Common internet slang in Chinese online communities."
    },
    {
        "meme": "好抽象哈哈哈",
        "example_sentence": "好抽象哈哈哈",
        "meaning": "Used to express amusement at something that is overly complex or nonsensical.",
        "source": "Commonly used in discussions about art or abstract concepts."
    },
    {
        "meme": "你别说，他模仿得很有感觉",
        "example_sentence": "你别说，他模仿得很有感觉",
        "meaning": "A humorous way to acknowledge someone's impressive imitation or mimicry.",
        "source": "Often used in reaction to performances or impressions."
    },
    {
        "meme": "爱爱爱爱爱爱爱爱爱",
        "example_sentence": "爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱",
        "meaning": "An exaggerated expression of love or affection, often used humorously.",
        "source": "A playful repetition commonly seen in online comments."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，想吃！！",
        "meaning": "An exclamation of surprise, shock, or excitement, often used in informal contexts.",
        "source": "A popular slang term in Chinese internet culture."
    },
    {
        "meme": "全体起立！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！",
        "example_sentence": "全体起立！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！",
        "meaning": "A dramatic call for attention or respect, often used in a humorous or exaggerated context.",
        "source": "Commonly used in comments to emphasize a point or to mock seriousness."
    },
    {
        "meme": "我嘞个蛇喰梦子",
        "example_sentence": "我嘞个蛇喰梦子",
        "meaning": "An expression of surprise or disbelief, often used humorously.",
        "source": "Derived from a character in popular anime, used in a humorous context."
    },
    {
        "meme": "打卡打卡",
        "example_sentence": "打卡打卡",
        "meaning": "To check in or confirm presence, often used in social media contexts.",
        "source": "Commonly used in online platforms to indicate participation or attendance."
    },
    {
        "meme": "这可不是演戏啊",
        "example_sentence": "这可不是演戏啊",
        "meaning": "Used to emphasize the seriousness of a situation, often in a humorous context.",
        "source": "A phrase that has become popular in various online discussions."
    },
    {
        "meme": "笑死我了哈哈哈哈哈哈哈",
        "example_sentence": "笑死我了哈哈哈哈哈哈哈",
        "meaning": "An expression of extreme amusement, often used to react to something funny.",
        "source": "A common way to indicate laughter in online comments."
    },
    {
        "meme": "这是锅炉师傅把火开大了电棍被烧似了吗",
        "example_sentence": "这是锅炉师傅把火开大了电棍被烧似了吗",
        "meaning": "A humorous remark suggesting something is excessively intense or out of control.",
        "source": "A creative metaphor used in online discussions."
    }
]