[
    {
        "meme": "牛牛勇敢不怕！",
        "example_sentence": "牛牛勇敢不怕！牛牛勇敢不怕！牛牛勇敢不怕！",
        "meaning": "A phrase expressing encouragement and bravery, often used in a repetitive manner for emphasis.",
        "source": "Commonly used in various online communities to boost morale."
    },
    {
        "meme": "666",
        "example_sentence": "太牛逼了666",
        "meaning": "Used to express admiration or approval, similar to saying 'awesome' or 'cool'.",
        "source": "Originates from gaming culture in China, where '6' signifies something impressive."
    },
    {
        "meme": "哈哈哈哈",
        "example_sentence": "哈哈，哈哈哈",
        "meaning": "Used to convey laughter or amusement, often in response to something funny.",
        "source": "Commonly used in Chinese online communication."
    },
    {
        "meme": "OK，现在一切正常。",
        "example_sentence": "OK，现在一切正常。",
        "meaning": "Used to signify that a situation has stabilized or returned to normal.",
        "source": "Often used in various contexts, including tech and daily life."
    },
    {
        "meme": "一模一样",
        "example_sentence": "一模一样",
        "meaning": "Used to indicate that two things are exactly the same.",
        "source": "A common phrase in Chinese, often used in humorous contexts."
    },
    {
        "meme": "哈哈哈哈哈 格局大了",
        "example_sentence": "哈哈哈哈哈 格局大了",
        "meaning": "Used to indicate that someone's perspective or ambition has expanded significantly.",
        "source": "Commonly used in discussions about personal growth or aspirations."
    },
    {
        "meme": "我也喜欢她",
        "example_sentence": "我也喜欢她",
        "meaning": "A simple expression of shared affection or admiration for someone.",
        "source": "A common phrase in social interactions."
    },
    {
        "meme": "手动（醒个danm）",
        "example_sentence": "手动（醒个danm）",
        "meaning": "Refers to manually waking up or becoming aware of something, often used humorously.",
        "source": "Derived from the context of online discussions."
    },
    {
        "meme": "高龄化✪高龄化✪",
        "example_sentence": "高龄化✪高龄化✪高龄化✪",
        "meaning": "Used to humorously emphasize the aging phenomenon, often in a repetitive manner.",
        "source": "Commonly found in online discussions about demographics."
    },
    {
        "meme": "噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢！",
        "example_sentence": "噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢噢！你！噢噢噢噢么么！！你的",
        "meaning": "An exaggerated expression of excitement or surprise, often used in a playful context.",
        "source": "Common in online chats to convey strong emotions."
    },
    {
        "meme": "我靠真速通啊",
        "example_sentence": "我靠真速通啊",
        "meaning": "Expresses astonishment at the speed or efficiency of something.",
        "source": "Often used in gaming or competitive contexts."
    },
    {
        "meme": "这就是科技片照进现实吧",
        "example_sentence": "wc 这就是科技片照进现实吧",
        "meaning": "Used to describe a situation where technology has become a reality, often with a hint of irony.",
        "source": "Commonly used in discussions about technological advancements."
    },
    {
        "meme": "不背图的后果",
        "example_sentence": "不是，过分了哦，打人不打脸，骂人不揭短。。",
        "meaning": "Refers to the consequences of not following the rules or expectations, often used in a humorous context.",
        "source": "Originates from gaming and competitive scenarios."
    },
    {
        "meme": "这不是个死局吗！！！！",
        "example_sentence": "这不是个死局吗！！！！",
        "meaning": "Used to express frustration or disbelief at a seemingly impossible situation.",
        "source": "Commonly used in strategic discussions."
    },
    {
        "meme": "哈哈哈哈哈中国boy预告了",
        "example_sentence": "哈哈哈哈哈中国boy预告了",
        "meaning": "Used humorously to highlight a prediction or foretelling that has come true.",
        "source": "Often used in social commentary."
    },
    {
        "meme": "我也在想收音好棒 怎么处理的",
        "example_sentence": "我也在想收音好棒 怎么处理的",
        "meaning": "Expresses curiosity about how something was achieved, often related to quality.",
        "source": "Common in discussions about media production."
    }
]