[
    {
        "meme": "卧槽",
        "example_sentence": "卧槽！！！！！！起鸡皮疙瘩了！",
        "meaning": "An expression of surprise or shock, often used to emphasize a strong reaction.",
        "source": "Commonly used in Chinese online communities as an exclamatory phrase."
    },
    {
        "meme": "哈哈哈哈",
        "example_sentence": "哈哈哈哈，我一个男的都佩服。",
        "meaning": "Used to indicate laughter or amusement, often in a light-hearted context.",
        "source": "Widely used in online chats and social media."
    },
    {
        "meme": "爱爱爱爱爱",
        "example_sentence": "爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱。",
        "meaning": "Expresses overwhelming affection or excitement, often in a playful or exaggerated manner.",
        "source": "Common in fandoms and among younger audiences."
    },
    {
        "meme": "打卡",
        "example_sentence": "高考完之后终于可以来充电啦！打卡2024！！！！！！！",
        "meaning": "Refers to checking in or marking attendance, often used in the context of participating in events or activities.",
        "source": "Originates from workplace culture, adapted to online contexts."
    },
    {
        "meme": "我靠",
        "example_sentence": "我靠！！！！！！！救命。",
        "meaning": "An exclamation expressing disbelief or astonishment.",
        "source": "Commonly used in Chinese internet slang."
    },
    {
        "meme": "牛逼",
        "example_sentence": "哈哈，牛逼。",
        "meaning": "A slang term used to praise something impressive or outstanding.",
        "source": "Popular in Chinese youth culture."
    },
    {
        "meme": "太酷了吧！",
        "example_sentence": "太酷了吧！这段小提琴就值得俩币。",
        "meaning": "Used to express admiration or astonishment at something impressive.",
        "source": "Commonly heard in casual conversations and online comments."
    },
    {
        "meme": "细节蒙德",
        "example_sentence": "细节蒙德，真的是很有意思。",
        "meaning": "Refers to a specific detail that adds depth or interest, often used in discussions about quality or craftsmanship.",
        "source": "Derived from the context of gaming and anime discussions."
    },
    {
        "meme": "注意外卖小哥",
        "example_sentence": "注意外卖小哥，别让他等太久。",
        "meaning": "A humorous reminder to be considerate to delivery personnel.",
        "source": "Commonly used in the context of ordering food online."
    },
    {
        "meme": "2024！！！！！！！",
        "example_sentence": "2024！！！！！！！我来了！",
        "meaning": "An enthusiastic expression about the upcoming year, often used to signify anticipation or excitement.",
        "source": "Often used in countdowns or discussions about future events."
    },
    {
        "meme": "我才看出是龙泽罗拉",
        "example_sentence": "我才看出是龙泽罗拉，真是太搞笑了。",
        "meaning": "A humorous realization or recognition of something unexpected.",
        "source": "Refers to a specific meme or cultural reference that may vary."
    },
    {
        "meme": "一阵无害的微风罢了",
        "example_sentence": "这不过是一阵无害的微风罢了。",
        "meaning": "Used to downplay a situation, suggesting it is not as serious as it seems.",
        "source": "Often used in sarcastic contexts."
    },
    {
        "meme": "狗头",
        "example_sentence": "这位同学真是狗头。",
        "meaning": "Used to refer to someone acting foolishly or humorously, often in a light-hearted context.",
        "source": "Common in gaming and online communities."
    },
    {
        "meme": "注意洗澡不停大飞机",
        "example_sentence": "注意洗澡不停大飞机，别忘了。",
        "meaning": "A humorous warning or reminder, often used in a playful context.",
        "source": "A playful phrase common in online banter."
    },
    {
        "meme": "我在雅思口语中回想模板现场",
        "example_sentence": "我在雅思口语中回想模板现场，真是绝了。",
        "meaning": "Refers to recalling prepared answers or templates during an exam, often used humorously.",
        "source": "Common among students preparing for language exams."
    }
]