[
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，这一真还挺帅。",
        "meaning": "An exclamation of surprise or admiration, often used in a humorous or exaggerated context.",
        "source": "Common online slang in Chinese-speaking communities."
    },
    {
        "meme": "狗e",
        "example_sentence": "“听着，所谓谋权篡位，就是要在众多员工中隐藏自己”（doge",
        "meaning": "Used to signify a humorous or sarcastic tone, often associated with the Doge meme.",
        "source": "Originates from the Doge meme featuring Shiba Inu dogs."
    },
    {
        "meme": "666",
        "example_sentence": "666这个开挂了。",
        "meaning": "A way to express admiration or approval, akin to saying 'awesome' or 'cool'.",
        "source": "Commonly used in gaming and online communities in China."
    },
    {
        "meme": "好好好",
        "example_sentence": "好好好好好好好好好好好好好好好好好好好。",
        "meaning": "Used to emphasize agreement or excitement, often in a playful manner.",
        "source": "Common repetition pattern in online comments for emphasis."
    },
    {
        "meme": "噗",
        "example_sentence": "噗，真的是太搞笑了。",
        "meaning": "An expression of laughter or amusement, similar to 'lol'.",
        "source": "Commonly used in online chats and comments."
    },
    {
        "meme": "这老哥",
        "example_sentence": "这老哥顶级黑人做题家啊。",
        "meaning": "Refers to someone in a humorous or informal manner, often implying that they are impressive or noteworthy.",
        "source": "Slang used in online discussions to refer to someone casually."
    },
    {
        "meme": "教练我想跳极乐净土",
        "example_sentence": "教练我想跳极乐净土！！！",
        "meaning": "A humorous expression indicating a desire to escape or change a situation, referencing a popular song.",
        "source": "From the song '极乐净土' by the Vocaloid character Kizuna AI."
    },
    {
        "meme": "真香",
        "example_sentence": "这段视频真香。",
        "meaning": "Used to express that something is unexpectedly good, often after initial skepticism.",
        "source": "Popularized by online culture, often used in ironic contexts."
    },
    {
        "meme": "我丢",
        "example_sentence": "我丢，这一真还挺帅。",
        "meaning": "An expression of surprise or disbelief, similar to 'oh my god'.",
        "source": "Common in online slang among younger audiences."
    },
    {
        "meme": "一面之辞",
        "example_sentence": "一面之辞，大家不能尽信啊。",
        "meaning": "Refers to a one-sided statement or opinion, cautioning against taking it at face value.",
        "source": "Common phrase in discussions to encourage critical thinking."
    },
    {
        "meme": "超电磁炮",
        "example_sentence": "你指尖跃动的电光，是我此生不变的信仰，唯我超电磁炮永世长存~~~",
        "meaning": "Refers to a popular anime series 'A Certain Scientific Railgun', used to express strong fandom.",
        "source": "From the anime 'A Certain Scientific Railgun'."
    },
    {
        "meme": "流泪",
        "example_sentence": "2023年了节目还没实现（流泪）",
        "meaning": "Used to express sadness or disappointment, often in a humorous or exaggerated way.",
        "source": "Commonly used in online comments to convey emotional reactions."
    },
    {
        "meme": "高斯",
        "example_sentence": "高斯是精神病医生。",
        "meaning": "Refers to a character or concept associated with intelligence or complexity, often humorously.",
        "source": "References to complex characters in popular culture."
    },
    {
        "meme": "不care",
        "example_sentence": "不care你，你就不能幸福生活了。",
        "meaning": "Indicates indifference or lack of concern about someone else's opinion or situation.",
        "source": "Commonly used in casual online conversations."
    },
    {
        "meme": "牛逼",
        "example_sentence": "这真牛逼！",
        "meaning": "An expression of admiration or respect, similar to saying 'awesome' or 'amazing'.",
        "source": "Common slang in Chinese-speaking communities."
    },
    {
        "meme": "这不是",
        "example_sentence": "这不是我想要的。",
        "meaning": "Used to express disappointment or disagreement with a situation.",
        "source": "Common phrase in discussions to convey dissatisfaction."
    },
    {
        "meme": "我听到",
        "example_sentence": "我听到「强运」的回响。",
        "meaning": "An expression indicating recognition or acknowledgment of something significant.",
        "source": "Used in various contexts to express awareness."
    },
    {
        "meme": "太高级了",
        "example_sentence": "太高级了，这个剪辑。",
        "meaning": "An expression of admiration for something that is perceived as sophisticated or impressive.",
        "source": "Commonly used in discussions about media and art."
    },
    {
        "meme": "灵魂拷问",
        "example_sentence": "这就是灵魂拷问。",
        "meaning": "Refers to a deep or challenging question that provokes thought.",
        "source": "Commonly used in discussions to highlight difficult topics."
    }
]