[
    {
        "meme": "我勒个豆",
        "example_sentence": "我勒个豆，抗日英雄啊这是。",
        "meaning": "An expression of surprise or disbelief, often used humorously.",
        "source": "A common expression in online Chinese slang."
    },
    {
        "meme": "666",
        "example_sentence": "666直接破防。",
        "meaning": "A way to express admiration or approval, similar to saying 'awesome' or 'cool'.",
        "source": "Popularized in gaming and online communities, often used to praise skill or performance."
    },
    {
        "meme": "卧槽！",
        "example_sentence": "卧槽！同志！",
        "meaning": "An exclamation of shock or astonishment, often used informally.",
        "source": "A common expression in Chinese internet slang."
    },
    {
        "meme": "正 片 开 始",
        "example_sentence": "正   片   开   始。",
        "meaning": "Used to signal the official start of something, often with emphasis through spacing.",
        "source": "Commonly used in video streaming contexts to indicate the beginning of the main content."
    },
    {
        "meme": "加一万？",
        "example_sentence": "加一万？",
        "meaning": "A humorous way to exaggerate a point or request, often implying that something should be increased significantly.",
        "source": "A phrase used in discussions or debates to emphasize agreement or support."
    },
    {
        "meme": "拖延立大功！",
        "example_sentence": "拖延立大功！",
        "meaning": "Used ironically to highlight the futility of procrastination, suggesting that it somehow leads to success.",
        "source": "A humorous take on procrastination culture."
    },
    {
        "meme": "我觉得北京也是",
        "example_sentence": "我觉得北京也是。",
        "meaning": "A phrase indicating agreement or shared sentiment, often used sarcastically.",
        "source": "Commonly used in discussions to reflect a shared opinion."
    },
    {
        "meme": "啊啊啊啊啊",
        "example_sentence": "啊啊啊啊啊马哥好萌啊啊啊啊啊啊啊啊。",
        "meaning": "An expression of excitement or enthusiasm, often used to convey strong emotions.",
        "source": "A common exclamation in online chats and comments."
    },
    {
        "meme": "你可以打碟啊",
        "example_sentence": "你可以打碟啊。",
        "meaning": "A playful or sarcastic suggestion that someone has the ability to do something impressive.",
        "source": "Often used in a humorous context to tease someone."
    },
    {
        "meme": "我心中的同志只有这个颜色",
        "example_sentence": "我心中的同志只有这个颜色。",
        "meaning": "A phrase used to express strong loyalty or preference, often related to cultural or political identity.",
        "source": "Reflects sentiments in discussions about identity and belonging."
    },
    {
        "meme": "这才是艺术，是人民的艺术",
        "example_sentence": "这才是艺术，是人民的艺术。",
        "meaning": "A declaration of appreciation for art that reflects the people's experiences and emotions.",
        "source": "Often used in discussions about cultural representation and authenticity."
    }
]