[
    {
        "meme": "你指尖跃动的电光是我此生不变的信仰，唯我超电磁炮永世长存！",
        "example_sentence": "你指尖跃动的电光是我此生不变的信仰，唯我超电磁炮永世长存！",
        "meaning": "Expresses a deep admiration or unwavering belief in something, often used humorously or dramatically.",
        "source": "From the anime 'A Certain Scientific Railgun' (Toaru Kagaku no Railgun)"
    },
    {
        "meme": "666",
        "example_sentence": "666666666",
        "meaning": "Used to express admiration or approval, similar to 'awesome' or 'cool'.",
        "source": "Common internet slang in Chinese gaming and streaming communities."
    },
    {
        "meme": "一命速通",
        "example_sentence": "《黑暗欺骗》耍傲戏 一命速通",
        "meaning": "Refers to completing a game or level in one life, often used in gaming contexts.",
        "source": "Gaming terminology."
    },
    {
        "meme": "哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈真的很难不笑",
        "meaning": "Indicates laughter or amusement, often used to emphasize humor.",
        "source": "Common online expression of laughter."
    },
    {
        "meme": "爱爱爱爱爱",
        "example_sentence": "爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱",
        "meaning": "Used to express intense affection or excitement, often in a humorous or exaggerated manner.",
        "source": "Commonly seen in fandoms and among younger audiences."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽！！！！！！！",
        "meaning": "An exclamation of surprise or shock, similar to 'OMG' or 'WTF'.",
        "source": "Common expression in Chinese internet slang."
    },
    {
        "meme": "Q",
        "example_sentence": "Q",
        "meaning": "A simple expression often used to denote cuteness or to express a lighthearted sentiment.",
        "source": "Commonly used in online chats and memes."
    },
    {
        "meme": "见识一下真正的落雷吧！！！",
        "example_sentence": "见识一下真正的落雷吧！！！见识一下真正的落雷吧！！！",
        "meaning": "Used to emphasize a powerful or shocking event, often repeated for emphasis.",
        "source": "Common usage in dramatic or comedic contexts."
    },
    {
        "meme": "太可爱了",
        "example_sentence": "啊啊啊啊啊啊啊！！太可爱了",
        "meaning": "Used to express overwhelming cuteness or affection.",
        "source": "Commonly found in fandom and social media."
    },
    {
        "meme": "你就是画外音",
        "example_sentence": "你就是画外音，你以为呢",
        "meaning": "Used to indicate that someone is speaking in a way that is not directly involved in the main action, often humorously.",
        "source": "Common in commentary and reactions."
    },
    {
        "meme": "这什么b动静啊",
        "example_sentence": "这什么b动静啊",
        "meaning": "Used to express confusion or disbelief about a situation.",
        "source": "Internet slang reflecting frustration or surprise."
    }
]