[
    {
        "meme": "立誓今生尊你为王，用我热血为你封疆",
        "example_sentence": "立誓今生尊你为王，用我热血为你封疆。立誓今生尊你为王，用我热血为你封疆。",
        "meaning": "A passionate declaration of loyalty and commitment, often used humorously or sarcastically in exaggerated contexts.",
        "source": "Adapted from various historical and fantasy narratives, commonly used in online fandoms."
    },
    {
        "meme": "海皇牛逼",
        "example_sentence": "海皇牛逼！",
        "meaning": "A phrase expressing admiration or excitement, often used to hype up a character or situation.",
        "source": "Originates from online gaming and anime culture, referring to powerful characters."
    },
    {
        "meme": "2333333333",
        "example_sentence": "2333333333，太搞笑了！",
        "meaning": "A common way to express laughter in online communities, similar to 'LOL' or 'hahaha'.",
        "source": "The number 233 is a reference to a popular Chinese internet forum, denoting laughter."
    },
    {
        "meme": "我草头皮发麻",
        "example_sentence": "听到这个我草头皮发麻！",
        "meaning": "Used to express a strong emotional reaction, often shock or excitement.",
        "source": "A colloquial expression often found in online discussions and reactions."
    },
    {
        "meme": "哇，好聪明，镀金",
        "example_sentence": "这个主意真不错，哇，好聪明，镀金！",
        "meaning": "Used to sarcastically praise someone for an obvious or simple idea.",
        "source": "Commonly used in social media to mock overhyped ideas."
    },
    {
        "meme": "这不敢苟同",
        "example_sentence": "对于这个观点，我这不敢苟同。",
        "meaning": "A formal way of expressing disagreement, often used humorously in casual contexts.",
        "source": "A phrase that has gained popularity in online debates and discussions."
    },
    {
        "meme": "好可爱！小潮院长更像小狗了",
        "example_sentence": "好可爱！小潮院长更像小狗了！",
        "meaning": "An expression of endearment or affection, often used to describe someone or something perceived as cute.",
        "source": "Common in fan communities, especially those involving playful or humorous comparisons."
    },
    {
        "meme": "你 有 红 红 大 嘴 唇",
        "example_sentence": "你 有 红 红 大 嘴 唇，真好看！",
        "meaning": "A playful compliment, often used to tease or flirt.",
        "source": "A light-hearted phrase popular in social media interactions."
    },
    {
        "meme": "鸡你太美",
        "example_sentence": "这首歌真好听，鸡你太美！",
        "meaning": "A humorous mispronunciation of a popular phrase, used to express excitement or admiration.",
        "source": "Originates from a viral song and has been widely adopted in meme culture."
    },
    {
        "meme": "哈哈哈哈哈哈哈哈",
        "example_sentence": "这段视频太搞笑了，哈哈哈哈哈哈哈哈！",
        "meaning": "A common way to express laughter, often used to convey amusement in comments.",
        "source": "A typical expression found in online interactions, mimicking real-life laughter."
    },
    {
        "meme": "我嘞个直言不讳",
        "example_sentence": "这个事情我嘞个直言不讳。",
        "meaning": "A phrase used to express blunt honesty, often in a humorous context.",
        "source": "Commonly used in casual conversations to emphasize straightforwardness."
    }
]