[
    {
        "meme": "震惊！",
        "example_sentence": "震惊！B站二哥竟然想要从内部瓦解小潮team！",
        "meaning": "Expresses shock or disbelief, often used sarcastically.",
        "source": "A common phrase in Chinese internet culture, often used in clickbait titles."
    },
    {
        "meme": "回来补票！",
        "example_sentence": "回来补票！",
        "meaning": "Used humorously to imply that one has missed something important and needs to catch up.",
        "source": "A phrase popularized in various online communities, often related to content consumption."
    },
    {
        "meme": "啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊",
        "example_sentence": "啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊",
        "meaning": "Represents overwhelming emotions, such as excitement or frustration, often used for comedic effect.",
        "source": "Commonly found in online comments and chats to exaggerate feelings."
    },
    {
        "meme": "牛逼",
        "example_sentence": "牛逼，这活给我一个月5万人民币都不干，一辈子忘不掉。",
        "meaning": "Used to express admiration or astonishment, often sarcastically.",
        "source": "A slang term widely used in Chinese internet culture."
    },
    {
        "meme": "就是猛！",
        "example_sentence": "就是猛！就是猛！就是猛！",
        "meaning": "Used to emphasize something impressive or powerful, often repeated for effect.",
        "source": "A stylistic choice in internet comments to convey excitement."
    },
    {
        "meme": "我爱你",
        "example_sentence": "爱爱爱爱爱爱爱爱爱爱爱爱爱情啊爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱",
        "meaning": "An exaggerated expression of affection, often used humorously.",
        "source": "A common meme format that emphasizes excessive love, frequently seen in comments."
    },
    {
        "meme": "哈哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈太好笑了。",
        "meaning": "Indicates laughter, often used to convey amusement or mockery.",
        "source": "A universal expression in online communication to denote humor."
    },
    {
        "meme": "不不，小日本那个更糟",
        "example_sentence": "不不，小日本那个更糟。",
        "meaning": "Used to downplay a situation by comparing it to another that is supposedly worse.",
        "source": "A commentary style seen in discussions involving cultural comparisons."
    },
    {
        "meme": "这才是中华，什么是中华，这才是",
        "example_sentence": "这才是中华，什么是中华，这才是。",
        "meaning": "Used to express pride in Chinese culture, often in a sarcastic or exaggerated manner.",
        "source": "A phrase that reflects national pride, often used in cultural discussions."
    },
    {
        "meme": "我放下了手中的瓜子",
        "example_sentence": "我放下了手中的瓜子。。。",
        "meaning": "Indicates a moment of surprise or shock, often used to show engagement in a surprising situation.",
        "source": "A humorous expression commonly used in online comments."
    },
    {
        "meme": "信美国没有人情世故的少看点乱七八糟的吧",
        "example_sentence": "信美国没有人情世故的少看点乱七八糟的吧。",
        "meaning": "Critiques a lack of understanding of cultural nuances, often used to highlight cultural differences.",
        "source": "A commentary style in discussions about cultural misunderstandings."
    },
    {
        "meme": "我天居然有人记得丘逢甲",
        "example_sentence": "我天居然有人记得丘逢甲。",
        "meaning": "Expresses surprise that someone remembers a historical figure or event, often used to highlight niche knowledge.",
        "source": "A common reaction in discussions about lesser-known historical topics."
    },
    {
        "meme": "这段太真实了",
        "example_sentence": "这段太真实了，反过来让对方道歉了。",
        "meaning": "Used to describe a situation that resonates deeply with personal experiences.",
        "source": "A phrase often used in discussions about relatable content."
    },
    {
        "meme": "我勒个去",
        "example_sentence": "我勒个去，这句话。",
        "meaning": "An expression of surprise or disbelief, similar to saying 'Oh my gosh!'",
        "source": "A colloquial expression common in Chinese internet slang."
    }
]