[
    {
        "meme": "屙♂屙",
        "example_sentence": "屙♂屙♂屙♂屙♂屙♂屙♂屙♂屙♂屙♂屙♂屙♂",
        "meaning": "A humorous expression often used to convey a sense of absurdity or to mock a situation, sometimes used in a playful or nonsensical context.",
        "source": "Originates from online culture where the character '♂' is used to add a humorous twist to the word '屙' (to defecate)."
    },
    {
        "meme": "boyboyboy",
        "example_sentence": "boyboyboyboyboyboyboyboyboyboyboyboyboyboyboyboyboyboyboy",
        "meaning": "Used to express excitement or enthusiasm, often in a playful manner, mimicking a chant or repetitive cheer.",
        "source": "Common in online communities where repetition is used for emphasis or comedic effect."
    },
    {
        "meme": "想桃子",
        "example_sentence": "想桃子                  想桃子                         想桃子",
        "meaning": "An expression of desire or craving for something, often repeated for emphasis, can also imply a humorous or exaggerated longing.",
        "source": "Popularized in various online forums and memes, often associated with playful or exaggerated expressions of desire."
    },
    {
        "meme": "哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈",
        "meaning": "Used to indicate laughter or amusement, often repeated for emphasis, conveying a strong reaction to something funny.",
        "source": "A common expression in Chinese online culture, similar to 'LOL' in English."
    },
    {
        "meme": "我愿陪银魂一生一世！",
        "example_sentence": "我愿陪银魂一生一世！我愿陪银魂一生一世！我愿陪银魂一生一世！",
        "meaning": "A declaration of loyalty or devotion to a particular media or fandom, often repeated to emphasize commitment.",
        "source": "Originates from fan culture, particularly in anime and manga communities."
    },
    {
        "meme": "666",
        "example_sentence": "一小傲树枝666",
        "meaning": "A term used to express admiration or approval, akin to saying 'awesome' or 'cool'.",
        "source": "Commonly used in Chinese online gaming and streaming communities."
    },
    {
        "meme": "这好家伙",
        "example_sentence": "这好家伙和韩国课本有一拼",
        "meaning": "Used to express surprise or admiration for someone's abilities or actions, often in a humorous context.",
        "source": "A phrase that has gained traction in online discussions and memes."
    },
    {
        "meme": "引号",
        "example_sentence": "引号",
        "meaning": "Used to indicate sarcasm or irony, often when quoting someone or something in a mocking manner.",
        "source": "Commonly used in online discussions to highlight absurdity or contradiction."
    },
    {
        "meme": "卧槽！",
        "example_sentence": "卧槽！这玩意儿太上头了！",
        "meaning": "An exclamation of surprise or shock, often used in reaction to something unexpected or overwhelming.",
        "source": "A popular expression in Chinese internet slang, similar to 'OMG' or 'WTF' in English."
    }
]