[
    {
        "meme": "666",
        "example_sentence": "666这个人是海伦，因为海伦“开了”",
        "meaning": "Used to express admiration or approval, often for impressive skills or actions.",
        "source": "Chinese internet slang, popularized in gaming and streaming communities."
    },
    {
        "meme": "哈哈哈",
        "example_sentence": "哈哈哈，我信你",
        "meaning": "Used to indicate laughter or amusement, often sarcastically.",
        "source": "Common internet slang in Chinese-speaking communities."
    },
    {
        "meme": "真nm离谱",
        "example_sentence": "真nm离谱，这个老哥是不是快疯了",
        "meaning": "Expresses disbelief or that something is absurd or outrageous.",
        "source": "Derived from the phrase '真离谱', with 'nm' being an abbreviation for a vulgar expression."
    },
    {
        "meme": "我草",
        "example_sentence": "我草这种人太典型了",
        "meaning": "An exclamation of surprise or frustration, similar to 'WTF'.",
        "source": "Commonly used in online discussions in Chinese."
    },
    {
        "meme": "注意安全",
        "example_sentence": "这里应该是“注意安全”而不是“你得帮帮我”吧",
        "meaning": "Used to highlight a misunderstanding or miscommunication, often humorously.",
        "source": "Common phrase in safety contexts, repurposed in memes."
    },
    {
        "meme": "飞飞飞",
        "example_sentence": "飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞",
        "meaning": "Used to convey excitement or a sense of urgency, often in a humorous or exaggerated manner.",
        "source": "Syntactic repetition common in online comments for emphasis."
    },
    {
        "meme": "你指尖跃动的电光",
        "example_sentence": "你指尖跃动的电光，是我此生不变的信仰，唯我超电磁炮永世生存！",
        "meaning": "A poetic expression of unwavering belief or passion, often used in fandom contexts.",
        "source": "From the anime 'A Certain Scientific Railgun', popular among fans."
    },
    {
        "meme": "求生欲很强",
        "example_sentence": "求生欲很强，听着，所谓杀手，要享受老板的待遇",
        "meaning": "Used to describe someone who is very eager to survive or avoid danger, often humorously.",
        "source": "Commonly used in discussions about survival in competitive scenarios."
    },
    {
        "meme": "这不是太会聊么",
        "example_sentence": "这不是太会聊么",
        "meaning": "Used to sarcastically acknowledge someone's ability to converse or engage in banter.",
        "source": "Common phrase in online banter."
    },
    {
        "meme": "我爱黎明",
        "example_sentence": "我爱黎明",
        "meaning": "A phrase expressing deep affection or admiration, often used in a humorous context.",
        "source": "Reference to the song 'I Love Dawn', popular in meme culture."
    },
    {
        "meme": "一看就是推拉高手",
        "example_sentence": "一看就是推拉高手",
        "meaning": "Used to describe someone skilled in flirting or romantic pursuits.",
        "source": "Common in dating and relationship discussions online."
    },
    {
        "meme": "原来这么久了",
        "example_sentence": "原来这么久了，时间真快呀",
        "meaning": "Used to express surprise at how much time has passed, often with nostalgia.",
        "source": "Common sentiment in discussions reflecting on time."
    },
    {
        "meme": "这太割裂了",
        "example_sentence": "这太割裂了，白天和晚上的差别",
        "meaning": "Used to describe a stark contrast or division between two situations or times.",
        "source": "Commonly used in discussions about societal or personal contrasts."
    }
]