[
    {
        "meme": "哈哈哈哈哈哈",
        "example_sentence": "这段简直了，哈哈哈哈哈哈。",
        "meaning": "An exaggerated expression of laughter, often used to convey amusement or disbelief.",
        "source": "Commonly used in online chat and social media, particularly in Chinese platforms."
    },
    {
        "meme": "一命速通",
        "example_sentence": "来，一命速通！",
        "meaning": "Refers to a quick or instant success, often used in gaming contexts.",
        "source": "Gaming slang, particularly in speedrunning communities."
    },
    {
        "meme": "yyds",
        "example_sentence": "这位同学才是中国的未来，yyds！",
        "meaning": "An acronym for '永远的神' (forever a god), used to express admiration or respect.",
        "source": "Originated from online gaming and fandom culture."
    },
    {
        "meme": "666",
        "example_sentence": "666耐活王。",
        "meaning": "A way to express approval or admiration, similar to saying 'awesome' or 'cool'.",
        "source": "Popularized in Chinese internet slang, often used in gaming contexts."
    },
    {
        "meme": "太心酸了",
        "example_sentence": "太心酸了，这段简直是反复观看。",
        "meaning": "Used to express a feeling of sadness or nostalgia.",
        "source": "Common in emotional contexts, especially in discussions about media."
    },
    {
        "meme": "注意左边",
        "example_sentence": "注意左边猩猩哥在“踢”切切的时候抱了一下腿。",
        "meaning": "A directive to pay attention to something specific, often used humorously.",
        "source": "Derived from observational humor in videos or streams."
    },
    {
        "meme": "你再指！！！！",
        "example_sentence": "你再指！！！！",
        "meaning": "An emphatic expression often used to indicate frustration or disbelief.",
        "source": "Commonly used in reaction videos or dramatic contexts."
    },
    {
        "meme": "哦哦哦哦",
        "example_sentence": "哦哦哦哦，这个我明白了。",
        "meaning": "An expression of realization or understanding, often used in a casual context.",
        "source": "Common in conversational Chinese, especially in online chats."
    },
    {
        "meme": "一块钱不到??",
        "example_sentence": "一块钱不到??",
        "meaning": "Used to express disbelief at a low price or cost, often sarcastically.",
        "source": "Commonly used in discussions about value or pricing."
    },
    {
        "meme": "！！！！！！！！！！",
        "example_sentence": "这太好笑了！！！！！！！！！！",
        "meaning": "Used to emphasize excitement or strong emotion, often in a humorous context.",
        "source": "Common in online comments to convey intensity."
    },
    {
        "meme": "这就尴尬了",
        "example_sentence": "这就尴尬了，没想到会这样。",
        "meaning": "Used to describe an awkward situation or moment.",
        "source": "Commonly used in social media and online discussions."
    },
    {
        "meme": "太中二了我天",
        "example_sentence": "太中二了我天，这个设定。",
        "meaning": "Used to describe something overly dramatic or juvenile, often in a humorous context.",
        "source": "Originates from anime and manga culture."
    },
    {
        "meme": "你哥们遮一下人家脸和人家船号啊",
        "example_sentence": "你哥们遮一下人家脸和人家船号啊。",
        "meaning": "A humorous way to point out someone's carelessness or oversight.",
        "source": "Derived from humorous commentary in videos."
    },
    {
        "meme": "我怎么飞了",
        "example_sentence": "我怎么飞了，突然被拉进这个话题。",
        "meaning": "Expresses confusion or surprise at an unexpected situation.",
        "source": "Commonly used in humorous or absurd contexts."
    },
    {
        "meme": "真 · 框出去啦？？？？？？？？？？？？？",
        "example_sentence": "真 · 框出去啦？？？？？？？？？？？？？",
        "meaning": "Used to express disbelief or surprise, often in a mocking tone.",
        "source": "Common in reaction videos and memes."
    },
    {
        "meme": "这就厉害了……",
        "example_sentence": "这就厉害了……真是个天才。",
        "meaning": "Used to express admiration for someone's skill or achievement.",
        "source": "Commonly used in discussions about impressive feats."
    },
    {
        "meme": "我靠哈哈哈哈哈哈啊啊啊啊啊啊啊",
        "example_sentence": "我靠哈哈哈哈哈哈啊啊啊啊啊啊啊，太搞笑了。",
        "meaning": "An exaggerated expression of laughter, often used to convey extreme amusement.",
        "source": "Common in online comments and social media."
    }
]