[
    {
        "meme": "哈哈哈哈哈哈",
        "example_sentence": "我看到这个视频的时候，忍不住笑了，哈哈哈哈哈哈。",
        "meaning": "Used to express extreme amusement or laughter.",
        "source": "Common online laughter expression in Chinese Internet culture."
    },
    {
        "meme": "大佬",
        "example_sentence": "他真是个大佬，什么事情都能做得很好。",
        "meaning": "Refers to a person who is highly skilled or influential, often used in a humorous or exaggerated context.",
        "source": "Slang derived from gaming and online communities."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，这个场面太震撼了！",
        "meaning": "An exclamation of surprise or shock, similar to 'OMG' or 'Wow'.",
        "source": "Common exclamation in Chinese Internet slang."
    },
    {
        "meme": "爱爱爱",
        "example_sentence": "我就是爱爱爱这个角色！",
        "meaning": "Used to express strong affection or enthusiasm for something.",
        "source": "A playful repetition commonly seen in online comments."
    },
    {
        "meme": "燃尽了",
        "example_sentence": "看完这部剧，我感觉自己燃尽了。",
        "meaning": "Expresses a feeling of being emotionally or physically exhausted after an intense experience.",
        "source": "Commonly used in anime and gaming contexts."
    },
    {
        "meme": "第一",
        "example_sentence": "我竟然是第一个评论的人！",
        "meaning": "Used to boast about being the first to comment on a post or video.",
        "source": "A common competition in online comment sections."
    },
    {
        "meme": "2333333",
        "example_sentence": "这个笑话让我笑到2333333。",
        "meaning": "An exaggerated form of laughter, often used to indicate extreme amusement.",
        "source": "Originates from the number '233', which is a popular expression of laughter in Chinese online culture."
    },
    {
        "meme": "你这是家里有个博物馆？",
        "example_sentence": "你买的这些玩具，真的是太多了，你这是家里有个博物馆？",
        "meaning": "Used humorously to comment on someone having an excessive collection of items.",
        "source": "A humorous rhetorical question common in online discussions."
    },
    {
        "meme": "黑羽道一说过",
        "example_sentence": "黑羽道一说过，一定要保持扑克脸。",
        "meaning": "Refers to maintaining a serious or expressionless demeanor, often used in a humorous context.",
        "source": "Reference to a character from a popular anime or game."
    },
    {
        "meme": "test",
        "example_sentence": "test",
        "meaning": "A simple placeholder comment, often used to check if commenting works.",
        "source": "Commonly used in online platforms."
    },
    {
        "meme": "我靠hhh",
        "example_sentence": "看到这个视频，我靠hhh，太搞笑了！",
        "meaning": "An expression of surprise or laughter, where 'hhh' indicates laughter.",
        "source": "A common expression in Chinese Internet culture."
    },
    {
        "meme": "让我来加一铲",
        "example_sentence": "这个话题太火了，让我来加一铲。",
        "meaning": "Used to indicate adding one's opinion or contribution to a discussion.",
        "source": "Derived from gaming terminology, implying adding to the 'pile' of comments."
    }
]