[
    {
        "meme": "香菜灭绝党",
        "example_sentence": "香菜起开！！我超雷你们香菜党！！我是香菜灭绝党！！！",
        "meaning": "A humorous or exaggerated expression of dislike for cilantro, often used to rally like-minded individuals.",
        "source": "Common internet meme among food enthusiasts and cooking communities."
    },
    {
        "meme": "天秀",
        "example_sentence": "天秀",
        "meaning": "Used to describe something that is exceptionally good or impressive, often in the context of skills or performances.",
        "source": "Originated from gaming and streaming culture, popularized in various online communities."
    },
    {
        "meme": "好好好好好好",
        "example_sentence": "好好好好好好好好好好好好好好好好好好好好好好好好好好好好好好好好好好好好好",
        "meaning": "A repetitive emphasis on agreement or excitement, often used humorously to convey overwhelming enthusiasm.",
        "source": "Common syntactic structure in online comments to express heightened emotion."
    },
    {
        "meme": "哈哈哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈哈哈哈哈哈哈哈",
        "meaning": "An expression of laughter, often used to indicate something is very funny.",
        "source": "Universal laughter expression in online communication."
    },
    {
        "meme": "我在吃饭！！！",
        "example_sentence": "我在吃饭！！！啊啊啊啊啊啊啊啊啊啊啊！！",
        "meaning": "Used humorously to express a mundane activity in a dramatic or exaggerated manner.",
        "source": "Commonly used in various online platforms to emphasize everyday situations."
    },
    {
        "meme": "不不不",
        "example_sentence": "不不不，鲁路修这个区别还是有的",
        "meaning": "A phrase used to express disagreement or correction, often in a dismissive tone.",
        "source": "A common conversational structure in debates or discussions online."
    },
    {
        "meme": "你    被    骗    了",
        "example_sentence": "你    被    骗    了",
        "meaning": "Used to indicate that someone has been deceived, often in a mocking or humorous context.",
        "source": "A popular phrase in internet culture, often associated with memes."
    },
    {
        "meme": "啊啊啊啊啊啊",
        "example_sentence": "啊啊啊啊啊啊啊啊啊啊啊啊啊啊哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈",
        "meaning": "An expression of excitement or frustration, often used to convey strong emotions.",
        "source": "Commonly used in various online platforms to emphasize emotional reactions."
    },
    {
        "meme": "这才是鬼畜",
        "example_sentence": "这才是鬼畜",
        "meaning": "Refers to a style of video or content that is absurdly humorous or chaotic, often involving heavy editing.",
        "source": "Originates from the '鬼畜' genre in Japanese video culture, popularized on Chinese platforms."
    },
    {
        "meme": "我永远喜欢咬人猫周姐颜值还是真的顶",
        "example_sentence": "我永远喜欢咬人猫周姐颜值还是真的顶",
        "meaning": "A humorous expression of admiration for someone's looks or charm, often in a playful context.",
        "source": "Derived from the culture of online fandoms and admiration for internet personalities."
    },
    {
        "meme": "别装",
        "example_sentence": "别装",
        "meaning": "A phrase used to call out someone who is pretending or being disingenuous.",
        "source": "Common in online discussions to express skepticism or disbelief."
    },
    {
        "meme": "这机位",
        "example_sentence": "这机位",
        "meaning": "Used to comment on the camera angle or filming perspective, often humorously.",
        "source": "Popular in video commentary and reaction culture."
    },
    {
        "meme": "不交税是真的多",
        "example_sentence": "不交税是真的多",
        "meaning": "A sarcastic remark about the prevalence of tax evasion or avoidance.",
        "source": "Commonly used in discussions about economics and social issues."
    }
]