[
    {
        "meme": "冲冲冲",
        "example_sentence": "在比赛前，大家都在喊：'冲冲冲！'",
        "meaning": "A call to action, encouraging someone to move forward with enthusiasm or urgency.",
        "source": "Commonly used in gaming and competitive contexts."
    },
    {
        "meme": "好好好好",
        "example_sentence": "当朋友提到一个好主意时，我立刻回复：'好好好好！'",
        "meaning": "An enthusiastic affirmation, often used to express strong agreement or excitement.",
        "source": "Popularized in various online conversations and memes."
    },
    {
        "meme": "无家可归的爷爷反而是最轻松的",
        "example_sentence": "在讨论生活压力时，有人调侃说：'无家可归的爷爷反而是最轻松的。'",
        "meaning": "A humorous or ironic statement suggesting that those without responsibilities may have less stress.",
        "source": "A common ironic expression in online discussions."
    },
    {
        "meme": "卧槽，全体起立！！！",
        "example_sentence": "看到精彩的表演，评论区瞬间被刷屏：'卧槽，全体起立！！！'",
        "meaning": "An expression of amazement or admiration, often used when something impressive happens.",
        "source": "A popular phrase in online communities, especially during live events."
    },
    {
        "meme": "我死了！！！！",
        "example_sentence": "看到搞笑视频时，评论里有人说：'我死了！！！！'",
        "meaning": "An exaggerated expression of laughter or amusement, indicating that something is extremely funny.",
        "source": "Common in reaction memes and humorous contexts."
    },
    {
        "meme": "好素质",
        "example_sentence": "在看到不礼貌的行为时，有人评论：'好素质。'",
        "meaning": "Used sarcastically to criticize someone's lack of manners or respect.",
        "source": "Frequently used in social media critiques."
    },
    {
        "meme": "再来亿次",
        "example_sentence": "当朋友想再看一次搞笑片段时，我说：'再来亿次！'",
        "meaning": "An expression of wanting to repeat an enjoyable experience indefinitely.",
        "source": "Widely used in conversations about favorite media."
    },
    {
        "meme": "666",
        "example_sentence": "看到精彩的游戏操作，评论区有人打出：'666！'",
        "meaning": "A way to express admiration or approval, akin to saying 'awesome' or 'cool'.",
        "source": "Originated from gaming culture, particularly in Chinese online communities."
    },
    {
        "meme": "真香定律",
        "example_sentence": "在讨论某个原本不喜欢的食物时，有人说：'真香定律。'",
        "meaning": "Refers to the phenomenon where someone ends up enjoying something they initially disliked.",
        "source": "A meme that became popular in various online discussions."
    },
    {
        "meme": "爱爱爱爱爱爱爱",
        "example_sentence": "在表达对某个偶像的喜爱时，评论里满是：'爱爱爱爱爱爱爱！'",
        "meaning": "An exaggerated expression of love or adoration, often used in fandom contexts.",
        "source": "Common in fan communities and social media."
    },
    {
        "meme": "加，加，加",
        "example_sentence": "在讨论如何提高效率时，有人说：'加，加，加！'",
        "meaning": "A motivational phrase urging to increase efforts or actions.",
        "source": "Used in various motivational contexts online."
    },
    {
        "meme": "阿啊啊啊啊啊啊",
        "example_sentence": "看到喜欢的角色出现时，评论区充满了：'阿啊啊啊啊啊啊！'",
        "meaning": "An expression of excitement or overwhelming feelings, often in a dramatic or exaggerated manner.",
        "source": "Common in anime and fandom discussions."
    },
    {
        "meme": "我靠",
        "example_sentence": "看到令人震惊的新闻时，有人评论：'我靠！'",
        "meaning": "An expression of surprise or disbelief, similar to 'wow' or 'no way'.",
        "source": "A frequently used exclamation in informal Chinese."
    }
]