[
    {
        "meme": "我炮还能再战五百年！！！",
        "example_sentence": "我炮还能再战五百年！！！我炮还能再战五百年！！！！",
        "meaning": "Used to express resilience and determination, often humorously exaggerating one's ability to continue despite challenges.",
        "source": "A popular phrase in Chinese online gaming and meme culture."
    },
    {
        "meme": "哈哈哈哈哈哈哈哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈哈哈哈哈哈每次当我想哭的时候小何都会让我噗嗤一声笑出来",
        "meaning": "A common expression of laughter, often used to convey amusement or sarcasm.",
        "source": "General internet slang, widely used across social media platforms."
    },
    {
        "meme": "飞飞飞飞飞飞飞飞",
        "example_sentence": "飞飞飞飞飞飞飞飞，真是太好笑了！",
        "meaning": "Repetition of the word 'fly' to emphasize excitement or absurdity, often in a humorous context.",
        "source": "Common in online gaming and social media, reflecting a playful tone."
    },
    {
        "meme": "无所谓 君子论迹不论心",
        "example_sentence": "无所谓 君子论迹不论心，你觉得她不好你先比她做的更好。",
        "meaning": "A philosophical statement suggesting that one should focus on actions rather than intentions, often used to criticize hypocrisy.",
        "source": "Derived from traditional Chinese philosophy, adapted into modern slang."
    },
    {
        "meme": "ooc了属于是",
        "example_sentence": "这段对话真是ooc了属于是。",
        "meaning": "Short for 'out of character,' used to describe behavior that is inconsistent with a person's usual character.",
        "source": "Originates from role-playing and fan communities."
    },
    {
        "meme": "就让这大风吹大风吹～",
        "example_sentence": "就让这大风吹大风吹～，我无所谓！",
        "meaning": "A carefree attitude, suggesting one is unbothered by external circumstances.",
        "source": "Commonly used in songs and social media to express a laid-back mindset."
    },
    {
        "meme": "每个组织都自己玩 挺好的。",
        "example_sentence": "每个组织都自己玩 挺好的，大家都能找到自己的节奏。",
        "meaning": "A sarcastic remark about how different groups operate independently, often used to highlight dysfunction.",
        "source": "General commentary on social dynamics, popular in discussions about teamwork."
    },
    {
        "meme": "我好像听到了仙贝？",
        "example_sentence": "我好像听到了仙贝？这是什么梗？",
        "meaning": "A humorous expression indicating confusion or surprise, often used when encountering something unexpected.",
        "source": "Originates from a viral video or meme involving a character or situation related to '仙贝'."
    },
    {
        "meme": "这是个社牛",
        "example_sentence": "这是个社牛，真的是太会聊天了。",
        "meaning": "Refers to someone who is very sociable or charismatic, often in a humorous or exaggerated manner.",
        "source": "A blend of social commentary and internet slang."
    },
    {
        "meme": "我发的我发的是我发的",
        "example_sentence": "我发的我发的是我发的，大家快来看！",
        "meaning": "A repetitive structure used to emphasize the speaker's ownership or excitement about something they posted.",
        "source": "Common in playful online interactions, reflecting a humorous tone."
    },
    {
        "meme": "这玩意不是越禁越贵。",
        "example_sentence": "这玩意不是越禁越贵，反而越开放越贵。",
        "meaning": "A commentary on how prohibitions can increase demand or value, often used in discussions about market dynamics.",
        "source": "General economic commentary adapted into internet slang."
    }
]