[
    {
        "meme": "刻不容缓",
        "example_sentence": "刻不容缓！！！",
        "meaning": "Used to express urgency or the need to act immediately.",
        "source": "Common phrase in Chinese, often used in various contexts."
    },
    {
        "meme": "哈哈哈哈",
        "example_sentence": "哈哈哈哈过分",
        "meaning": "Expresses laughter, often used to indicate something is funny or absurd.",
        "source": "Standard expression of laughter in Chinese internet culture."
    },
    {
        "meme": "666",
        "example_sentence": "兄弟们送我上去666",
        "meaning": "Used to express admiration or approval, akin to 'awesome' or 'cool'.",
        "source": "Originated from gaming culture in China, where '6' symbolizes something being smooth or excellent."
    },
    {
        "meme": "doge",
        "example_sentence": "万黑丛中一抹黄（doge）",
        "meaning": "Refers to the popular meme featuring a Shiba Inu dog, often used to convey humor or irony.",
        "source": "The Doge meme, which became popular in the early 2010s."
    },
    {
        "meme": "我没死 我赢了",
        "example_sentence": "我没死 我赢了",
        "meaning": "Used humorously to convey a sense of survival or triumph in a difficult situation.",
        "source": "Common phrase in online gaming and competitive contexts."
    },
    {
        "meme": "电  棍  和  欧  内",
        "example_sentence": "电  棍  和  欧  内",
        "meaning": "A syntactic structure that emphasizes the words through spacing, often used to create a dramatic effect.",
        "source": "This stylistic choice is common in online chats and comments."
    },
    {
        "meme": "下↓",
        "example_sentence": "下↓",
        "meaning": "Indicates a direction or action to be taken, often used to prompt viewers to look at something below.",
        "source": "Common in online comments to guide attention."
    },
    {
        "meme": "真香",
        "example_sentence": "真的是一直在叫",
        "meaning": "Used to express that something is unexpectedly good or appealing.",
        "source": "Originated from a popular meme in Chinese internet culture, often used ironically."
    },
    {
        "meme": "三   国   鼎   立",
        "example_sentence": "三   国   鼎   立",
        "meaning": "A phrase indicating a balanced situation or three entities standing equally.",
        "source": "Refers to the historical period of the Three Kingdoms in China, often used in discussions about power dynamics."
    },
    {
        "meme": "我去鸡皮疙瘩起来了",
        "example_sentence": "我去鸡皮疙瘩起来了",
        "meaning": "Expresses a strong emotional reaction, often due to excitement or fear.",
        "source": "A common expression in Chinese online discourse."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，最后一秒踩到了",
        "meaning": "An exclamation of surprise or shock, similar to 'OMG' or 'WTF'.",
        "source": "Widely used in Chinese internet slang."
    },
    {
        "meme": "一窝人 武器",
        "example_sentence": "一窝人 武器",
        "meaning": "Used to describe a chaotic or overwhelming situation, often in a humorous way.",
        "source": "Commonly used in gaming or action-related contexts."
    },
    {
        "meme": "精神药物",
        "example_sentence": "精神药物都会让人嗜睡，很痛苦的整天昏昏沉沉",
        "meaning": "Refers to the effects of mental health medications, often used in a humorous or exaggerated context.",
        "source": "Common discourse surrounding mental health in online communities."
    }
]