[
    {
        "meme": "卧槽",
        "example_sentence": "卧槽！冰",
        "meaning": "An exclamation of surprise or shock, often used in a humorous or exaggerated context.",
        "source": "Common internet slang in Chinese online communities."
    },
    {
        "meme": "我艹了你们的吗",
        "example_sentence": "哪些在字幕下面发 弹幕的 我艹了你们的吗",
        "meaning": "A frustrated or incredulous expression, often directed at others for their actions.",
        "source": "Internet slang reflecting a casual and confrontational tone."
    },
    {
        "meme": "加油加油加油",
        "example_sentence": "加油加油加油",
        "meaning": "A phrase used to cheer someone on or encourage them, often repeated for emphasis.",
        "source": "Common motivational phrase in Chinese culture and online communities."
    },
    {
        "meme": "666",
        "example_sentence": "太顶了我愿称你为p老师，666",
        "meaning": "A way to express admiration or approval, often used to praise someone's skills or performance.",
        "source": "Originated from gaming culture, where '666' is used to signify something impressive."
    },
    {
        "meme": "高斯",
        "example_sentence": "高斯好可爱啊！想贴贴！",
        "meaning": "Refers to a character or concept associated with cuteness or admiration, often used in a playful context.",
        "source": "Could refer to a character from a specific anime or meme prevalent in the community."
    },
    {
        "meme": "hhhhh",
        "example_sentence": "哈哈哈哈哈哈好有趣",
        "meaning": "An expression of laughter, often used in online comments to convey amusement.",
        "source": "Commonly used in Chinese internet slang as a way to represent laughter."
    },
    {
        "meme": "babybabybaby",
        "example_sentence": "babybabybabybaby",
        "meaning": "An expression of excitement or affection, often used in a playful or endearing manner.",
        "source": "Popularized by music and internet culture."
    },
    {
        "meme": "抽抽抽抽抽抽",
        "example_sentence": "抽抽抽抽抽抽抽抽抽抽抽抽抽抽！！",
        "meaning": "A playful or exaggerated expression, often used to denote excitement or a repetitive action.",
        "source": "Reflects a rhythmic and emphatic style common in online comments."
    },
    {
        "meme": "xswl",
        "example_sentence": "xswl，想到他们私下的赌注游戏就想笑",
        "meaning": "An abbreviation for '笑死我了' (laughing to death), used to indicate something very funny.",
        "source": "Widely used in Chinese online communities to express extreme amusement."
    },
    {
        "meme": "我飞飞飞飞",
        "example_sentence": "我飞飞飞飞",
        "meaning": "An expression of excitement or a feeling of being uplifted, often used in a light-hearted context.",
        "source": "A playful phrase that reflects enthusiasm."
    },
    {
        "meme": "干的漂亮！",
        "example_sentence": "干的漂亮！",
        "meaning": "A phrase used to commend someone for doing something well or achieving a good result.",
        "source": "Commonly used in various contexts, especially in competitive or performance situations."
    },
    {
        "meme": "请多关照",
        "example_sentence": "这里的“请多关照”应该翻译为“初次见面”吧",
        "meaning": "A phrase often used to express politeness when meeting someone for the first time.",
        "source": "A common expression in Japanese culture, adopted in various contexts."
    },
    {
        "meme": "太刺激",
        "example_sentence": "好刺激",
        "meaning": "An expression used to convey excitement or thrill about an experience.",
        "source": "Commonly used in various forms of entertainment and media."
    },
    {
        "meme": "不想歪系列",
        "example_sentence": "不想歪系列",
        "meaning": "Refers to a series of comments or content that aim to avoid inappropriate or off-topic discussions.",
        "source": "Reflects a trend in online discussions to maintain focus."
    },
    {
        "meme": "救命哈哈哈哈",
        "example_sentence": "救命哈哈哈哈直接代入我们班主任的脸了，现在笑到停不下来",
        "meaning": "An expression of finding something extremely funny, often in a relatable context.",
        "source": "Common in humorous online discussions."
    },
    {
        "meme": "这米，HHHHH",
        "example_sentence": "这米，HHHHH",
        "meaning": "An expression of disbelief or surprise, often used in a humorous or exaggerated manner.",
        "source": "Reflects a playful tone in online interactions."
    },
    {
        "meme": "牛逼",
        "example_sentence": "卧槽老哥你牛逼啊",
        "meaning": "A phrase used to express admiration or respect for someone's abilities or achievements.",
        "source": "Common slang in Chinese, often used in casual conversations."
    }
]