[
    {
        "meme": "考古",
        "example_sentence": "2024回来考古，新能源汽车股价爆涨",
        "meaning": "Refers to revisiting or commenting on old content, often humorously suggesting that the commenter is 'digging up' past events or trends.",
        "source": "Commonly used in online communities to denote revisiting old topics or memes."
    },
    {
        "meme": "社恐大集合",
        "example_sentence": "社恐大集合了属于是",
        "meaning": "Used to describe a gathering or situation where socially anxious individuals feel represented or included.",
        "source": "A phrase often used in social media to humorously refer to social anxiety."
    },
    {
        "meme": "太酷了！！",
        "example_sentence": "太酷了！！！",
        "meaning": "An exaggerated expression of excitement or approval, often used in a humorous or sarcastic context.",
        "source": "Common internet slang used to express enthusiasm."
    },
    {
        "meme": "哟呼",
        "example_sentence": "哟呼",
        "meaning": "An exclamation used to express excitement or surprise.",
        "source": "Commonly used in various online platforms as a playful expression."
    },
    {
        "meme": "不懂就问",
        "example_sentence": "不懂就问这是爱音弹的吗，不是她弹的为什么是all in吉他啊？",
        "meaning": "Used to preface a question that might seem naive or uninformed, often humorously.",
        "source": "A common phrase in online discussions to indicate a lack of understanding."
    },
    {
        "meme": "这，才是真正的音乐！",
        "example_sentence": "这，才是真正的音乐！",
        "meaning": "Used to express a strong opinion about a piece of music, often implying that other forms are inferior.",
        "source": "A phrase often used in music discussions to assert one's taste."
    },
    {
        "meme": "好家伙",
        "example_sentence": "好家伙他也是个MAGA",
        "meaning": "An expression of surprise or disbelief, often implying that something unexpected has been revealed.",
        "source": "A common expression in online communities to convey shock or amazement."
    },
    {
        "meme": "哦漏",
        "example_sentence": "哦漏，my eyes",
        "meaning": "An expression of surprise or realization, often used humorously.",
        "source": "A playful take on the phrase 'oh no', commonly seen in online memes."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽这是退伍兵啊？！",
        "meaning": "An exclamation used to express shock or disbelief, often in a humorous context.",
        "source": "A widely used slang term in Chinese internet culture."
    },
    {
        "meme": "不愧是",
        "example_sentence": "不愧是索尼",
        "meaning": "Used to express admiration or validation of someone's or something's reputation.",
        "source": "Commonly used in online discussions to affirm expectations."
    },
    {
        "meme": "真老兵啊！",
        "example_sentence": "真老兵啊！",
        "meaning": "A phrase expressing respect or admiration for someone with experience, often used humorously.",
        "source": "Common in gaming and military contexts to refer to veterans."
    },
    {
        "meme": "我艹",
        "example_sentence": "我艹这么轻松哈哈哈哈哈",
        "meaning": "An expression of surprise or disbelief, often used to convey a strong reaction.",
        "source": "A common expletive in Chinese internet slang."
    },
    {
        "meme": "666",
        "example_sentence": "66666666666666666666666666666666666666666666666666666",
        "meaning": "Used to express approval or admiration, similar to saying 'awesome' or 'great'.",
        "source": "Originates from gaming culture, where '6' is pronounced similarly to 'liù', meaning 'smooth' or 'cool'."
    },
    {
        "meme": "前方高能！",
        "example_sentence": "前方高能！前方高能！",
        "meaning": "A warning that something exciting or shocking is about to happen.",
        "source": "Commonly used in online content to alert viewers to upcoming intense moments."
    },
    {
        "meme": "哈哈哈哈哈",
        "example_sentence": "哈哈哈哈哈",
        "meaning": "A common way to express laughter or amusement in text form.",
        "source": "Widely used in online communication to indicate humor."
    },
    {
        "meme": "你指尖跃动的电光，是我此生不变的信仰，唯我超电磁炮永世长存",
        "example_sentence": "你指尖跃动的电光，是我此生不变的信仰，唯我超电磁炮永世长存",
        "meaning": "A reference to a specific anime or character, expressing deep admiration.",
        "source": "Originates from the anime 'A Certain Scientific Railgun' and is often quoted by fans."
    },
    {
        "meme": "不对，冲我来的！",
        "example_sentence": "不对，冲我来的！",
        "meaning": "A humorous way to acknowledge that something unexpected is happening.",
        "source": "Commonly used in various contexts to indicate surprise."
    },
    {
        "meme": "我去",
        "example_sentence": "我去，让他学到了",
        "meaning": "An expression of surprise or disbelief, similar to 'oh my' or 'wow'.",
        "source": "A common phrase in Chinese internet slang."
    }
]