[
    {
        "meme": "我勒个？",
        "example_sentence": "我勒个？原来是个狠人。",
        "meaning": "An expression of surprise or disbelief, often used when one is shocked by unexpected information.",
        "source": "Common internet slang in Chinese social media."
    },
    {
        "meme": "哈哈哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈，这段呐喊爽了。",
        "meaning": "Used to express extreme amusement or laughter, often in reaction to something funny.",
        "source": "Commonly used in online chats and comments."
    },
    {
        "meme": "doge",
        "example_sentence": "设计了个颈椎保护器doge。",
        "meaning": "Refers to the 'Doge' meme, typically used to express humor or light-heartedness.",
        "source": "Originated from the Shiba Inu dog meme that became popular in 2013."
    },
    {
        "meme": "太牛了",
        "example_sentence": "这对吗？哇，这个可以拿去评纪录片类型的电影奖吗，真的太牛了。",
        "meaning": "Used to express admiration or amazement, often at someone's skills or achievements.",
        "source": "Common phrase used in Chinese internet culture."
    },
    {
        "meme": "一身反骨",
        "example_sentence": "一身反骨，真熟悉。",
        "meaning": "Refers to someone who is rebellious or goes against the norm.",
        "source": "Common phrase in Chinese literature and internet slang."
    },
    {
        "meme": "黑道赞助商（bushi）",
        "example_sentence": "特步：黑道赞助商（bushi）。",
        "meaning": "A humorous way to indicate something is not serious or is a joke, with 'bushi' meaning 'not' in a playful manner.",
        "source": "Play on words in Chinese internet culture."
    },
    {
        "meme": "2333333333333",
        "example_sentence": "2333333333333，我……",
        "meaning": "Used to indicate laughter, similar to 'LOL' or 'hahaha'; the number '233' is often associated with a laughing emoji.",
        "source": "Originated from a Chinese online forum, often used in gaming and meme culture."
    },
    {
        "meme": "这不是能理解的东西，尊重就行了",
        "example_sentence": "这不是能理解的东西，尊重就行了。",
        "meaning": "A way to express that something is beyond comprehension but should be accepted or respected.",
        "source": "Common phrase in discussions about differing opinions or beliefs."
    },
    {
        "meme": "飞飞飞",
        "example_sentence": "飞飞飞！",
        "meaning": "An expression of excitement or enthusiasm, often used in a playful context.",
        "source": "Common in online games and social media."
    },
    {
        "meme": "我超",
        "example_sentence": "我超，黑背心有东西的。",
        "meaning": "An expression of surprise or shock, similar to 'Oh my god' or 'Wow'.",
        "source": "Commonly used in Chinese internet slang."
    },
    {
        "meme": "小潮",
        "example_sentence": "小潮太舒服了输赢走不了输赢都无所谓了做节目效果就完了。",
        "meaning": "Refers to a popular figure or character, often used affectionately or humorously.",
        "source": "Common in fan communities and social media."
    },
    {
        "meme": "不相干",
        "example_sentence": "soyo：不相干。",
        "meaning": "Used to indicate that something is irrelevant or unrelated.",
        "source": "Common phrase in discussions and comments."
    },
    {
        "meme": "我的妈耶",
        "example_sentence": "我的妈耶，开始有点害怕了。",
        "meaning": "An expression of surprise or concern, similar to 'Oh my god'.",
        "source": "Common in Chinese social media."
    },
    {
        "meme": "太精彩",
        "example_sentence": "太精彩，真的是太精彩了，多谢款待。",
        "meaning": "Used to express appreciation for something impressive or well done.",
        "source": "Common phrase in positive feedback contexts."
    },
    {
        "meme": "这就是桌游的Key吗？",
        "example_sentence": "这就是桌游的Key吗？",
        "meaning": "A rhetorical question indicating confusion or surprise regarding the importance or relevance of something.",
        "source": "Common in discussions about games or strategies."
    },
    {
        "meme": "这小女孩是无辜的，学校的制度，你必须拿这个学分才能毕业。",
        "example_sentence": "这小女孩是无辜的，学校的制度，你必须拿这个学分才能毕业。",
        "meaning": "Used to highlight the innocence of individuals caught in a flawed system.",
        "source": "Common in discussions about education and social issues."
    }
]