[
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，这个组合绝了。",
        "meaning": "An expression of surprise or shock, often used to emphasize disbelief or amazement.",
        "source": "Common internet slang in Chinese online communities."
    },
    {
        "meme": "第一次充电",
        "example_sentence": "第一次充电，看了这个作品，真的太值了。",
        "meaning": "Refers to the first time someone engages with a piece of content, often implying a sense of excitement or importance.",
        "source": "Common phrase used in online communities to denote the first time interacting with a new experience."
    },
    {
        "meme": "哈哈哈哈哈",
        "example_sentence": "哈哈哈哈哈，他是怎么做到这么淡定的？",
        "meaning": "Used to express laughter, often in response to something humorous or absurd.",
        "source": "Standard internet expression for laughter in Chinese."
    },
    {
        "meme": "飞起来",
        "example_sentence": "整个人都要飞起来啦。",
        "meaning": "Used to express extreme excitement or happiness, as if one is about to take off or 'fly' due to joy.",
        "source": "Commonly used in various contexts to denote excitement."
    },
    {
        "meme": "这很难诶",
        "example_sentence": "这很难诶，可爱捏。",
        "meaning": "Used to express that something is difficult, often in a light-hearted or teasing manner.",
        "source": "A playful way to acknowledge the challenge of a situation."
    },
    {
        "meme": "牛逼",
        "example_sentence": "这哥们真牛逼。",
        "meaning": "A compliment meaning someone is impressive or awesome, often used in a casual or informal context.",
        "source": "A popular slang term in Chinese internet culture."
    },
    {
        "meme": "太抽象了",
        "example_sentence": "太抽象了，换句话说根本没人信总统能改变什么。",
        "meaning": "Used to describe something that is overly complex or difficult to understand.",
        "source": "Common phrase in discussions about abstract concepts."
    },
    {
        "meme": "高能预警",
        "example_sentence": "高能预警，这段真的太精彩了。",
        "meaning": "A warning that something intense or exciting is about to happen.",
        "source": "Commonly used in video or content descriptions to alert viewers."
    },
    {
        "meme": "我草",
        "example_sentence": "我草，这个视频居然快5年了，时间真快呀！",
        "meaning": "An expression of surprise or disbelief, similar to saying 'Oh my God' or 'What the heck'.",
        "source": "Popular expression in Chinese internet slang."
    },
    {
        "meme": "这不就是歧视。。。",
        "example_sentence": "这不就是歧视。。。",
        "meaning": "Used to call out perceived discrimination or unfair treatment.",
        "source": "Commonly used in discussions about social justice and equality."
    },
    {
        "meme": "老汉烟",
        "example_sentence": "老汉烟，这个气氛渲染的有点假。",
        "meaning": "A humorous expression referring to something that feels overly exaggerated or artificial.",
        "source": "Slang used to comment on theatrical or exaggerated scenarios."
    },
    {
        "meme": "我去",
        "example_sentence": "我去，太牛了。",
        "meaning": "An expression of astonishment, similar to 'Wow' or 'No way'.",
        "source": "Commonly used in casual conversations online."
    },
    {
        "meme": "精神状态",
        "example_sentence": "这个精神状态不就是弗兰克嘛。",
        "meaning": "Refers to someone's mental or emotional state, often used to compare someone to a well-known character or archetype.",
        "source": "Common in discussions about character analysis or psychology."
    },
    {
        "meme": "这就是原作吗",
        "example_sentence": "哪里ooc和误解向了，这不就是原作吗？",
        "meaning": "Used to question whether something aligns with the original work, often in fandom discussions.",
        "source": "Common in fan communities discussing adaptations."
    },
    {
        "meme": "你猜怎么着？！",
        "example_sentence": "你猜怎么着？！",
        "meaning": "A rhetorical question used to build suspense or anticipation before revealing something surprising.",
        "source": "Commonly used in storytelling or humorous contexts."
    }
]