[
    {
        "meme": "yyds",
        "example_sentence": "这部电影真的是yyds！",
        "meaning": "An abbreviation for '永远的神', meaning someone or something that is forever amazing or revered.",
        "source": "Popularized in Chinese internet culture, particularly among younger audiences."
    },
    {
        "meme": "哈哈哈哈哈",
        "example_sentence": "这段视频太搞笑了，哈哈哈哈哈！",
        "meaning": "A common expression of laughter, emphasizing amusement.",
        "source": "Commonly used in online chats and social media."
    },
    {
        "meme": "我靠",
        "example_sentence": "我靠，这个剧情太反转了！",
        "meaning": "An expression of surprise or disbelief, similar to 'Oh my god' or 'Wow'.",
        "source": "Widely used in everyday Chinese slang."
    },
    {
        "meme": "飞飞飞飞飞飞飞飞飞",
        "example_sentence": "这首歌太好听了，飞飞飞飞飞！",
        "meaning": "Repetition used to emphasize excitement or enthusiasm.",
        "source": "Common in online comments to express heightened emotions."
    },
    {
        "meme": "控制油价啊。石油美元啊。呵呵",
        "example_sentence": "控制油价啊。石油美元啊。呵呵，真是无奈。",
        "meaning": "A sarcastic remark reflecting on economic issues or frustrations.",
        "source": "Reflects a common sentiment in discussions about global economics."
    },
    {
        "meme": "送你进ICU",
        "example_sentence": "这操作真是送你进ICU啊！",
        "meaning": "Used humorously to suggest that something is so shocking or intense that it could cause a health crisis.",
        "source": "A meme that has circulated in various online communities."
    },
    {
        "meme": "经典来了！！！！",
        "example_sentence": "这段台词太经典了！！！！",
        "meaning": "An excited declaration that something is iconic or timeless.",
        "source": "Commonly used in response to memorable quotes or moments."
    },
    {
        "meme": "我心碎",
        "example_sentence": "看完这个故事，我心碎。",
        "meaning": "Expresses deep emotional pain or sadness, often in a dramatic way.",
        "source": "A frequent expression in romantic or tragic contexts."
    },
    {
        "meme": "太爱了",
        "example_sentence": "这部剧我太爱了！",
        "meaning": "A strong expression of affection or admiration for something.",
        "source": "Commonly used in fan communities."
    },
    {
        "meme": "这样的一样，已经被过于宽泛化了",
        "example_sentence": "这种说法这样的一样，已经被过于宽泛化了。",
        "meaning": "Critique of vague or overused phrases in discussions.",
        "source": "Reflects a common frustration with language dilution."
    },
    {
        "meme": "阿拉宁波人",
        "example_sentence": "阿拉宁波人，真是太有意思了！",
        "meaning": "A humorous or proud declaration of regional identity.",
        "source": "Reflects local pride and is often used in regional jokes."
    },
    {
        "meme": "你指尖跃动的电光，是我此生不变的信仰",
        "example_sentence": "这段歌词让我想起你，‘你指尖跃动的电光，是我此生不变的信仰’。",
        "meaning": "A poetic expression of deep admiration or devotion.",
        "source": "From a popular song, often quoted in romantic contexts."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，这个反转太厉害了！",
        "meaning": "An exclamation of surprise or shock.",
        "source": "Commonly used in casual conversations and online comments."
    },
    {
        "meme": "重生之逃离羊村",
        "example_sentence": "这部小说叫《重生之逃离羊村》，真是太好看了！",
        "meaning": "Refers to a specific genre of stories involving reincarnation or escape.",
        "source": "Popularized in web literature and online communities."
    },
    {
        "meme": "不敢吃呀",
        "example_sentence": "看到这个菜我真的不敢吃呀。",
        "meaning": "An expression of hesitation or fear, often used humorously.",
        "source": "Common in food-related discussions."
    },
    {
        "meme": "就哭和",
        "example_sentence": "看完这部电影，我就哭和。",
        "meaning": "Used to express overwhelming emotions, often sadness.",
        "source": "A phrase that has gained popularity in emotional contexts."
    }
]