[
    {
        "meme": "这是真退出来了吗",
        "example_sentence": "在讨论某个视频时，有人评论说：'这是真退出来了吗'",
        "meaning": "Used to express disbelief or surprise about a situation that seems too absurd to be true.",
        "source": "General internet usage, often in reaction to unexpected or shocking content."
    },
    {
        "meme": "爱爱爱爱爱",
        "example_sentence": "在某个甜蜜场景下，弹幕不断刷出：'爱爱爱爱爱'",
        "meaning": "An exaggerated expression of love or affection, often used humorously or to emphasize strong feelings.",
        "source": "Commonly used in online communities to express excitement or joy."
    },
    {
        "meme": "好好好好好好",
        "example_sentence": "看到令人满意的内容时，评论区满是：'好好好好好好'",
        "meaning": "Used to express strong agreement or enthusiasm, often in a repetitive manner for emphasis.",
        "source": "A syntactic structure that mimics excitement or approval, popular in various online platforms."
    },
    {
        "meme": "哦哦，怪不得",
        "example_sentence": "当解释某个现象时，有人评论：'哦哦，怪不得'",
        "meaning": "A realization or understanding of something that was previously unclear.",
        "source": "Common conversational phrase used in casual discussions."
    },
    {
        "meme": "普通话听不懂？？",
        "example_sentence": "在一段视频中，有人说了方言，弹幕立刻出现：'普通话听不懂？？'",
        "meaning": "Used humorously to highlight a situation where someone is confused due to language barriers.",
        "source": "A common reaction in multilingual contexts, especially online."
    },
    {
        "meme": "我已经下意识在往后躲了",
        "example_sentence": "在观看惊悚片时，有人评论：'我已经下意识在往后躲了'",
        "meaning": "Expresses a reflexive response to fear or surprise, often used humorously.",
        "source": "A relatable reaction in horror or suspense contexts."
    },
    {
        "meme": "你这是东京汴梁吧",
        "example_sentence": "在讨论一部动画时，有人调侃：'你这是东京汴梁吧'",
        "meaning": "Used sarcastically to comment on something that seems out of place or mismatched.",
        "source": "A humorous phrase that plays on cultural references."
    },
    {
        "meme": "换算成人民币一年5万",
        "example_sentence": "在讨论收入时，有人提到：'换算成人民币一年5万'",
        "meaning": "Used to emphasize the relativity of financial figures, often in a humorous context.",
        "source": "Common in discussions about money and economics."
    },
    {
        "meme": "哈哈哈哈哈哈哈哈",
        "example_sentence": "在看到搞笑片段时，评论区刷屏：'哈哈哈哈哈哈哈哈'",
        "meaning": "An exaggerated expression of laughter, often used to convey extreme amusement.",
        "source": "A standard expression of laughter in online communication."
    },
    {
        "meme": "暴走族",
        "example_sentence": "在讨论某个极限运动时，有人调侃：'暴走族'",
        "meaning": "Refers to a group of people who engage in reckless or extreme behavior, used humorously.",
        "source": "Originates from internet culture, often linked to memes about extreme sports."
    },
    {
        "meme": "牛逼了",
        "example_sentence": "看到某个精彩表演，评论区有人说：'牛逼了'",
        "meaning": "Used to express admiration or amazement at someone's skill or achievement.",
        "source": "A colloquial expression in Chinese that has become popular in online discussions."
    }
]