[
    {
        "meme": "卧槽",
        "example_sentence": "卧槽我笑的快趴地上了。",
        "meaning": "An expression of surprise or disbelief, often used to convey strong emotions such as shock or humor.",
        "source": "Common internet slang in Chinese online communities."
    },
    {
        "meme": "高666",
        "example_sentence": "高666",
        "meaning": "A way to express admiration or praise, often used humorously or sarcastically.",
        "source": "A play on the number '6', which is considered lucky in Chinese culture."
    },
    {
        "meme": "这就是纪录片",
        "example_sentence": "这就是纪录片。",
        "meaning": "Used to emphasize the authenticity or seriousness of a situation, often in a humorous context.",
        "source": "Commonly used in discussions or comments about real-life events that seem dramatic."
    },
    {
        "meme": "人飞起来了兄弟们",
        "example_sentence": "人飞起来了兄弟们。",
        "meaning": "Used to describe a situation that is so unbelievable or exaggerated that it feels surreal.",
        "source": "A meme format often used in humorous commentary."
    },
    {
        "meme": "哈哈哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈小傲。",
        "meaning": "An exaggerated expression of laughter, often used to indicate something is very funny.",
        "source": "Commonly used in online chatting and comments."
    },
    {
        "meme": "我又想起那句",
        "example_sentence": "我又想起那句，阿斗长这么胖也不是因为搜刮民间粮食。",
        "meaning": "A reference to a well-known phrase or saying, used to evoke a shared cultural memory.",
        "source": "Derived from historical or cultural references in Chinese literature."
    },
    {
        "meme": "害怕区一姐不害怕？（doge）",
        "example_sentence": "害怕区一姐不害怕？（doge）",
        "meaning": "A humorous way to express mock fear or disbelief, often accompanied by the 'doge' meme.",
        "source": "The 'doge' meme, which features a Shiba Inu dog with captions in broken English."
    },
    {
        "meme": "无敌了",
        "example_sentence": "哈哈哈哈哈无敌了。",
        "meaning": "Used to describe something or someone as unbeatable or extremely impressive.",
        "source": "Common slang in gaming and competitive contexts."
    },
    {
        "meme": "哈哈，什么东西？",
        "example_sentence": "哈哈，什么东西？",
        "meaning": "An expression of confusion or disbelief, often used humorously.",
        "source": "Commonly used in casual conversations online."
    },
    {
        "meme": "这天是我的生日",
        "example_sentence": "这天是我的生日。",
        "meaning": "A phrase that can be used to draw attention to oneself, often used humorously in a context where it may not be relevant.",
        "source": "Commonly used in social media posts."
    },
    {
        "meme": "绝了",
        "example_sentence": "绝了哈哈哈哈哈哈哈哈哈。",
        "meaning": "An expression of amazement or admiration, often used sarcastically.",
        "source": "Commonly used in online comments and discussions."
    },
    {
        "meme": "人油",
        "example_sentence": "人油。",
        "meaning": "A humorous term used to describe a person who is overly greasy or slick, often used to mock someone.",
        "source": "Internet slang that has become popular in various online communities."
    },
    {
        "meme": "就是巴勒斯坦那种小而美吧？",
        "example_sentence": "就是巴勒斯坦那种小而美吧？",
        "meaning": "Used to describe something that is small yet beautiful, often in a sarcastic or ironic context.",
        "source": "Cultural references that play on the idea of beauty in simplicity."
    },
    {
        "meme": "飞飞飞飞飞飞飞飞飞飞",
        "example_sentence": "飞飞飞飞飞飞飞飞飞飞。",
        "meaning": "A repetitive phrase used to convey excitement or enthusiasm, often in a humorous or exaggerated way.",
        "source": "Commonly used in playful or dramatic contexts."
    },
    {
        "meme": "好家伙",
        "example_sentence": "好家伙好家伙好家伙。",
        "meaning": "An expression of surprise or admiration, often used in a humorous or exaggerated manner.",
        "source": "Slang that has become popular in various online interactions."
    },
    {
        "meme": "这不就是歧视吗",
        "example_sentence": "这不就是歧视吗。",
        "meaning": "Used to call out perceived discrimination or unfair treatment, often in a sarcastic tone.",
        "source": "Commonly used in discussions about social issues."
    },
    {
        "meme": "感谢饼叔让我们看清真相",
        "example_sentence": "感谢饼叔让我们看清真相。",
        "meaning": "A humorous way to express gratitude for revealing the truth, often used sarcastically.",
        "source": "Refers to a character or persona in online communities."
    }
]