[
    {
        "meme": "得得得得得得得",
        "example_sentence": "得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得得",
        "meaning": "Used to express overwhelming excitement or agreement, often in a humorous or exaggerated manner.",
        "source": "Internet slang, popular on various online platforms including Bilibili."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，The Fvcking Frank ！",
        "meaning": "An exclamation of surprise or shock, similar to 'Wow' or 'What the hell'.",
        "source": "Commonly used in Chinese internet slang."
    },
    {
        "meme": "高松灯",
        "example_sentence": "高松灯，真是会PUA。",
        "meaning": "Refers to someone who is skilled at manipulation, particularly in romantic contexts.",
        "source": "Derived from discussions on relationships and manipulation tactics in online communities."
    },
    {
        "meme": "我活着就是为了听这个",
        "example_sentence": "我活着就是为了听这个。",
        "meaning": "Expresses a deep appreciation or love for something, suggesting that it brings great joy or meaning to one's life.",
        "source": "Common expression in fan culture, often seen in comments about music or performances."
    },
    {
        "meme": "前方高能",
        "example_sentence": "前方高能！！",
        "meaning": "Used to warn viewers that something exciting or shocking is about to happen.",
        "source": "Commonly used in video comments to prepare viewers for unexpected twists."
    },
    {
        "meme": "冷知识",
        "example_sentence": "冷知识，日本是河南加陕西那么大…",
        "meaning": "Refers to obscure or lesser-known facts that are interesting yet not widely recognized.",
        "source": "Popularized by various educational and entertainment content online."
    },
    {
        "meme": "哈哈哈哈",
        "example_sentence": "哈哈哈哈这真的最离谱。",
        "meaning": "An expression of laughter, indicating something is funny or absurd.",
        "source": "A common reaction in online interactions, used universally across platforms."
    },
    {
        "meme": "一语成谶",
        "example_sentence": "一语成谶，真是会PUA。",
        "meaning": "Refers to a saying or prediction that comes true, often used humorously.",
        "source": "A phrase from Chinese literature, now adapted in internet slang."
    },
    {
        "meme": "我的心 是冰冰哒",
        "example_sentence": "我的心 是冰冰哒。",
        "meaning": "Indicates emotional coldness or detachment, often used humorously.",
        "source": "Originates from various memes and expressions in online culture."
    },
    {
        "meme": "数年后…",
        "example_sentence": "数年后…老师好我叫托尼斯塔克！",
        "meaning": "Used to humorously denote a significant time jump or change in a situation.",
        "source": "Popularized in memes depicting character transformations or future scenarios."
    },
    {
        "meme": "不愧是我",
        "example_sentence": "不愧是我，真是会PUA。",
        "meaning": "Used to express pride in one's abilities or characteristics, often sarcastically.",
        "source": "Commonly used in self-deprecating humor or boasting online."
    }
]