[
    {
        "meme": "哈哈哈哈",
        "example_sentence": "拖鞋，哈哈哈哈",
        "meaning": "Used to express laughter or amusement, often in response to something funny or absurd.",
        "source": "Common internet slang in Chinese online communities."
    },
    {
        "meme": "我嘞个小丑",
        "example_sentence": "我嘞个小丑，这剧情真是太搞笑了！",
        "meaning": "A phrase expressing disbelief or surprise, often used humorously to indicate that someone feels foolish.",
        "source": "Popularized in various online discussions and memes."
    },
    {
        "meme": "！！！！！！！！！！！！！！！！！！！！！！！！！！",
        "example_sentence": "这也太离谱了！！！！！！！！！！！！！！！！！！！！！！！！！！",
        "meaning": "Used to emphasize extreme emotions like shock or excitement, often exaggerating the sentiment.",
        "source": "Common usage in online comments to convey intense feelings."
    },
    {
        "meme": "心脏疼 鸡皮疙瘩狂起",
        "example_sentence": "看到这个场面，心脏疼 鸡皮疙瘩狂起。",
        "meaning": "Describes a strong emotional reaction, often related to fear or excitement.",
        "source": "Commonly used in reaction memes and comments."
    },
    {
        "meme": "666",
        "example_sentence": "这场表演真是666！",
        "meaning": "Used to express admiration or approval, similar to saying 'awesome' or 'great'.",
        "source": "Originates from gaming culture, particularly in live streaming contexts."
    },
    {
        "meme": "不想死，老实点",
        "example_sentence": "在这种情况下，不想死，老实点。",
        "meaning": "A humorous way to suggest that one should behave cautiously to avoid trouble.",
        "source": "Common in humorous comments in response to reckless behavior."
    },
    {
        "meme": "害怕+1",
        "example_sentence": "这个场景太可怕了，害怕+1。",
        "meaning": "Indicates fear or anxiety, often in a light-hearted or exaggerated manner.",
        "source": "Commonly used in online discussions to express fear."
    },
    {
        "meme": "纯正新乡口音",
        "example_sentence": "他说话的方式真有趣，纯正新乡口音。",
        "meaning": "Refers to a specific accent or dialect, often used humorously to highlight regional differences.",
        "source": "Regional dialects and accents are often discussed in online communities."
    },
    {
        "meme": "这可怕的收藏量",
        "example_sentence": "这可怕的收藏量让我震惊。",
        "meaning": "Expresses surprise or disbelief at a large number of items or views.",
        "source": "Used in contexts discussing popularity or virality."
    },
    {
        "meme": "已经开始害怕了吗哈哈哈",
        "example_sentence": "看到这个剧情，已经开始害怕了吗哈哈哈。",
        "meaning": "Used to mockingly question someone's fear in a humorous way.",
        "source": "Common in memes and comments reacting to horror or suspenseful content."
    },
    {
        "meme": "爱爱爱爱爱",
        "example_sentence": "这个角色太可爱了，爱爱爱爱爱！",
        "meaning": "An exaggerated expression of affection or admiration, often used humorously.",
        "source": "Common in fan communities and social media."
    }
]