[
    {
        "meme": "欧皇的皇",
        "example_sentence": "你可以跟海皇比任何事情，唯独不能跟他比运气。我叫海皇的海。欧皇的皇。",
        "meaning": "Refers to someone who is extremely lucky, especially in games or gambling contexts, contrasting with the concept of '海皇' (Sea Emperor), which suggests a different kind of prowess or skill.",
        "source": "Originates from gaming culture, particularly related to luck in games."
    },
    {
        "meme": "666",
        "example_sentence": "这位妈妈辛苦了，6666666666666666666666666666。",
        "meaning": "Used to express admiration or approval, similar to saying 'awesome' or 'cool'.",
        "source": "Commonly used in Chinese online gaming and streaming communities."
    },
    {
        "meme": "受教育程度很高啊",
        "example_sentence": "大陆的年轻人整体文化水平高好多啊，受教育程度很高啊。",
        "meaning": "A sarcastic remark often used to mock someone’s lack of common sense or poor judgment despite having formal education.",
        "source": "Reflects a common sentiment in online discussions about education versus practical intelligence."
    },
    {
        "meme": "啊？？？？？",
        "example_sentence": "啊？？？？？这句话太有道理了。",
        "meaning": "An expression of confusion or disbelief, often used to highlight something surprising or absurd.",
        "source": "Common in online conversations to emphasize shock or incredulity."
    },
    {
        "meme": "哈哈哈哈哈哈哈",
        "example_sentence": "饼叔都听呆了哈哈哈哈哈哈哈哈哈。",
        "meaning": "An exaggerated expression of laughter, often used to convey amusement or mockery.",
        "source": "Widespread in online chats and forums to indicate something is very funny."
    },
    {
        "meme": "保持尊重",
        "example_sentence": "保持尊重，大家都是朋友。",
        "meaning": "A phrase used to remind others to be respectful, often in heated discussions.",
        "source": "Commonly used in online communities to promote civility."
    },
    {
        "meme": "我靠",
        "example_sentence": "我靠，真不把兄弟当外人啊。",
        "meaning": "An exclamation of surprise or shock, often used in informal contexts.",
        "source": "A typical expression in casual Chinese conversations."
    },
    {
        "meme": "梦回高中啊啊啊啊啊啊啊",
        "example_sentence": "梦回高中啊啊啊啊啊啊啊，真是怀念。",
        "meaning": "A nostalgic expression reflecting longing for high school days.",
        "source": "Commonly used by young adults reminiscing about their school life."
    },
    {
        "meme": "保持尊重",
        "example_sentence": "保持尊重，大家都是朋友。",
        "meaning": "A phrase used to remind others to be respectful, often in heated discussions.",
        "source": "Commonly used in online communities to promote civility."
    },
    {
        "meme": "双胞胎：你买了我吃啥",
        "example_sentence": "双胞胎：你买了我吃啥，真是太搞笑了。",
        "meaning": "A humorous expression reflecting the dependency or connection between twins or close friends.",
        "source": "Derived from humorous online content about relationships."
    },
    {
        "meme": "这真的不是姜文吗",
        "example_sentence": "这真的不是姜文吗，太像了。",
        "meaning": "Used to express disbelief or surprise at someone's resemblance to a well-known figure.",
        "source": "Originates from discussions in entertainment contexts."
    }
]