[
    {
        "meme": "666",
        "example_sentence": "大家快快去看某科学的超电磁炮大家快快去看某科学的超电磁炮大家快快去看某科学的超电磁炮大家快快去看某科学的超电磁炮大家快快去看某科学的超电磁炮大家快快去看某科学的超电磁炮大家快快去看某科学的超电磁炮大家",
        "meaning": "Used to express excitement or approval, often in response to something impressive or entertaining.",
        "source": "Commonly used in Chinese online gaming and streaming communities."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽啊",
        "meaning": "An exclamation of surprise or shock, often used in a humorous context.",
        "source": "A widely used expression in Chinese internet slang."
    },
    {
        "meme": "这属于不用提前布景的电影质感了",
        "example_sentence": "这属于不用提前布景的电影质感了",
        "meaning": "Refers to a situation that is so visually appealing or dramatic that it feels like a movie scene.",
        "source": "Internet commentary on high-quality visuals or unexpected moments."
    },
    {
        "meme": "我笑了，神明保佑",
        "example_sentence": "我笑了，神明保佑",
        "meaning": "Used to express laughter at a humorous situation, often with a hint of irony or disbelief.",
        "source": "Commonly seen in humorous or absurd contexts online."
    },
    {
        "meme": "一闪而过的嘟嘟可",
        "example_sentence": "一闪而过的嘟嘟可",
        "meaning": "Refers to something that is fleeting or momentary, often used to describe a brief but impactful moment.",
        "source": "A poetic expression found in online discussions."
    },
    {
        "meme": "哈哈哈哈哈",
        "example_sentence": "哈哈哈哈哈咸饮料",
        "meaning": "Indicates laughter, often used to convey amusement or enjoyment.",
        "source": "Standard expression of laughter in Chinese internet culture."
    },
    {
        "meme": "我对有些同性恋真的是刻板印象拉满",
        "example_sentence": "我对有些同性恋真的是刻板印象拉满。",
        "meaning": "Used to convey a humorous or exaggerated stereotype about a group, often in a self-aware or ironic manner.",
        "source": "Reflects discussions around stereotypes in online communities."
    },
    {
        "meme": "你指尖跃动的光，是我此生不变的信仰",
        "example_sentence": "你指尖跃动的光，是我此生不变的信仰，唯我超电磁炮永世长存。",
        "meaning": "A poetic expression of devotion or admiration, often used in fandoms.",
        "source": "Derived from fan culture surrounding anime and gaming."
    },
    {
        "meme": "真不错，不对",
        "example_sentence": "真不错，不对",
        "meaning": "Used to humorously contradict oneself after initially expressing approval.",
        "source": "Commonly used in humorous commentary."
    },
    {
        "meme": "不就是跳大神么",
        "example_sentence": "不就是跳大神么",
        "meaning": "A dismissive phrase used to trivialize something that is being exaggerated.",
        "source": "Common in discussions that critique overblown reactions."
    },
    {
        "meme": "抽抽抽抽抽",
        "example_sentence": "抽抽抽抽抽抽抽！！！",
        "meaning": "Used to express excitement or anticipation, often in a playful manner.",
        "source": "A playful repetition common in online chats."
    },
    {
        "meme": "我飞起来了",
        "example_sentence": "我飞起来了",
        "meaning": "Used to express extreme excitement or joy, often in a hyperbolic way.",
        "source": "Commonly used in gaming or celebratory contexts."
    },
    {
        "meme": "这玩吧",
        "example_sentence": "这玩吧",
        "meaning": "A casual way to refer to something being discussed or shown, often with a sense of familiarity.",
        "source": "Casual speech in online interactions."
    }
]