[
    {
        "meme": "卧槽",
        "example_sentence": "卧槽!牛啊!",
        "meaning": "An expression of surprise or admiration, often used to emphasize a strong reaction.",
        "source": "Common internet slang in Chinese online communities."
    },
    {
        "meme": "666",
        "example_sentence": "666，这个入是桂",
        "meaning": "Used to express approval or admiration, similar to saying 'awesome' or 'cool'.",
        "source": "Originated from gaming culture, often used in live streams and online chats."
    },
    {
        "meme": "哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈",
        "meaning": "A way to express laughter, often used to indicate something is very funny.",
        "source": "Commonly used in Chinese internet culture, especially in comments and chats."
    },
    {
        "meme": "这就不是人能调出来的",
        "example_sentence": "这就不是人能调出来的",
        "meaning": "Used to express disbelief or to comment on something that seems impossible or extraordinary.",
        "source": "A phrase that captures the sentiment of amazement in reaction to impressive feats."
    },
    {
        "meme": "我艹",
        "example_sentence": "我艹这么牛逼",
        "meaning": "An expression of shock or surprise, often used to emphasize a strong reaction to something impressive.",
        "source": "Common internet slang in Chinese online communities."
    },
    {
        "meme": "爱音这波不是很友善啊",
        "example_sentence": "爱音这波不是很友善啊",
        "meaning": "A critique or comment on someone's behavior or statement, suggesting it was unfriendly or harsh.",
        "source": "Reflects the culture of commentary on interpersonal interactions in online spaces."
    },
    {
        "meme": "前方高能预警",
        "example_sentence": "前方高能预警  前方高帅预警！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！",
        "meaning": "A warning that something exciting or shocking is about to happen, often used before a dramatic moment.",
        "source": "Commonly used in video comments to build anticipation."
    },
    {
        "meme": "这段看得我血压飙升",
        "example_sentence": "这段看得我血压飙升",
        "meaning": "Used to express that something is extremely intense or stressful, often in a humorous way.",
        "source": "Reflects the dramatic reactions often found in commentary on intense scenes."
    },
    {
        "meme": "这可不类似",
        "example_sentence": "这可不类似 晚上一堆躺尸酒鬼的城市可没几个",
        "meaning": "Used to indicate that something is not comparable to another, often used to downplay a situation.",
        "source": "A phrase that emphasizes contrast in discussions."
    },
    {
        "meme": "绝了，绝了",
        "example_sentence": "绝了，绝了",
        "meaning": "An expression of amazement or disbelief, often used to comment on something that is exceptionally good or bad.",
        "source": "Commonly used in reaction to remarkable events or comments."
    },
    {
        "meme": "我愿用一生陪你撸活驴",
        "example_sentence": "我愿用一生陪你撸活驴",
        "meaning": "A humorous or absurd expression of commitment or affection, often used playfully.",
        "source": "Reflects the playful absurdity common in internet memes."
    },
    {
        "meme": "动态躲藏",
        "example_sentence": "动态躲藏",
        "meaning": "Refers to hiding one's activities or presence, often used in the context of avoiding attention.",
        "source": "Commonly used in discussions about privacy or stealth in online interactions."
    },
    {
        "meme": "一入银魂深似海",
        "example_sentence": "一入银魂深似海，从此节操是路人",
        "meaning": "Used to express how deeply one has become involved in a particular fandom or interest, often with humorous resignation.",
        "source": "Originates from the anime 'Gintama', reflecting the depth of fandom engagement."
    },
    {
        "meme": "这就是付费内容嘛",
        "example_sentence": "这就是付费内容嘛 好劲噢~",
        "meaning": "Acknowledgment of content that requires payment, often used humorously to comment on the value of such content.",
        "source": "Common in discussions about monetized content in online platforms."
    },
    {
        "meme": "我去！",
        "example_sentence": "我去！这视频太好笑了！",
        "meaning": "An expression of surprise or excitement, often used to react to something unexpected.",
        "source": "A common exclamation in Chinese internet slang."
    },
    {
        "meme": "文化大老婆",
        "example_sentence": "文化大老婆",
        "meaning": "A playful term often used to refer to someone who embodies or represents cultural ideals in a humorous way.",
        "source": "Reflects the blending of cultural references and humor in online discussions."
    },
    {
        "meme": "这活儿真细啊",
        "example_sentence": "这活儿真细啊",
        "meaning": "Used to compliment someone on their meticulous work or attention to detail.",
        "source": "Commonly used in commentary on crafts or skills."
    }
]