[
    {
        "meme": "我会永远守护着你！",
        "example_sentence": "我会永远守护着你！我会永远守护着你！我会永远守护着你！",
        "meaning": "A phrase expressing unwavering loyalty and commitment, often used humorously or exaggeratedly.",
        "source": "Commonly used in various romantic contexts in Chinese media."
    },
    {
        "meme": "天生要爆炸",
        "example_sentence": "面对这个难题，我真是天生要爆炸！",
        "meaning": "Used to express frustration or overwhelming emotions, often in a humorous context.",
        "source": "A popular phrase that has circulated in internet culture."
    },
    {
        "meme": "噢噢噢噢噢噢噢噢噢噢噢噢噢！！",
        "example_sentence": "看到这个消息，我只能说噢噢噢噢噢噢噢噢噢噢噢噢噢！！",
        "meaning": "An expression of excitement or surprise, often used to convey strong emotions.",
        "source": "Commonly seen in various online comment sections."
    },
    {
        "meme": "用头撞桌子*36",
        "example_sentence": "听到这个消息，我真的是用头撞桌子*36。",
        "meaning": "A humorous way to express frustration or disbelief, implying a strong reaction.",
        "source": "A common expression in online communities to exaggerate one's feelings."
    },
    {
        "meme": "666",
        "example_sentence": "这个视频真不错，666！",
        "meaning": "A way to express approval or admiration, similar to 'awesome' or 'cool'.",
        "source": "Originated from gaming culture, often used in Chinese online platforms."
    },
    {
        "meme": "这不得来首 YMCA啊",
        "example_sentence": "看到大家这么high，这不得来首 YMCA啊！",
        "meaning": "A humorous reference to the song 'YMCA', suggesting a fun or celebratory atmosphere.",
        "source": "Refers to the song by the Village People, often used in party contexts."
    },
    {
        "meme": "牛叉",
        "example_sentence": "你做的这个项目真牛叉！",
        "meaning": "A slang term used to describe something impressive or excellent.",
        "source": "Commonly used in Chinese slang, especially among younger generations."
    },
    {
        "meme": "我赌两个币",
        "example_sentence": "我赌两个币这个比赛你赢不了。",
        "meaning": "A way to express a bet or wager, often used in a playful context.",
        "source": "Popular in gaming and betting contexts in online discussions."
    },
    {
        "meme": "支持必须 支持老乡",
        "example_sentence": "作为老乡，支持必须 支持老乡！",
        "meaning": "A phrase showing solidarity or support for someone from the same hometown.",
        "source": "Commonly used in regional discussions and community support."
    },
    {
        "meme": "草哈哈哈哈",
        "example_sentence": "这个笑话真搞笑，草哈哈哈哈！",
        "meaning": "An expression of laughter, similar to 'LOL' or 'lmao'.",
        "source": "Derived from online gaming and chat culture."
    },
    {
        "meme": "前方高能预警",
        "example_sentence": "前方高能预警，准备好你的心脏！",
        "meaning": "A warning that something exciting or shocking is about to happen.",
        "source": "Commonly used in video and meme culture to build anticipation."
    },
    {
        "meme": "这才是镇站之宝啊",
        "example_sentence": "这个视频真是太精彩了，这才是镇站之宝啊！",
        "meaning": "Used to describe something that is outstanding or a highlight, often in a humorous way.",
        "source": "A phrase often seen in comment sections of popular videos."
    }
]