[
    {
        "meme": "心塞了",
        "example_sentence": "看到这，好难过，打字都看不清了，心塞了。",
        "meaning": "Used to express a feeling of sadness or frustration, often in response to something disappointing.",
        "source": "Commonly used in Chinese online communities to convey emotional distress."
    },
    {
        "meme": "绝了",
        "example_sentence": "这段视频太搞笑了，绝了绝了绝了绝了绝了。",
        "meaning": "An expression of extreme admiration or amazement, often used humorously.",
        "source": "Popularized in various online platforms as a way to emphasize excitement."
    },
    {
        "meme": "我去",
        "example_sentence": "我去，这个剧情太反转了！",
        "meaning": "An exclamatory phrase used to express surprise or disbelief.",
        "source": "Commonly used in everyday Chinese speech and online comments."
    },
    {
        "meme": "哈哈哈哈",
        "example_sentence": "这个笑话太好笑了，哈哈哈哈。",
        "meaning": "A common way to indicate laughter or amusement in text form.",
        "source": "Widely used across all internet platforms."
    },
    {
        "meme": "加油",
        "example_sentence": "高斯加油啊，我们都支持你！",
        "meaning": "A phrase of encouragement, similar to 'go for it' or 'keep it up'.",
        "source": "Often used in motivational contexts, especially in competitive environments."
    },
    {
        "meme": "爱爱爱",
        "example_sentence": "你是我的优乐美啊～爱爱爱。",
        "meaning": "An exaggerated expression of affection or love, often used humorously.",
        "source": "Derived from popular culture references and memes."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，这个效果太惊人了！",
        "meaning": "An exclamation of shock or surprise, often used informally.",
        "source": "A slang term commonly used in Chinese internet culture."
    },
    {
        "meme": "牛逼",
        "example_sentence": "他做的事情真是牛逼！",
        "meaning": "A colloquial term used to express admiration or acknowledgment of someone's impressive actions.",
        "source": "Popular in Chinese slang, often used in various contexts."
    },
    {
        "meme": "加鸡腿",
        "example_sentence": "这段表演真不错，加鸡腿！",
        "meaning": "A humorous way to express appreciation, akin to 'give a thumbs up'.",
        "source": "A playful internet slang that has emerged in recent years."
    },
    {
        "meme": "真神登场",
        "example_sentence": "这个角色真神登场，太厉害了！",
        "meaning": "Used to describe someone or something that has made a grand or impressive entrance.",
        "source": "Commonly used in gaming and entertainment contexts."
    },
    {
        "meme": "太魔幻了",
        "example_sentence": "这个剧情发展太魔幻了，我看不懂了。",
        "meaning": "Used to describe something surreal or fantastical, often in a bewildering way.",
        "source": "Gained popularity in discussions about unexpected plot twists."
    },
    {
        "meme": "又把话题聊沉重了",
        "example_sentence": "我们本来在聊轻松的话题，结果又把话题聊沉重了。",
        "meaning": "A humorous acknowledgment of how conversations can unexpectedly turn serious.",
        "source": "Commonly used in casual conversations to lighten the mood."
    },
    {
        "meme": "pocket3",
        "example_sentence": "这个游戏的更新真不错，pocket3。",
        "meaning": "Refers to a specific feature or aspect of a game that is well-received.",
        "source": "Specific to gaming communities on platforms like Bilibili."
    },
    {
        "meme": "能上名校的本身就是有钱人",
        "example_sentence": "能上名校的本身就是有钱人！",
        "meaning": "A cynical observation about socioeconomic status and educational opportunities.",
        "source": "Reflects societal commentary often seen in discussions about education."
    },
    {
        "meme": "我感觉这大哥可以拍部电影了",
        "example_sentence": "他做的事情真精彩，我感觉这大哥可以拍部电影了。",
        "meaning": "Used to describe someone whose actions or life story are so interesting they could be a movie plot.",
        "source": "A humorous exaggeration often found in commentary."
    },
    {
        "meme": "我怎么笑了",
        "example_sentence": "我怎么笑了，明明应该哭的。",
        "meaning": "An expression of confusion about finding humor in a situation that is usually serious.",
        "source": "Commonly used in ironic or self-deprecating humor."
    }
]