[
    {
        "meme": "哈哈哈哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈 我笑死了我",
        "meaning": "An expression of extreme laughter, often used to convey amusement or joy in a humorous context.",
        "source": "Commonly used in Chinese online communities, particularly on platforms like Bilibili."
    },
    {
        "meme": "QAQ",
        "example_sentence": "很遗憾在这种情况下认识你QAQ",
        "meaning": "Represents a sad or disappointed face, often used to express feelings of regret or sorrow.",
        "source": "Originates from emoticons popular in East Asian online communities."
    },
    {
        "meme": "用头撞桌子*34",
        "example_sentence": "用头撞桌子*34",
        "meaning": "A humorous way to express frustration or disbelief, often used in response to something outrageous.",
        "source": "Commonly used in online comment sections to exaggerate a reaction."
    },
    {
        "meme": "这句大实话",
        "example_sentence": "这句大实话",
        "meaning": "Used to affirm the truthfulness of a statement, often in a sarcastic or ironic manner.",
        "source": "Popular in various online discussions to highlight blunt honesty."
    },
    {
        "meme": "哥 你太勇了",
        "example_sentence": "哥 你太勇了",
        "meaning": "A phrase used to commend someone for their bravery or boldness, often with a humorous undertone.",
        "source": "Commonly used in online gaming and streaming contexts."
    },
    {
        "meme": "太压抑这段",
        "example_sentence": "太压抑这段",
        "meaning": "Used to describe content that is emotionally heavy or difficult to watch.",
        "source": "Often seen in response to dramatic or intense scenes in videos."
    },
    {
        "meme": "我去！！",
        "example_sentence": "我去！！",
        "meaning": "An expression of surprise or shock, often used when something unexpected happens.",
        "source": "A common phrase in Chinese internet slang."
    },
    {
        "meme": "哈哈哈哈绝了",
        "example_sentence": "哈哈哈哈哈哈哈绝了 消消乐",
        "meaning": "Used to express that something is exceptionally funny or entertaining.",
        "source": "Popular in various online comment sections to convey amusement."
    },
    {
        "meme": "出现了！橘子爷爷定律",
        "example_sentence": "出现了！橘子爷爷定律",
        "meaning": "Refers to a humorous or unexpected occurrence, often used to signify a surprising turn of events.",
        "source": "Originates from a meme or inside joke within the community."
    },
    {
        "meme": "一口气没上来",
        "example_sentence": "一口气没上来",
        "meaning": "Used to describe a situation where one is overwhelmed or unable to process something quickly.",
        "source": "Commonly used in reaction to surprising or shocking content."
    },
    {
        "meme": "我爱英语！！！！",
        "example_sentence": "我爱英语！！！！",
        "meaning": "An exaggerated expression of enthusiasm for English, often used humorously.",
        "source": "Commonly seen in comments related to language learning or English content."
    },
    {
        "meme": "这玩意哈哈哈哈哈",
        "example_sentence": "这玩意哈哈哈哈哈",
        "meaning": "Used to express laughter at something absurd or ridiculous.",
        "source": "A typical reaction in online comment sections to humorous content."
    },
    {
        "meme": "我的心是冰冰的！！！！！！！",
        "example_sentence": "我的心是冰冰的！！！！！！！",
        "meaning": "An exaggerated expression of feeling cold-hearted or emotionally numb.",
        "source": "Often used in a humorous or dramatic context online."
    },
    {
        "meme": "我去这个播放量！！！",
        "example_sentence": "我去这个播放量！！！",
        "meaning": "An expression of astonishment regarding the popularity or view count of a video.",
        "source": "Commonly used in reaction to viral content."
    },
    {
        "meme": "哈哈回归主线！",
        "example_sentence": "哈哈回归主线！",
        "meaning": "Used to indicate a return to the main topic after a humorous or off-topic diversion.",
        "source": "Commonly seen in discussions or comment threads that veer off-topic."
    },
    {
        "meme": "艹，没绷住",
        "example_sentence": "艹，没绷住",
        "meaning": "An expression of losing composure or reacting strongly to something.",
        "source": "Common in online communities to express a breakdown in restraint."
    },
    {
        "meme": "我一直提倡论迹不论心",
        "example_sentence": "我一直提倡论迹不论心，如果真的帮助到了有需要的人，那就是好的",
        "meaning": "A philosophical statement emphasizing actions over intentions.",
        "source": "Often used in discussions about morality and ethics in online forums."
    }
]