[
    {
        "meme": "这是我10块钱就能看到的？比电影好看",
        "example_sentence": "我去，居然花10块钱就能看到这么精彩的内容，真是比电影还好看！",
        "meaning": "Used to express surprise at the high quality of something that was inexpensive, often with a humorous undertone.",
        "source": "Common phrase in online reviews and comments."
    },
    {
        "meme": "卧槽，惊到了",
        "example_sentence": "看到这段视频的结尾，卧槽，惊到了！",
        "meaning": "An expression of shock or surprise, often used to emphasize a strong reaction.",
        "source": "Popular slang in Chinese social media."
    },
    {
        "meme": "我草，纯冰！！！！",
        "example_sentence": "这冰淇淋的味道太好，我草，纯冰！！！！",
        "meaning": "An exclamation of excitement or amazement, often used to express strong appreciation.",
        "source": "Common in casual online conversations."
    },
    {
        "meme": "一字值千金！",
        "example_sentence": "这句话真是一字值千金！",
        "meaning": "Indicates that a particular statement or piece of advice is extremely valuable.",
        "source": "Traditional Chinese saying adapted for modern usage."
    },
    {
        "meme": "哈哈哈哈哈绝了",
        "example_sentence": "这段视频太搞笑了，哈哈哈哈哈绝了！",
        "meaning": "Used to express that something is extremely funny or impressive.",
        "source": "Common laughter expression in online comments."
    },
    {
        "meme": "这压抑个p啊",
        "example_sentence": "这场景根本没有压抑，反而很欢乐，这压抑个p啊！",
        "meaning": "Used to dismiss claims of negativity or oppression, suggesting that the situation is actually positive.",
        "source": "Informal speech pattern in online discussions."
    },
    {
        "meme": "2024年了回顾一下",
        "example_sentence": "2024年了回顾一下，这些变化真是令人感慨。",
        "meaning": "A phrase used to prompt reflection on past events, often used at the end of the year.",
        "source": "Commonly seen in year-end summaries and retrospectives."
    },
    {
        "meme": "你指尖跃动的电光，是我此生不变的信仰",
        "example_sentence": "这首歌的歌词真是打动人心，你指尖跃动的电光，是我此生不变的信仰。",
        "meaning": "A poetic expression indicating deep admiration or devotion, often used in romantic contexts.",
        "source": "Lyrics from popular songs, adapted for online use."
    },
    {
        "meme": "第一根了 第三根",
        "example_sentence": "这不是第一根了，而是第三根！",
        "meaning": "Used to humorously point out a contradiction or confusion in a situation.",
        "source": "Common in playful banter in online comments."
    },
    {
        "meme": "你确定你吃的是面吗？",
        "example_sentence": "看到你这个汤面，真怀疑你确定你吃的是面吗？",
        "meaning": "A sarcastic remark questioning the identity of something, often used when something looks unexpected.",
        "source": "Common phrase in food-related discussions."
    },
    {
        "meme": "我草，纯冰！！！！",
        "example_sentence": "这冰淇淋的味道太好，我草，纯冰！！！！",
        "meaning": "An exclamation of excitement or amazement, often used to express strong appreciation.",
        "source": "Common in casual online conversations."
    },
    {
        "meme": "2024的在这里!!!这里这里",
        "example_sentence": "2024的在这里!!!这里这里，期待新的一年！",
        "meaning": "Used to express enthusiasm about the future or upcoming events.",
        "source": "Commonly used in countdowns or future predictions."
    },
    {
        "meme": "绝了，这里养的动物也都是一只一只的",
        "example_sentence": "这动物园真不错，绝了，这里养的动物也都是一只一只的。",
        "meaning": "Used to emphasize the uniqueness or exceptional quality of something.",
        "source": "Casual conversational style in online comments."
    },
    {
        "meme": "这段反复穿插的塔挺有意思得",
        "example_sentence": "这段视频的剪辑手法很有趣，这段反复穿插的塔挺有意思得。",
        "meaning": "Used to highlight the cleverness or creativity in storytelling or editing.",
        "source": "Common in discussions about media and content creation."
    }
]