[
    {
        "meme": "爱爱爱爱爱爱爱爱",
        "example_sentence": "我好爱啊啊啊: '爱爱爱爱爱爱爱爱'",
        "meaning": "Expresses overwhelming affection or excitement, often in a humorous or exaggerated way.",
        "source": "Commonly used in various online communities to convey strong emotions."
    },
    {
        "meme": "这是什么个离大谱",
        "example_sentence": "看到这个结果，我真是想说: '这是什么个离大谱'",
        "meaning": "Used to express disbelief or confusion about a situation that seems absurd or unexpected.",
        "source": "A phrase that has become popular in online discussions, particularly in humorous contexts."
    },
    {
        "meme": "草，老熟人了",
        "example_sentence": "看到这个人，我忍不住说: '草，老熟人了'",
        "meaning": "A casual expression of recognition, often used humorously when encountering someone familiar.",
        "source": "Slang commonly used in Chinese online communities."
    },
    {
        "meme": "噩梦开始的地方",
        "example_sentence": "这段剧情让我觉得: '噩梦开始的地方'",
        "meaning": "Refers to a situation or moment that signals the beginning of something bad or chaotic.",
        "source": "A phrase frequently used in commentary on dramatic or horror content."
    },
    {
        "meme": "666666666666666666666666",
        "example_sentence": "这个操作真是太厉害了，666666666666666666666666",
        "meaning": "Used to express admiration or approval, similar to 'awesome' or 'cool'.",
        "source": "The number '6' is considered lucky in Chinese culture, often used in online slang."
    },
    {
        "meme": "我去我大了",
        "example_sentence": "看到这个数据，我只能说: '我去我大了'",
        "meaning": "An expression of surprise or shock, typically when something exceeds expectations.",
        "source": "Commonly used in online chats and comments."
    },
    {
        "meme": "心…在滴血啊啊啊",
        "example_sentence": "看到这种悲剧，我的心: '心…在滴血啊啊啊'",
        "meaning": "Conveys deep emotional pain or sadness, often in a dramatic or exaggerated manner.",
        "source": "A phrase popularized in various emotional online contexts."
    },
    {
        "meme": "我擦，这个有点辣眼睛",
        "example_sentence": "这个画面真是: '我擦，这个有点辣眼睛'",
        "meaning": "Used to describe something visually shocking or hard to look at.",
        "source": "Commonly used in reactions to unexpected or intense visuals."
    },
    {
        "meme": "让我们说中文？？？哈哈哈哥们你来真的啊",
        "example_sentence": "看到这个外语内容，我忍不住说: '让我们说中文？？？哈哈哈哥们你来真的啊'",
        "meaning": "A humorous way to address someone speaking in a different language, emphasizing the absurdity of the situation.",
        "source": "Often used in multilingual interactions online."
    },
    {
        "meme": "真·梦开始的地方",
        "example_sentence": "这部作品让我感受到: '真·梦开始的地方'",
        "meaning": "Indicates a moment of realization or inspiration, often in a positive context.",
        "source": "A phrase that plays on the idea of dreams and aspirations in storytelling."
    },
    {
        "meme": "每个人认识自己，认识世界的轨迹不一样",
        "example_sentence": "在讨论中，我提到: '每个人认识自己，认识世界的轨迹不一样'",
        "meaning": "Reflects the idea that everyone has their unique perspective and journey in life.",
        "source": "Philosophical expression that resonates in discussions about identity and experiences."
    },
    {
        "meme": "我好爱啊啊啊",
        "example_sentence": "看到这个角色，我只能说: '我好爱啊啊啊'",
        "meaning": "An expression of strong affection or admiration, often used in fandom contexts.",
        "source": "Common in fan communities to convey enthusiasm."
    },
    {
        "meme": "这句话真的很爽",
        "example_sentence": "听到这段话，我感觉: '这句话真的很爽'",
        "meaning": "Used to express pleasure or satisfaction with something heard or experienced.",
        "source": "A common phrase in discussions about impactful statements."
    },
    {
        "meme": "我去",
        "example_sentence": "看到这个结果，我只能说: '我去'",
        "meaning": "An expression of surprise or disbelief, often used in a casual context.",
        "source": "A widely used phrase in online conversations."
    },
    {
        "meme": "我会永远守护着你！",
        "example_sentence": "在感人的时刻，我发誓: '我会永远守护着你！'",
        "meaning": "A declaration of loyalty or commitment, often used in emotional contexts.",
        "source": "Commonly found in romantic or dramatic narratives."
    }
]