[
    {
        "meme": "多玛姆，我是来谈判的",
        "example_sentence": "多玛姆，我是来谈判的，结果却被拒绝了。",
        "meaning": "A humorous reference to a situation where someone is trying to negotiate or resolve an issue but is met with resistance.",
        "source": "A line from the Marvel movie 'Doctor Strange' (2016)"
    },
    {
        "meme": "666",
        "example_sentence": "这场比赛真精彩，666！",
        "meaning": "Expresses admiration or approval, often used to signify something impressive or cool.",
        "source": "Chinese online gaming and streaming culture, where '666' is used to praise skillful actions."
    },
    {
        "meme": "开大！开大！",
        "example_sentence": "在关键时刻，队友喊：'开大！开大！'",
        "meaning": "A gaming term urging a player to use their ultimate ability, often in a critical moment.",
        "source": "Commonly used in multiplayer online games like 'League of Legends'."
    },
    {
        "meme": "先投币再观看",
        "example_sentence": "每次看视频都要记得，先投币再观看。",
        "meaning": "A reminder to support content creators by donating or subscribing before enjoying their content.",
        "source": "A common phrase on Bilibili to encourage tipping."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，这个剧情反转太强了！",
        "meaning": "An exclamation of surprise or shock, often used to express strong emotions.",
        "source": "A common expression in Chinese internet slang."
    },
    {
        "meme": "哈哈哈哈哈哈",
        "example_sentence": "看完这个视频我只能哈哈哈哈哈哈。",
        "meaning": "Used to indicate laughter, often in response to something humorous.",
        "source": "A standard expression of laughter in online conversations."
    },
    {
        "meme": "呜呜小潮兔牙好可爱",
        "example_sentence": "呜呜小潮兔牙好可爱，真想抱回家！",
        "meaning": "A cute expression used to convey affection or admiration for someone or something adorable.",
        "source": "A phrase popularized by fans of the character '小潮' (Little Tide) from Bilibili."
    },
    {
        "meme": "像喝醉了",
        "example_sentence": "他今天的状态真奇怪，像喝醉了。",
        "meaning": "Used to describe someone acting unusually or erratically, similar to being intoxicated.",
        "source": "A colloquial expression in Chinese."
    },
    {
        "meme": "强健美利坚",
        "example_sentence": "在比赛中，他的表现真是强健美利坚！",
        "meaning": "A phrase used to express admiration for strength or excellence, often in a humorous context.",
        "source": "A play on words referencing American strength and resilience."
    },
    {
        "meme": "牛逼",
        "example_sentence": "他的技术真牛逼，简直是大神！",
        "meaning": "A slang term meaning 'awesome' or 'impressive', used to praise someone's skills or achievements.",
        "source": "A common term in Chinese internet slang."
    },
    {
        "meme": "这镜头语言太绝了",
        "example_sentence": "这部电影的镜头语言太绝了，让我感动不已。",
        "meaning": "Used to praise the cinematographic techniques used in a film or video, indicating high artistic quality.",
        "source": "Commonly used among film enthusiasts."
    },
    {
        "meme": "欢迎来到食贫道大电影",
        "example_sentence": "欢迎来到食贫道大电影，今天我们要讲述一个感人的故事。",
        "meaning": "A playful introduction often used in videos or streams to set the tone for the content.",
        "source": "A catchphrase from the creator known as '食贫道'."
    },
    {
        "meme": "我的天，有时自己觉得理所当然的东西，居然~~~我蒙了",
        "example_sentence": "我的天，有时自己觉得理所当然的东西，居然~~~我蒙了，这种事居然发生了。",
        "meaning": "Expresses disbelief or shock at realizing something unexpected, often humorously.",
        "source": "A common expression in online discussions."
    },
    {
        "meme": "这给我从二四年干到哪了",
        "example_sentence": "这任务真是难，感觉这给我从二四年干到哪了。",
        "meaning": "Used to humorously exaggerate the length of time or effort required for a task.",
        "source": "A humorous take on the difficulty of tasks in online culture."
    },
    {
        "meme": "一看男孩子",
        "example_sentence": "一看男孩子，果然长得帅气。",
        "meaning": "A phrase used to comment on someone's appearance, often implying attractiveness.",
        "source": "A common expression in social media contexts."
    },
    {
        "meme": "好可爱！！！",
        "example_sentence": "这个小猫咪真好可爱！！！",
        "meaning": "An enthusiastic expression of affection for something cute.",
        "source": "Commonly used in online comments and social media."
    },
    {
        "meme": "这什么鬼填词啊啊啊",
        "example_sentence": "这什么鬼填词啊啊啊，太搞笑了！",
        "meaning": "Expresses confusion or disbelief at something absurd, often in a humorous context.",
        "source": "An expression popularized in comedic contexts."
    },
    {
        "meme": "每年芒种我都会听亿遍的",
        "example_sentence": "每年芒种我都会听亿遍的，这首歌太好听了。",
        "meaning": "Indicates a strong fondness for a song or content that is repeatedly enjoyed.",
        "source": "A common phrase in music appreciation contexts."
    },
    {
        "meme": "我勒个起死回生啊",
        "example_sentence": "我勒个起死回生啊，这剧情太反转了！",
        "meaning": "Expresses shock or amazement at a surprising twist, often humorously.",
        "source": "A humorous expression in response to unexpected plot developments."
    }
]