[
    {
        "meme": "太酷了",
        "example_sentence": "太酷了，太酷了，太酷了，太酷了，太酷了，太酷了，酷",
        "meaning": "An expression of extreme excitement or admiration, often used to emphasize how impressive something is.",
        "source": "Common phrase in Chinese internet culture, often repeated for emphasis."
    },
    {
        "meme": "勇敢的爷爷们",
        "example_sentence": "勇敢的爷爷们！！！！",
        "meaning": "Used to show admiration or support for the older generation, often in a humorous or exaggerated way.",
        "source": "Popularized in various online communities as a way to show respect."
    },
    {
        "meme": "吸吸吸吸吸",
        "example_sentence": "吸吸吸吸吸",
        "meaning": "A playful or humorous way to express excitement or anticipation, often associated with a desire for something enjoyable.",
        "source": "Commonly used in online gaming and streaming contexts."
    },
    {
        "meme": "爱爱爱爱爱爱爱爱",
        "example_sentence": "爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱",
        "meaning": "An exaggerated expression of love or affection, often used humorously or to mock over-the-top romantic sentiments.",
        "source": "Common in online discussions and social media posts."
    },
    {
        "meme": "我XJS到此一游",
        "example_sentence": "我XJS到此一游！",
        "meaning": "A humorous way to announce one's presence or participation in a discussion or event, often used sarcastically.",
        "source": "Derived from online gaming and social media contexts."
    },
    {
        "meme": "小萌姐好像只会出剪刀呀",
        "example_sentence": "感觉小萌姐好像只会出剪刀呀。",
        "meaning": "A playful jab at someone perceived as predictable or limited in their choices or actions.",
        "source": "Common in discussions around games like Rock-Paper-Scissors."
    },
    {
        "meme": "注意！注意！认知滤网即将失效！",
        "example_sentence": "注意！注意！认知滤网即将失效！",
        "meaning": "A humorous warning about the collapse of logical reasoning or understanding in a discussion.",
        "source": "Often used in debates or arguments online."
    },
    {
        "meme": "这人真是很吓人",
        "example_sentence": "这人真是很吓人。",
        "meaning": "Used to describe someone or something that is intimidating or surprising, often in a comedic context.",
        "source": "Common in humorous commentary on social media."
    },
    {
        "meme": "全 部 木 大",
        "example_sentence": "全 部 木 大",
        "meaning": "An expression used to mock or highlight something that is excessively exaggerated or ridiculous.",
        "source": "Originates from various online memes and humorous commentary."
    },
    {
        "meme": "哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈哈哈哈",
        "meaning": "An exaggerated form of laughter used to express amusement or mockery.",
        "source": "Common in online chats and comments."
    },
    {
        "meme": "我勒个绝对音感啊",
        "example_sentence": "我勒个绝对音感啊。",
        "meaning": "Used to express surprise or admiration for someone's talent, often in a humorous or exaggerated way.",
        "source": "Commonly used in music-related discussions."
    },
    {
        "meme": "这玩意不都是袋装的么又不是现做的",
        "example_sentence": "这玩意不都是袋装的么又不是现做的。",
        "meaning": "A sarcastic remark questioning the authenticity or quality of something, often used in food discussions.",
        "source": "Common in consumer culture discussions."
    },
    {
        "meme": "我能看到画面了！",
        "example_sentence": "我能看到画面了！你们懒了！",
        "meaning": "Used to express realization or clarity in a situation, often in a humorous or sarcastic context.",
        "source": "Commonly used in reaction to confusing or chaotic situations."
    },
    {
        "meme": "我XJS",
        "example_sentence": "我XJS到此一游！",
        "meaning": "A humorous way to announce one's presence or participation in a discussion or event.",
        "source": "Derived from online gaming and social media contexts."
    },
    {
        "meme": "注意阿姨手上的塑料袋",
        "example_sentence": "注意阿姨手上的塑料袋。",
        "meaning": "A humorous or sarcastic comment drawing attention to something seemingly insignificant but potentially important.",
        "source": "Common in humorous commentary on everyday situations."
    },
    {
        "meme": "我嘞个头",
        "example_sentence": "我嘞个头。",
        "meaning": "An expression of disbelief or frustration, often used humorously.",
        "source": "Common in online discussions."
    }
]