[
    {
        "meme": "奥利奥",
        "example_sentence": "奥利奥奥利奥奥利奥奥利奥奥利奥奥利奥奥利奥奥利奥奥利奥。",
        "meaning": "Used as a playful repetition to express excitement or enthusiasm, often in a nonsensical context.",
        "source": "Originates from playful online banter and meme culture."
    },
    {
        "meme": "爱爱爱爱爱",
        "example_sentence": "爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱。",
        "meaning": "Exaggerated expression of affection or enthusiasm, often used humorously.",
        "source": "Commonly seen in various online communities as a way to emphasize excitement."
    },
    {
        "meme": "用头锤桌子*6",
        "example_sentence": "用头锤桌子*6，真是受不了这剧情了。",
        "meaning": "Expresses frustration or disbelief, often in a humorous manner, suggesting one is so overwhelmed they would resort to drastic measures.",
        "source": "Typical expression in response to absurd or frustrating content."
    },
    {
        "meme": "666",
        "example_sentence": "这段视频真不错，666！",
        "meaning": "A way to express approval or admiration, similar to 'awesome' or 'cool'.",
        "source": "Popularized in Chinese online gaming communities."
    },
    {
        "meme": "哈哈哈哈哈",
        "example_sentence": "看到这个我笑到不行，哈哈哈哈哈。",
        "meaning": "Indicates laughter and amusement, often used to emphasize how funny something is.",
        "source": "A common expression in online chats and comments."
    },
    {
        "meme": "这是柯P的党",
        "example_sentence": "这个政策真是太奇怪了，真是柯P的党。",
        "meaning": "Used to imply something is absurd or nonsensical, often referencing a specific political figure or event.",
        "source": "Refers to Taiwanese politician Ko Wen-je (柯文哲) and his party's controversial policies."
    },
    {
        "meme": "笑崩了",
        "example_sentence": "这段视频太搞笑了，我笑崩了。",
        "meaning": "Used to express that something is extremely funny, to the point of being overwhelmed.",
        "source": "Commonly used in online comments to describe humorous content."
    },
    {
        "meme": "我奶奶也这样做回收",
        "example_sentence": "这家店的环保措施真是太简单了，我奶奶也这样做回收。",
        "meaning": "Used sarcastically to point out that a practice is so basic or obvious that even an elder would know it.",
        "source": "A humorous way to criticize inadequate efforts in sustainability."
    },
    {
        "meme": "只要把安全标准数值定的够高，哪里都是安全的",
        "example_sentence": "这政策真是离谱，只要把安全标准数值定的够高，哪里都是安全的。",
        "meaning": "Critiques unrealistic safety standards or regulations, suggesting that they are merely for show.",
        "source": "A common satirical comment on bureaucratic measures."
    },
    {
        "meme": "这就是后现代艺术吗",
        "example_sentence": "看完这个视频，我在想：这就是后现代艺术吗？",
        "meaning": "Used to question the validity or absurdity of something presented as art or culture.",
        "source": "A reflection on contemporary art and cultural expressions."
    },
    {
        "meme": "温州诡异天气",
        "example_sentence": "今天的天气真是温州诡异天气，完全不科学。",
        "meaning": "References unusual or unexpected weather patterns, often used humorously.",
        "source": "A meme that highlights the unpredictability of weather in certain regions."
    }
]