[
    {
        "meme": "哈哈哈",
        "example_sentence": "上树那个玩原神玩的哈哈哈",
        "meaning": "An expression of laughter or amusement, commonly used in online comments to indicate humor.",
        "source": "General internet slang on platforms like Bilibili."
    },
    {
        "meme": "我勒个中国院长（doge）",
        "example_sentence": "我勒个中国院长（doge）",
        "meaning": "An expression of surprise or disbelief, often used humorously; 'doge' refers to the popular meme featuring a Shiba Inu.",
        "source": "The 'doge' meme, which originated from a Shiba Inu photo in 2013."
    },
    {
        "meme": "一上来就要开大了",
        "example_sentence": "一上来就要开大了",
        "meaning": "A phrase indicating someone is eager to take decisive action or make a significant move right away.",
        "source": "Common gaming terminology, especially in multiplayer games."
    },
    {
        "meme": "我才知道已经这么严重了嘛 真的有些难受啊",
        "example_sentence": "我才知道已经这么严重了嘛 真的有些难受啊",
        "meaning": "Used to express a realization of the gravity of a situation, often accompanied by a sense of discomfort or sadness.",
        "source": "Common expression in emotional or serious contexts."
    },
    {
        "meme": "社工飘过",
        "example_sentence": "社工飘过",
        "meaning": "A humorous way to indicate that someone is just passing by or observing without engaging.",
        "source": "Online culture where users comment on their presence without direct involvement."
    },
    {
        "meme": "这才是真恐怖",
        "example_sentence": "这才是真恐怖",
        "meaning": "Used to describe something genuinely frightening or shocking, often in a humorous context.",
        "source": "General commentary style in horror or suspense discussions."
    },
    {
        "meme": "力力！",
        "example_sentence": "力力！",
        "meaning": "An expression of excitement or encouragement, often used in a playful context.",
        "source": "Commonly used in online gaming or fan communities."
    },
    {
        "meme": "每周必看是怎么回事",
        "example_sentence": "每周必看是怎么回事",
        "meaning": "A phrase expressing surprise or curiosity about something that is highly recommended to watch weekly.",
        "source": "Common in discussions about popular series or shows."
    },
    {
        "meme": "笑成大奋了",
        "example_sentence": "哈哈哈哈哈笑成大奋了",
        "meaning": "Used to indicate that something is extremely funny, to the point of overwhelming laughter.",
        "source": "A playful exaggeration of humor."
    },
    {
        "meme": "这不是你自己惹的祸么？",
        "example_sentence": "这不是你自己惹的祸么？",
        "meaning": "A rhetorical question implying that someone is responsible for their own troubles.",
        "source": "Common in conversations where accountability is discussed."
    },
    {
        "meme": "哇！！！！！！！！！！！！！！！！！",
        "example_sentence": "哇！！！！！！！！！！！！！！！！！",
        "meaning": "An exaggerated expression of surprise or excitement, often used in reactions.",
        "source": "Common in online comments for dramatic effect."
    },
    {
        "meme": "好燃",
        "example_sentence": "好燃",
        "meaning": "An expression of excitement or enthusiasm, often used in response to something inspiring or thrilling.",
        "source": "Common in fan communities and discussions about exciting content."
    },
    {
        "meme": "我听到了替罪的回响",
        "example_sentence": "我听到了替罪的回响",
        "meaning": "A poetic way to express a feeling of guilt or the consequences of one's actions being echoed back.",
        "source": "Literary expression used in emotional or reflective contexts."
    },
    {
        "meme": "我超",
        "example_sentence": "我超，太爽了",
        "meaning": "An expression of extreme excitement or satisfaction.",
        "source": "Common in youth slang and online communities."
    },
    {
        "meme": "66666666666",
        "example_sentence": "66666666666",
        "meaning": "A way to express admiration or approval, similar to saying 'awesome' or 'great'.",
        "source": "A popular numeric meme in Chinese internet culture."
    },
    {
        "meme": "这可怕的收藏数",
        "example_sentence": "这可怕的收藏数",
        "meaning": "Used to comment on an unexpectedly high or alarming number of collections or views.",
        "source": "Common in discussions about content popularity."
    },
    {
        "meme": "我的冰冰",
        "example_sentence": "我的冰冰",
        "meaning": "A term of endearment or affection, often used humorously.",
        "source": "Common in online communities to refer to someone beloved."
    },
    {
        "meme": "这不是莎莎舞",
        "example_sentence": "这不是莎莎舞",
        "meaning": "Used to comment on something that is not what it seems or is misrepresented.",
        "source": "Common in discussions about dance or performance."
    },
    {
        "meme": "我皇冠！",
        "example_sentence": "我皇冠！",
        "meaning": "A playful expression of pride or achievement, often used in a humorous context.",
        "source": "Common in gaming and competitive settings."
    }
]