[
    {
        "meme": "yyds",
        "example_sentence": "伊丽莎白鼠鬼畜区yyds",
        "meaning": "An acronym for '永远的神' (forever God), used to express admiration or idolization.",
        "source": "Originated from online fandom culture in China."
    },
    {
        "meme": "666",
        "example_sentence": "666高斯切未来了",
        "meaning": "Used to express approval or admiration, similar to saying 'awesome' or 'cool'.",
        "source": "Commonly used in Chinese gaming and streaming communities."
    },
    {
        "meme": "哈哈哈哈",
        "example_sentence": "啊啊啊啊啊啊啊啊啊啊啊啊啊啊哈哈哈哈哈哈哈哈哈哈哈哈哈哈啊啊啊啊啊啊啊啊啊啊啊啊啊啊",
        "meaning": "Expresses extreme laughter or amusement, often used to convey a humorous reaction.",
        "source": "A typical expression in Chinese internet slang."
    },
    {
        "meme": "doge",
        "example_sentence": "怎么感觉辣么可爱（doge",
        "meaning": "Refers to the Doge meme, used to express cuteness or humor in a light-hearted way.",
        "source": "Originated from the Doge meme featuring a Shiba Inu."
    },
    {
        "meme": "牛逼",
        "example_sentence": "牛逼!!真不是一般人",
        "meaning": "Used to describe someone or something as impressive or amazing.",
        "source": "A common slang term in Chinese culture."
    },
    {
        "meme": "三连",
        "example_sentence": "三连起来，让这个视频在首页更久一些",
        "meaning": "Refers to the act of liking, commenting, and subscribing, often used to encourage engagement.",
        "source": "Common in online video platforms to boost content visibility."
    },
    {
        "meme": "第一次充电",
        "example_sentence": "第一次充电纪念",
        "meaning": "Refers to the first time something is experienced or used, often used humorously.",
        "source": "Used in various contexts, especially in gaming and fandoms."
    },
    {
        "meme": "曲终人散",
        "example_sentence": "曲终人散",
        "meaning": "Literally 'the music ends, and people disperse', used to describe the end of an event or gathering.",
        "source": "A phrase from classical Chinese literature."
    },
    {
        "meme": "阿巴阿巴",
        "example_sentence": "阿巴阿巴",
        "meaning": "A playful expression, often used to convey excitement or confusion.",
        "source": "Popularized in various online communities."
    },
    {
        "meme": "我天",
        "example_sentence": "我天，有一种叠羊刀一般的爽感",
        "meaning": "An exclamation expressing surprise or amazement.",
        "source": "Common in everyday conversation and online chats."
    },
    {
        "meme": "吃瓜",
        "example_sentence": "吃瓜吃到自己家。",
        "meaning": "Literally 'eating melon', used to refer to being a bystander to gossip or drama.",
        "source": "Originated from internet slang related to observing online events."
    },
    {
        "meme": "默剧",
        "example_sentence": "默            剧",
        "meaning": "Refers to a silent performance, used humorously to imply a lack of communication or action.",
        "source": "Derived from theatrical terminology."
    },
    {
        "meme": "一切都是show",
        "example_sentence": "一切都是show",
        "meaning": "Everything is a performance, often used to describe situations that feel staged or artificial.",
        "source": "Common phrase in entertainment contexts."
    },
    {
        "meme": "绝了",
        "example_sentence": "绝了!!!!!",
        "meaning": "Used to express astonishment or admiration, similar to saying 'amazing' or 'incredible'.",
        "source": "A popular slang term in Chinese internet culture."
    },
    {
        "meme": "哈哈哈",
        "example_sentence": "哈哈哈哈回家",
        "meaning": "Used to express laughter, often in response to something funny.",
        "source": "A common expression in online interactions."
    },
    {
        "meme": "我靠",
        "example_sentence": "我靠何同学！！",
        "meaning": "An exclamation of surprise or disbelief, similar to 'OMG' or 'wow'.",
        "source": "A widely used expression in Chinese slang."
    },
    {
        "meme": "冷知识",
        "example_sentence": "冷知识，晚清抽得没这么厉害",
        "meaning": "Refers to interesting but obscure facts, often shared for amusement.",
        "source": "Commonly used in educational or humorous contexts."
    },
    {
        "meme": "无主之城",
        "example_sentence": "无主之城太像了",
        "meaning": "Refers to a place that feels abandoned or ungoverned, often used metaphorically.",
        "source": "Derived from literature or gaming contexts."
    },
    {
        "meme": "我就是靠大学贷款完成学业的",
        "example_sentence": "我就是靠大学贷款完成学业的，读本科和继续读研究生期间都是无息的",
        "meaning": "Used to describe the experience of relying on loans for education, often with a tone of sarcasm or irony.",
        "source": "Common in discussions about education and finance."
    }
]