[
    {
        "meme": "66666",
        "example_sentence": "哈哈哈哈哈哈 66666",
        "meaning": "Used to express admiration or appreciation, often in response to something impressive or entertaining.",
        "source": "Commonly used in Chinese online communities, particularly in live streaming and gaming."
    },
    {
        "meme": "牛逼啊！",
        "example_sentence": "牛逼啊！这段剪辑绝了。",
        "meaning": "An expression of strong approval or admiration, akin to saying 'awesome' or 'amazing.'",
        "source": "A popular slang term in Chinese internet culture."
    },
    {
        "meme": "狗头",
        "example_sentence": "朱苏杭你学学人家(doge)",
        "meaning": "Refers to a playful or sarcastic tone, often used to imply that someone is being silly or ridiculous.",
        "source": "Derived from the 'doge' meme, which features a Shiba Inu dog."
    },
    {
        "meme": "心中有佛，怕你______",
        "example_sentence": "心中有佛，怕你______",
        "meaning": "Used to express confidence or fearlessness in a humorous context.",
        "source": "A phrase that plays on a common saying, often used in memes."
    },
    {
        "meme": "一字千金",
        "example_sentence": "这句话真是一字千金。",
        "meaning": "Literally 'a word is worth a thousand gold,' used to emphasize the value of a statement.",
        "source": "A traditional Chinese saying."
    },
    {
        "meme": "黑化 黑化 黑化",
        "example_sentence": "黑化 黑化 黑化 黑化 黑化 黑化 黑化 黑化",
        "meaning": "Repeated for emphasis, indicating a transformation into a darker or more serious persona.",
        "source": "Commonly used in fan communities, particularly in anime and gaming contexts."
    },
    {
        "meme": "我靠",
        "example_sentence": "我靠，太牛了！",
        "meaning": "An expression of surprise or disbelief, similar to saying 'wow' or 'no way.'",
        "source": "A widely used exclamation in Chinese slang."
    },
    {
        "meme": "压强",
        "example_sentence": "压强，这个概念真有趣。",
        "meaning": "Used to refer to pressure, but in a humorous context, it may imply feeling overwhelmed.",
        "source": "Scientific term, often used in memes to create humorous contexts."
    },
    {
        "meme": "绝了",
        "example_sentence": "这个剪辑绝了！",
        "meaning": "An expression of strong admiration, meaning 'it's amazing' or 'it's incredible.'",
        "source": "Commonly used in online discussions to express enthusiasm."
    },
    {
        "meme": "哈哈哈",
        "example_sentence": "哈哈哈，真是太搞笑了！",
        "meaning": "Used to indicate laughter or amusement.",
        "source": "A universal expression of laughter in online communication."
    },
    {
        "meme": "这怎么荒诞了圈子不同而已",
        "example_sentence": "这怎么荒诞了圈子不同而已。",
        "meaning": "Used to comment on absurdity, suggesting that the situation is not truly absurd but rather a matter of perspective.",
        "source": "Reflects a common sentiment in discussions about differing viewpoints."
    },
    {
        "meme": "大佬",
        "example_sentence": "尊称您一声大佬。",
        "meaning": "A term of respect or admiration for someone who is skilled or knowledgeable.",
        "source": "Commonly used in online communities to refer to experienced individuals."
    },
    {
        "meme": "我去",
        "example_sentence": "我去，这个真是太夸张了！",
        "meaning": "An exclamation of surprise or disbelief, similar to saying 'oh my god.'",
        "source": "A frequently used expression in Chinese online slang."
    },
    {
        "meme": "前方核能 WARNING",
        "example_sentence": "░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░前方核能 WARNING WARNING WARNING",
        "meaning": "Used humorously to indicate an impending or serious situation, often exaggerated.",
        "source": "A meme format that plays on the idea of urgent warnings."
    },
    {
        "meme": "再英雄一杯毒酒赐你死亡",
        "example_sentence": "再英雄一杯毒酒赐你死亡。",
        "meaning": "A dramatic expression often used in gaming or storytelling contexts to convey a sense of finality or challenge.",
        "source": "Derived from dramatic narratives in games or literature."
    },
    {
        "meme": "hahaha",
        "example_sentence": "hahaha, 这个笑话太好笑了！",
        "meaning": "An expression of laughter, often used to indicate something is funny.",
        "source": "A common online expression of amusement."
    }
]