[
    {
        "meme": "光荣墙（bushi）",
        "example_sentence": "光荣墙（bushi）",
        "meaning": "Used to ironically refer to something that is not truly glorious, often in a humorous or sarcastic context.",
        "source": "Internet slang, often used in Chinese online communities."
    },
    {
        "meme": "爷青回",
        "example_sentence": "第一次看还是在初中！爷青回！",
        "meaning": "A nostalgic expression meaning 'return of youth,' used when something reminds one of their younger days.",
        "source": "Commonly used in Chinese online culture to express nostalgia."
    },
    {
        "meme": "我来这里只为三件事",
        "example_sentence": "我来这里只为三件事",
        "meaning": "A humorous way to emphasize that one has specific intentions or goals, often used in a joking manner.",
        "source": "A phrase popularized in various memes and online discussions."
    },
    {
        "meme": "白衣服战队",
        "example_sentence": "白衣服战队已经速通了一个小傲现在高斯也速通了",
        "meaning": "Refers to a specific group or team, often used to denote a sense of camaraderie or achievement.",
        "source": "Originates from gaming or competitive contexts."
    },
    {
        "meme": "双击",
        "example_sentence": "双击",
        "meaning": "A term used to express approval or excitement, often accompanied by a double tap action in online platforms.",
        "source": "Commonly seen in social media interactions."
    },
    {
        "meme": "666",
        "example_sentence": "666买复活甲了",
        "meaning": "An expression of admiration or approval, similar to saying 'awesome' or 'cool.'",
        "source": "Gaming slang popularized in Chinese online communities."
    },
    {
        "meme": "抽抽抽",
        "example_sentence": "抽抽抽",
        "meaning": "Used to express excitement or anticipation, often in a playful or light-hearted manner.",
        "source": "Commonly found in various online chat platforms."
    },
    {
        "meme": "你也牵着手，是左手牵右手",
        "example_sentence": "你也牵着手，是左手牵右手",
        "meaning": "A playful phrase that highlights simplicity or absurdity, often used humorously.",
        "source": "Originates from various internet memes."
    },
    {
        "meme": "我竟然刷到这个视频了",
        "example_sentence": "我竟然刷到这个视频了",
        "meaning": "Expresses surprise or disbelief at encountering unexpected content online.",
        "source": "Commonly used in reaction videos and comments."
    },
    {
        "meme": "这不就约嘛",
        "example_sentence": "这不就约嘛",
        "meaning": "Used to indicate that something is exactly as expected or arranged, often in a sarcastic tone.",
        "source": "Internet slang from online discussions."
    },
    {
        "meme": "阿姨又来了啊",
        "example_sentence": "阿姨又来了啊",
        "meaning": "A humorous way to refer to someone who frequently appears or is expected to show up.",
        "source": "A meme that has circulated in various online communities."
    },
    {
        "meme": "我不会化为尘土",
        "example_sentence": "我不会化为尘土",
        "meaning": "A poetic expression often used to convey resilience or determination.",
        "source": "Commonly found in online literature and poetry."
    },
    {
        "meme": "为了那个傻傻的放电妹",
        "example_sentence": "为了那个傻傻的放电妹",
        "meaning": "Used to express affection or admiration for a character or person, often in a lighthearted manner.",
        "source": "Originates from anime or gaming culture."
    },
    {
        "meme": "这就是典型自大的美国精英混蛋的样式吧",
        "example_sentence": "这就是典型自大的美国精英混蛋的样式吧",
        "meaning": "A critical remark about perceived arrogance in a specific group, often used humorously.",
        "source": "Political commentary common in online discussions."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽我大了",
        "meaning": "An exclamation of surprise or shock, often used in a humorous context.",
        "source": "Commonly used in Chinese online chat and gaming."
    },
    {
        "meme": "你调牛魔酬宾",
        "example_sentence": "你调牛魔酬宾",
        "meaning": "A humorous expression often used to tease someone about their actions or decisions.",
        "source": "Internet slang used in playful banter."
    },
    {
        "meme": "这失真有点逆天",
        "example_sentence": "这失真有点逆天",
        "meaning": "Used to describe something that is exceptionally good or impressive, often in a hyperbolic manner.",
        "source": "Commonly found in discussions about media or technology."
    },
    {
        "meme": "你们不会要去鬼村要饭吧？（害怕）",
        "example_sentence": "你们不会要去鬼村要饭吧？（害怕）",
        "meaning": "A humorous way to express concern or fear about a situation, often used in a lighthearted context.",
        "source": "Originates from horror-themed memes."
    },
    {
        "meme": "注意洗澡，蛋定打灰机",
        "example_sentence": "注意洗澡，蛋定打灰机",
        "meaning": "A humorous reminder to take care of oneself, often in a playful manner.",
        "source": "Internet slang used in casual conversations."
    }
]