[
    {
        "meme": "233333333333",
        "example_sentence": "看到这，我又在思考人生的意义了……哎，233333333333。",
        "meaning": "Used to express intense laughter, similar to 'LOL' or 'LMAO'.",
        "source": "Commonly used in Chinese online communities, derived from the number '233' which is associated with laughter."
    },
    {
        "meme": "太美的女人不好驾驭",
        "example_sentence": "太美的女人不好驾驭，又累。",
        "meaning": "Refers to the idea that very attractive people can be difficult to handle or manage in relationships.",
        "source": "Popularized in various online discussions and memes about beauty and relationships."
    },
    {
        "meme": "欧皇就是欧皇（doge）",
        "example_sentence": "在游戏中抽到稀有角色，真是：欧皇就是欧皇（doge）。",
        "meaning": "Refers to someone who is extremely lucky, especially in games or gambling contexts.",
        "source": "Originates from the 'Doge' meme, which features a Shiba Inu dog and is often used in humorous contexts."
    },
    {
        "meme": "一枪打出了地鸣",
        "example_sentence": "他在比赛中一发入魂，真是一枪打出了地鸣。",
        "meaning": "Describes a moment of extraordinary skill or impact, often used in gaming or sports contexts.",
        "source": "A phrase that has circulated in gaming communities, emphasizing dramatic moments."
    },
    {
        "meme": "跳伞15：00",
        "example_sentence": "大家准备好，跳伞15：00！",
        "meaning": "Refers to a specific time for an event, often used in gaming contexts where timing is crucial.",
        "source": "Common in gaming lingo, particularly in battle royale games."
    },
    {
        "meme": "高斯他太可爱了吧啊啊啊",
        "example_sentence": "看着高斯的表现，我忍不住说：高斯他太可爱了吧啊啊啊！",
        "meaning": "Expresses extreme affection or admiration for someone, often used in fandom contexts.",
        "source": "A phrase that has gained popularity in fandoms, particularly around characters in anime or games."
    },
    {
        "meme": "；；；；；；；；",
        "example_sentence": "我看完这个视频，感觉心情复杂；；；；；；；；。",
        "meaning": "Used to express a range of emotions, often confusion or mixed feelings.",
        "source": "A stylistic choice in online communication to emphasize emotional complexity."
    },
    {
        "meme": "爱爱爱爱爱",
        "example_sentence": "她对这部剧的热爱真是：爱爱爱爱爱。",
        "meaning": "Used to express overwhelming love or affection for something.",
        "source": "Common in fan culture, typically used in a playful or exaggerated manner."
    },
    {
        "meme": "我摖真魔幻",
        "example_sentence": "这场比赛我摖真魔幻，真是太不可思议了。",
        "meaning": "Expresses disbelief or amazement at a situation that seems surreal or unbelievable.",
        "source": "A phrase that has emerged in online discussions to convey shock or awe."
    },
    {
        "meme": "狗的命也是命",
        "example_sentence": "他总是这么不在乎别人的感受，真是：狗的命也是命。",
        "meaning": "Used to emphasize that all lives, even those of animals, are valuable.",
        "source": "A phrase that has circulated in discussions about empathy and animal rights."
    },
    {
        "meme": "我才看到是手机",
        "example_sentence": "在讨论中，大家都在说电脑，我才看到是手机。",
        "meaning": "Used to express a moment of realization or a humorous misunderstanding.",
        "source": "Commonly used in humorous contexts when someone misinterprets a situation."
    }
]