[
    {
        "meme": "飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞",
        "example_sentence": "我正在看这个视频，弹幕上全是‘飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞飞’。",
        "meaning": "Used to express excitement or a fast-paced situation, often in a humorous or exaggerated manner.",
        "source": "Commonly used in live streaming and gaming contexts to represent rapid action."
    },
    {
        "meme": "哈哈哈哈哈哈",
        "example_sentence": "看到这个搞笑的片段，我忍不住在弹幕上打下‘哈哈哈哈哈哈’。",
        "meaning": "Indicates laughter or amusement, often used to react to funny moments.",
        "source": "A universal expression of laughter in online communication."
    },
    {
        "meme": "注：",
        "example_sentence": "注：马哥鞋里有车钥匙。",
        "meaning": "Used to indicate an important note or additional information, often in a humorous context.",
        "source": "Commonly seen in various online discussions to highlight quirky or unexpected facts."
    },
    {
        "meme": "我（男）也喜欢过男生！嘻嘻",
        "example_sentence": "这段剧情让我想起了我（男）也喜欢过男生！嘻嘻。",
        "meaning": "Used to playfully express a nonchalant admission about personal preferences or experiences.",
        "source": "Reflects the playful and open nature of online identities and discussions."
    },
    {
        "meme": "就是本人，就是本人！",
        "example_sentence": "在这个视频里，他的表现真是太像我了，‘就是本人，就是本人！’",
        "meaning": "Used to emphasize identification with someone or something, often humorously.",
        "source": "Common in contexts where users relate strongly to a character or situation."
    },
    {
        "meme": "老——————番————茄————",
        "example_sentence": "这段视频真是搞笑，‘老——————番————茄————’。",
        "meaning": "A humorous way to emphasize a point, often used to create a dramatic pause.",
        "source": "A syntactic structure that plays with elongation for comedic effect."
    },
    {
        "meme": "我的天",
        "example_sentence": "看到这个场景，我不禁感叹‘我的天’。",
        "meaning": "An expression of surprise or disbelief.",
        "source": "A common phrase in both online and offline contexts to react to shocking or unexpected events."
    },
    {
        "meme": "WTF",
        "example_sentence": "这个剧情发展得太离谱了，‘WTF’。",
        "meaning": "An expression of confusion or disbelief, often in response to absurd situations.",
        "source": "Originates from English internet slang, widely adopted in various online communities."
    },
    {
        "meme": "这招太绝了",
        "example_sentence": "他的反应真是太机智了，‘这招太绝了’。",
        "meaning": "Used to praise someone's cleverness or a particularly smart move.",
        "source": "Commonly used in contexts where quick thinking or clever tactics are displayed."
    },
    {
        "meme": "我再看最后亿遍就走",
        "example_sentence": "这个视频太好看了，我再看最后亿遍就走。",
        "meaning": "Indicates a humorous exaggeration about enjoying something to the point of obsession.",
        "source": "Reflects the tendency of users to binge-watch or repeatedly enjoy content."
    },
    {
        "meme": "绝对魔兽战线，我的初心",
        "example_sentence": "这段剧情让我想起了‘绝对魔兽战线，我的初心’。",
        "meaning": "A nostalgic reference to a beloved game or experience, often used to express deep affection.",
        "source": "References gaming culture and the emotional connections players have to their favorite games."
    }
]