[
    {
        "meme": "666",
        "example_sentence": "这台词何尝又不是一种NTR，666666666666666666666666666666666666666666666666666666666666666。",
        "meaning": "Used to express excitement or admiration, often in a humorous or exaggerated way.",
        "source": "Commonly used in Chinese online gaming and streaming communities."
    },
    {
        "meme": "爱爱爱爱",
        "example_sentence": "爱爱爱爱哎哎哎哎哎哎哎哎哎哎哎爱爱爱爱爱爱爱爱爱爱爱爱爱爱爱。",
        "meaning": "Expresses extreme affection or enthusiasm, often in a playful or exaggerated manner.",
        "source": "Commonly seen in online fan culture and social media."
    },
    {
        "meme": "用头撞桌子*22",
        "example_sentence": "用头撞桌子*22。",
        "meaning": "Indicates frustration or disbelief, often used humorously to show the absurdity of a situation.",
        "source": "A form of exaggerated expression commonly found in online forums."
    },
    {
        "meme": "哈哈哈哈",
        "example_sentence": "哈哈哈哈bgm调皮。",
        "meaning": "Used to indicate laughter, often in response to something funny or absurd.",
        "source": "A common expression in Chinese internet culture."
    },
    {
        "meme": "随时有人系列",
        "example_sentence": "随时有人系列。",
        "meaning": "Refers to the idea that there are always people present or watching, often used humorously.",
        "source": "Originates from various online discussions and memes."
    },
    {
        "meme": "太心酸了",
        "example_sentence": "太心酸了。。。",
        "meaning": "Used to express deep sadness or empathy, often in a relatable context.",
        "source": "Commonly used in emotional discussions online."
    },
    {
        "meme": "这尼玛是自认国际生物了",
        "example_sentence": "这尼玛是自认国际生物了，还可以再宏伟点。",
        "meaning": "Used humorously to mock someone’s pretentiousness or self-importance.",
        "source": "Emerging from humorous online commentary."
    },
    {
        "meme": "我的心都是冰冰的",
        "example_sentence": "我的心都是冰冰的。",
        "meaning": "Indicates emotional numbness or a lack of feeling, often used in a dramatic or humorous context.",
        "source": "Common in discussions about emotional states online."
    },
    {
        "meme": "收下我的膝盖！！！！！！！！",
        "example_sentence": "收下我的膝盖！！！！！！！！",
        "meaning": "A humorous way to express admiration or submission to someone’s talent or greatness.",
        "source": "Commonly used in fan culture and online praise."
    },
    {
        "meme": "我草",
        "example_sentence": "我草，黑帮啊。",
        "meaning": "An expression of surprise or disbelief, often used in an informal context.",
        "source": "Commonly found in casual online conversations."
    },
    {
        "meme": "我的天哪~",
        "example_sentence": "我的天哪~。",
        "meaning": "An expression of astonishment or disbelief, often with a playful tone.",
        "source": "Commonly used in everyday online interactions."
    },
    {
        "meme": "这也太神金了",
        "example_sentence": "这也太神金了。",
        "meaning": "Used to describe something as amazing or impressive, often in a sarcastic or exaggerated way.",
        "source": "Emerging from humorous commentary in online discussions."
    },
    {
        "meme": "太有文化了，吃了有文化的亏",
        "example_sentence": "太有文化了，吃了有文化的亏。",
        "meaning": "Used to humorously comment on a situation where knowledge or sophistication leads to unexpected trouble.",
        "source": "Commonly found in discussions about cultural experiences."
    },
    {
        "meme": "我活着就是为了这一段！",
        "example_sentence": "我活着就是为了这一段！",
        "meaning": "Expresses a sense of purpose or excitement about a specific moment or experience.",
        "source": "Commonly used in fan commentary or reaction videos."
    }
]