[
    {
        "meme": "啊啊啊啊啊",
        "example_sentence": "我看到这个视频的时候，情不自禁地喊出: '啊啊啊啊啊!'",
        "meaning": "Expresses strong emotional reactions such as excitement, surprise, or frustration.",
        "source": "Commonly used in various online platforms, especially in Chinese pop culture."
    },
    {
        "meme": "武士之魂",
        "example_sentence": "这部电影让我感受到浓厚的'武士之魂'。",
        "meaning": "Refers to the spirit and values associated with samurai culture, often used to describe bravery and honor.",
        "source": "Popularized in various anime and film contexts."
    },
    {
        "meme": "老哥",
        "example_sentence": "老哥，你怎么看这件事？",
        "meaning": "A casual term for 'bro' or 'dude', often used to address friends or peers.",
        "source": "Common slang in Chinese internet culture."
    },
    {
        "meme": "真实伤害",
        "example_sentence": "这次比赛的失利让我感受到'真实伤害'。",
        "meaning": "Refers to a genuine emotional impact or pain caused by a situation, often used humorously.",
        "source": "Originates from gaming and has been popularized in memes."
    },
    {
        "meme": "你卡了吗？",
        "example_sentence": "在直播中，看到画面卡顿，我忍不住问: '你卡了吗？'",
        "meaning": "A playful way to check if someone is experiencing technical issues, often used in streaming contexts.",
        "source": "Commonly used in online streaming and gaming communities."
    },
    {
        "meme": "哈哈哈哈哈哈",
        "example_sentence": "这个笑话实在太好笑了，'哈哈哈哈哈哈'停不下来。",
        "meaning": "An expression of laughter, often exaggerated for comedic effect.",
        "source": "General internet culture, used widely in comments and chats."
    },
    {
        "meme": "狗头",
        "example_sentence": "他说的话让我想起了'狗头'表情包。",
        "meaning": "Refers to a specific meme or expression, often used to indicate sarcasm or humor.",
        "source": "Derived from popular internet memes, often used in reaction images."
    },
    {
        "meme": "永远的信仰",
        "example_sentence": "这首歌是我'永远的信仰'。",
        "meaning": "Indicates something that holds deep personal significance or loyalty.",
        "source": "Commonly used in fandoms and communities to express devotion."
    },
    {
        "meme": "真香",
        "example_sentence": "起初不喜欢这个菜，结果吃了之后'真香'！",
        "meaning": "Used to express a surprising realization that something is better than expected.",
        "source": "Originated from a viral meme in Chinese internet culture."
    },
    {
        "meme": "23333333",
        "example_sentence": "这个视频太搞笑了，我忍不住打了'23333333'。",
        "meaning": "Represents laughter, often used to indicate something is very funny.",
        "source": "Derived from the Chinese internet, where '2' is associated with laughter."
    },
    {
        "meme": "加油站陪一根",
        "example_sentence": "在加油站看到他，我忍不住说'加油站陪一根'。",
        "meaning": "A humorous phrase indicating support or companionship in a mundane situation.",
        "source": "Popularized in online discussions and memes."
    },
    {
        "meme": "大声告诉我",
        "example_sentence": "在聚会上，他'大声告诉我'他的梦想。",
        "meaning": "Used to emphasize the importance of sharing one's thoughts or feelings loudly and clearly.",
        "source": "Commonly used in motivational or humorous contexts."
    },
    {
        "meme": "这也太...",
        "example_sentence": "看到这个价格，我心里想: '这也太贵了吧！'",
        "meaning": "An expression of disbelief or surprise at a situation, often used to emphasize a reaction.",
        "source": "A common structure in online comments for dramatic effect."
    }
]