[
    {
        "meme": "哈哈哈好讽刺",
        "example_sentence": "看到这个视频的结尾，我忍不住笑了，'哈哈哈好讽刺'。",
        "meaning": "Used to express amusement at a situation that is ironically contrary to expectations.",
        "source": "Common online reaction to ironic content."
    },
    {
        "meme": "前来考古",
        "example_sentence": "2025年2月10日前来考古，看看当年的热评。",
        "meaning": "Used to indicate someone is revisiting old content, often for nostalgia or to see historical comments.",
        "source": "Originates from the practice of 'digging up' old posts or comments on social media."
    },
    {
        "meme": "太爽了！这就是被爱淹没的感觉吗？",
        "example_sentence": "看完这部电影，我感到'太爽了！这就是被爱淹没的感觉吗？'",
        "meaning": "Expresses overwhelming joy or satisfaction, often in a humorous or exaggerated manner.",
        "source": "Derived from emotional expressions in fan communities."
    },
    {
        "meme": "卧槽",
        "example_sentence": "卧槽，这个转折太惊人了！",
        "meaning": "An exclamation of surprise or shock, often used in an exaggerated manner.",
        "source": "Common slang in Chinese online communities."
    },
    {
        "meme": "草草草",
        "example_sentence": "草草草，这个剧情发展太快了！",
        "meaning": "A humorous expression of disbelief or excitement, often used in rapid succession to emphasize a reaction.",
        "source": "Popularized in online gaming and streaming cultures."
    },
    {
        "meme": "心人",
        "example_sentence": "这个角色真是太可爱了，'心人'！",
        "meaning": "A term of endearment or admiration for a character or person, often used in fandoms.",
        "source": "Derived from affectionate expressions in Chinese pop culture."
    },
    {
        "meme": "我勒个胜利队啊",
        "example_sentence": "看到这个比赛结果，我真是'我勒个胜利队啊'。",
        "meaning": "An expression of disbelief or excitement regarding an unexpected victory.",
        "source": "Common in sports commentary and fan reactions."
    },
    {
        "meme": "666",
        "example_sentence": "这个操作太帅了，'666'！",
        "meaning": "Used to praise or express admiration for something impressive or skillful.",
        "source": "Originally from gaming culture, now widely used in various contexts."
    },
    {
        "meme": "无感情",
        "example_sentence": "这段表演真是'无感情'，完全没带入感。",
        "meaning": "Used to describe a performance or action that lacks emotional depth or connection.",
        "source": "Commonly used in critiques of performances or media."
    },
    {
        "meme": "这不就是广州",
        "example_sentence": "看到这个场景，我想到了'这不就是广州'。",
        "meaning": "A humorous way to point out something typical of a specific place or culture.",
        "source": "Reflects regional humor and cultural references."
    },
    {
        "meme": "洗脑",
        "example_sentence": "这首歌真是洗脑，听了一遍就停不下来。",
        "meaning": "Describes something that is catchy or addictive, often used for music or trends.",
        "source": "Commonly used in discussions about viral content."
    },
    {
        "meme": "一枪把地鸣打了出来",
        "example_sentence": "这场比赛太精彩了，简直'一枪把地鸣打了出来'。",
        "meaning": "Used to describe a decisive or impressive action that leads to a significant outcome.",
        "source": "Derived from gaming or competitive contexts."
    },
    {
        "meme": "你敢想象吗这是一个自媒体团队做的片子",
        "example_sentence": "看完这个视频，'你敢想象吗这是一个自媒体团队做的片子'。",
        "meaning": "Expresses disbelief at the quality or production value of content created by independent creators.",
        "source": "Reflects the rise of self-produced media in the digital age."
    },
    {
        "meme": "哇，我女儿肯定爱吃",
        "example_sentence": "看到这个美食视频，'哇，我女儿肯定爱吃'。",
        "meaning": "Used to express excitement about food, often in a familial or affectionate context.",
        "source": "Common in food-related content and discussions."
    },
    {
        "meme": "这段真的大了",
        "example_sentence": "这段剧情'这段真的大了'，太震撼了。",
        "meaning": "Indicates that a particular moment or scene was impactful or significant.",
        "source": "Often used in film or media reviews."
    },
    {
        "meme": "我去，白的",
        "example_sentence": "看到这个价格，我'我去，白的'，太贵了。",
        "meaning": "An expression of shock or disbelief, often regarding something unexpected.",
        "source": "Common in casual conversations about prices or surprising facts."
    },
    {
        "meme": "这块真的是预言了",
        "example_sentence": "这个剧情发展真是'这块真的是预言了'，完全在预料之中。",
        "meaning": "Used to describe a situation that seems to predict future events accurately.",
        "source": "Commonly used in discussions about plot twists or foreshadowing."
    },
    {
        "meme": "太极限了吧",
        "example_sentence": "这场比赛的表现'太极限了吧'，真是惊人。",
        "meaning": "Used to express that something is at the extreme limit of expectations or capabilities.",
        "source": "Often used in competitive or performance contexts."
    }
]