[
    {
        "meme": "充电饼叔",
        "example_sentence": "充电饼叔，这段直接起飞。",
        "meaning": "Refers to a humorous character or persona that embodies a laid-back or carefree attitude, often used in the context of enjoying life or entertainment.",
        "source": "Originates from various online communities discussing humorous internet personalities."
    },
    {
        "meme": "哈哈哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈哈哈金钟罩哈哈哈哈哈哈绝了。",
        "meaning": "Used to express extreme amusement or laughter, often in response to something funny or absurd.",
        "source": "Commonly used across various social media platforms."
    },
    {
        "meme": "要吐了",
        "example_sentence": "这段看完给我整蒙了，要吐了。",
        "meaning": "Expresses overwhelming feelings of confusion or disgust, often used humorously.",
        "source": "Common internet slang."
    },
    {
        "meme": "我个",
        "example_sentence": "我个，真是太搞笑了。",
        "meaning": "An expression of surprise or disbelief, often used to emphasize a reaction.",
        "source": "Commonly used in casual speech and online comments."
    },
    {
        "meme": "2333333333333333",
        "example_sentence": "2333333333333333，笑得我吐了。",
        "meaning": "A way to represent laughter, similar to 'LOL', often used in response to something funny.",
        "source": "Originates from online forums and chat platforms."
    },
    {
        "meme": "啊？！！！！",
        "example_sentence": "啊？！！！！这段直接起飞。",
        "meaning": "An expression of shock or disbelief, often used to highlight a surprising or unexpected moment.",
        "source": "Common use in conversational Chinese."
    },
    {
        "meme": "比北上广都贵啊",
        "example_sentence": "这地方好有风骚律师的场景感，比北上广都贵啊。",
        "meaning": "Used to comment on the high cost of living in a particular area, often with a humorous tone.",
        "source": "Refers to the expensive cities of Beijing, Shanghai, and Guangzhou."
    },
    {
        "meme": "我飞天上就没下来过",
        "example_sentence": "我飞天上就没下来过，感觉在读库看过诶。",
        "meaning": "Expresses a feeling of being in a euphoric or elevated state, often used humorously.",
        "source": "Commonly used in internet slang."
    },
    {
        "meme": "这大爷，也太可爱了吧",
        "example_sentence": "这大爷，也太可爱了吧，看到boy进来的。",
        "meaning": "Used to express affection or endearment towards someone, usually in a light-hearted context.",
        "source": "Commonly used in online comments."
    },
    {
        "meme": "痛心啊",
        "example_sentence": "痛心啊，看到这么多可爱的人。",
        "meaning": "Used to express a mix of sadness and affection, often humorously.",
        "source": "Commonly used in emotional or nostalgic contexts."
    },
    {
        "meme": "这句你喝了么好像法老说的啊！",
        "example_sentence": "这句你喝了么好像法老说的啊！",
        "meaning": "A humorous reference to a popular phrase or quote, suggesting a connection to a well-known figure or context.",
        "source": "Likely refers to popular culture or memes circulating online."
    },
    {
        "meme": "我真喷出来口水了",
        "example_sentence": "我真喷出来口水了，太搞笑了。",
        "meaning": "Used to express extreme amusement, indicating that something is so funny it caused a physical reaction.",
        "source": "Commonly used in humorous contexts."
    },
    {
        "meme": "我踏马",
        "example_sentence": "我踏马，这段直接起飞。",
        "meaning": "An expression of surprise or emphasis, often used to highlight a strong reaction to something.",
        "source": "Commonly used in casual speech."
    },
    {
        "meme": "注意：",
        "example_sentence": "注意：2:16图里背后勺子和叉子的插画。",
        "meaning": "Used to draw attention to something specific, often in a humorous or critical context.",
        "source": "Commonly used in instructional or commentary formats."
    },
    {
        "meme": "这地方好有风骚律师的场景感",
        "example_sentence": "这地方好有风骚律师的场景感，是在这里取景的嘛？",
        "meaning": "Used to draw a comparison to a well-known show or setting, often humorously.",
        "source": "Refers to the popular series 'Better Call Saul' (风骚律师)."
    },
    {
        "meme": "这也太草率了",
        "example_sentence": "这也太草率了，感觉没有准备好。",
        "meaning": "Used to criticize something that appears to be done hastily or without proper thought.",
        "source": "Commonly used in online discussions."
    }
]