[
    {
        "meme": "呵呵哒",
        "example_sentence": "4个够了，每个人分0.8份，呵呵哒",
        "meaning": "Used to convey sarcasm or a sense of irony, often implying that the situation is not as light-hearted as it seems.",
        "source": "Commonly used in Chinese internet slang, often associated with a dismissive attitude."
    },
    {
        "meme": "真的！！！",
        "example_sentence": "真的！！！手機也在震",
        "meaning": "Expresses strong affirmation or surprise, often used to emphasize disbelief or astonishment.",
        "source": "Popularized in various online communities as an emphatic expression."
    },
    {
        "meme": "好好好好好好好好好好好",
        "example_sentence": "好好好好好好好好好好好",
        "meaning": "Repetition of '好' (good) to emphasize agreement or enthusiasm, often used humorously.",
        "source": "A syntactic structure that has become a meme in online conversations."
    },
    {
        "meme": "哈哈哈哈哈哈哈",
        "example_sentence": "哈哈哈哈哈哈收了但只收了一部分",
        "meaning": "A repeated laughter expression, indicating amusement or mockery.",
        "source": "Commonly used in online comments and social media to express laughter."
    },
    {
        "meme": "一场盛大的黑色幽默",
        "example_sentence": "一场盛大的黑色幽默",
        "meaning": "Refers to a situation or event that is darkly humorous, often involving irony or absurdity.",
        "source": "A phrase commonly used in discussions about media or events that have a darkly comedic aspect."
    },
    {
        "meme": "跳伞20:08",
        "example_sentence": "跳伞20:08",
        "meaning": "Refers to a specific time, often used humorously to indicate a significant or dramatic moment.",
        "source": "This format has been used in various contexts to create a sense of urgency or importance."
    },
    {
        "meme": "我靠，这眼神",
        "example_sentence": "我靠，这眼神",
        "meaning": "An expression of surprise or admiration, often used when something catches one's attention unexpectedly.",
        "source": "A common reaction in online discussions, particularly in response to visuals."
    },
    {
        "meme": "绝了，真的绝了",
        "example_sentence": "绝了，真的绝了",
        "meaning": "Used to express amazement or disbelief at something extraordinary or absurd.",
        "source": "A phrase that has gained popularity in various online conversations."
    },
    {
        "meme": "鬼兵队！给老子上！",
        "example_sentence": "鬼兵队！给老子上！",
        "meaning": "A rallying cry, often used humorously to indicate enthusiasm or readiness for action.",
        "source": "Derived from gaming or anime culture, widely used in fan communities."
    },
    {
        "meme": "我不吃也熱",
        "example_sentence": "我不吃也熱",
        "meaning": "Used humorously to express indifference or to indicate that something is not worth the effort.",
        "source": "A phrase that has become popular in online discussions, reflecting a laid-back attitude."
    },
    {
        "meme": "你指尖跃动的电光，是我此生不变的信仰",
        "example_sentence": "你指尖跃动的电光，是我此生不变的信仰，唯我超电磁炮永世长存。",
        "meaning": "A poetic expression indicating deep admiration or devotion, often used in fandom contexts.",
        "source": "Originates from anime culture, particularly related to the series 'A Certain Scientific Railgun.'"
    },
    {
        "meme": "老大我爱你！",
        "example_sentence": "老大我爱你！",
        "meaning": "A playful or affectionate expression, often used in a humorous or exaggerated manner.",
        "source": "Common in online interactions, especially among younger audiences."
    },
    {
        "meme": "我靠",
        "example_sentence": "我靠，这眼神",
        "meaning": "An exclamation of surprise or amazement, often used to convey strong feelings.",
        "source": "A common expression in Chinese internet slang."
    },
    {
        "meme": "这没法说，他真跑过。",
        "example_sentence": "这没法说，他真跑过。",
        "meaning": "Indicates that something is undeniable or self-evident, often used to express a strong opinion.",
        "source": "A phrase that has gained traction in online discussions."
    },
    {
        "meme": "你再乱讲！",
        "example_sentence": "你再乱讲！",
        "meaning": "A humorous way to call out someone for speaking nonsense or making outrageous claims.",
        "source": "Commonly used in playful arguments or banter in online comments."
    }
]